init.org
#+TITLE:    Configurations for GNU Emacs
#+AUTHOR:   Takaaki Ishikawa
#+EMAIL:    takaxp@ieee.org
#+STARTUP:  content
#+STARTUP:  nohideblocks

* はじめに
  - この文章は，[[https://gist.github.com/1369417][org2dokuwiki.pl]]を使って生成しています．
  - [[https://github.com/takaxp/emacs.d/blob/master/init.el][init.el]] 本体は，[[https://github.com/takaxp/emacs.d/][github]] に公開しています．
  - [[https://github.com/takaxp/emacs.d/blob/master/init.org][init.org]] から [[https://github.com/takaxp/emacs.d/blob/master/init.el][init.el]]，[[https://github.com/takaxp/emacs.d/raw/master/init.pdf][init.pdf]]，[[https://github.com/takaxp/emacs.d/raw/master/init.odt][init.odt]]，[[http://pastelwill.jp/wiki/doku.php?id=emacs:init.el][wiki]] を生成しています．
  - 一部の関数定義を [[http://pastelwill.jp/wiki/doku.php?id=emacs:utility.el][utility.el]] に分離しています．
  - コピペだけで動かなかった場合は，ページ最下部のコメント欄にご意見をどうぞ．

* 基本設定

  この設定群を利用するために設定です．おそらく記述しておかないと動きません．

