init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Configurations for GNU Emacs</title>
<!-- 2015-06-05 Fri 00:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Takaaki Ishikawa" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
</head>
<body>
<div id="content">
<h1 class="title">Configurations for GNU Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. はじめに</a></li>
<li><a href="#orgheadline13">2. 基本設定</a>
<ul>
<li><a href="#orgheadline2">2.1. init.el のヘッダ</a></li>
<li><a href="#orgheadline3">2.2. cl を使う</a></li>
<li><a href="#orgheadline4">2.3. リストで関数を渡せる autoload-if-found を使う</a></li>
<li><a href="#orgheadline7">2.4. [eval-after-autoload-if-found.el] 遅延読み込み</a>
<ul>
<li><a href="#orgheadline5">2.4.1. マクロ版</a></li>
<li><a href="#orgheadline6">2.4.2. 関数版</a></li>
</ul>
</li>
<li><a href="#orgheadline8">2.5. 警告の抑制</a></li>
<li><a href="#orgheadline9">2.6. 起動時間の計測</a></li>
<li><a href="#orgheadline11">2.7. C-x C-c で容易にEmacsを終了させないように質問する</a>
<ul>
<li><a href="#orgheadline10">2.7.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#orgheadline12">2.8. Messages 出力を封じるためのマクロ</a></li>
</ul>
</li>
<li><a href="#orgheadline31">3. コア設定</a>
<ul>
<li><a href="#orgheadline14">3.1. 言語／文字コード</a></li>
<li><a href="#orgheadline15">3.2. 日本語入力</a></li>
<li><a href="#orgheadline16">3.3. [ag.el] 検索</a></li>
<li><a href="#orgheadline17">3.4. 基本キーバインド</a></li>
<li><a href="#orgheadline18">3.5. ナローイングするか</a></li>
<li><a href="#orgheadline19">3.6. バッファの終わりでのnewlineを禁止する</a></li>
<li><a href="#orgheadline20">3.7. 常に最終行に一行追加する</a></li>
<li><a href="#orgheadline21">3.8. 長い文章を右端で常に折り返す</a></li>
<li><a href="#orgheadline22">3.9. バッファが外部から編集された場合に自動で再読み込みする</a></li>
<li><a href="#orgheadline23">3.10. [uniquify.el] 同じバッファ名が開かれた場合に区別する</a></li>
<li><a href="#orgheadline24">3.11. マウスで選択した領域を自動コピー</a></li>
<li><a href="#orgheadline27">3.12. パッケージ管理</a>
<ul>
<li><a href="#orgheadline25">3.12.1. Cask のセットアップ</a></li>
<li><a href="#orgheadline26">3.12.2. load-path を一箇所にして起動を高速化</a></li>
</ul>
</li>
<li><a href="#orgheadline28">3.13. インデント</a></li>
<li><a href="#orgheadline29">3.14. [aggressive-indent] 即時バッファ整形</a></li>
<li><a href="#orgheadline30">3.15. ファイルリンクを辿る時に確認のメッセージを出さない</a></li>
</ul>
</li>
<li><a href="#orgheadline45">4. カーソル移動</a>
<ul>
<li><a href="#orgheadline32">4.1. バッファ内のカーソル移動</a></li>
<li><a href="#orgheadline33">4.2. バッファ間のカーソル移動</a></li>
<li><a href="#orgheadline34">4.3. スクロールを制御</a></li>
<li><a href="#orgheadline35">4.4. スクロールで表示を重複させる行数</a></li>
<li><a href="#orgheadline37">4.5. [SmoothScroll.el] カーソル固定でスクロールする</a>
<ul>
<li><a href="#orgheadline36">4.5.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#orgheadline38">4.6. [smooth-scroll.el] 滑らかなスクロール</a></li>
<li><a href="#orgheadline40">4.7. [point-undo.el] カーソル位置を簡単にたどる</a>
<ul>
<li><a href="#orgheadline39">4.7.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#orgheadline42">4.8. [cycle-buffer.el] カレントバッファの表示切り替え</a>
<ul>
<li><a href="#orgheadline41">4.8.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#orgheadline43">4.9. [bm.el] カーソル位置をブックマークして追う</a></li>
<li><a href="#orgheadline44">4.10. [centered-cursor-mode.el] カーソル位置を中央に固定</a></li>
</ul>
</li>
<li><a href="#orgheadline82">5. 編集サポート</a>
<ul>
<li><a href="#orgheadline46">5.1. 矩形編集／連番入力</a></li>
<li><a href="#orgheadline47">5.2. Yank時に装飾を取る</a></li>
<li><a href="#orgheadline48">5.3. ファイル保存時に時間を記録する</a></li>
<li><a href="#orgheadline49">5.4. 選択リージョンを使って検索</a></li>
<li><a href="#orgheadline50">5.5. ChangeLog モード</a></li>
<li><a href="#orgheadline51">5.6. テキストモード</a></li>
<li><a href="#orgheadline52">5.7. C/C++モード</a></li>
<li><a href="#orgheadline53">5.8. C#モード</a></li>
<li><a href="#orgheadline54">5.9. Infoモード</a></li>
<li><a href="#orgheadline55">5.10. Rモード</a></li>
<li><a href="#orgheadline56">5.11. nXMLモード</a></li>
<li><a href="#orgheadline57">5.12. yamlモード</a></li>
<li><a href="#orgheadline58">5.13. jsonモード</a></li>
<li><a href="#orgheadline59">5.14. javascriptモード</a></li>
<li><a href="#orgheadline60">5.15. csvモード</a></li>
<li><a href="#orgheadline62">5.16. スペルチェック</a>
<ul>
<li><a href="#orgheadline61">5.16.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#orgheadline63">5.17. リアルタイムスペルチェック</a></li>
<li><a href="#orgheadline64">5.18. [latex-math-preview.el] TeX数式をプレビュー</a></li>
<li><a href="#orgheadline65">5.19. [po-mode.el] 翻訳ファイルの編集</a></li>
<li><a href="#orgheadline66">5.20. [word-count.el] リージョン内の文字をカウントする</a></li>
<li><a href="#orgheadline67">5.21. [yatex.el] YaTeXモード</a></li>
<li><a href="#orgheadline68">5.22. [wclock.el] 世界時計</a></li>
<li><a href="#orgheadline69">5.23. [yasnippet.el] Emacs用のテンプレートシステム</a></li>
<li><a href="#orgheadline71">5.24. [sdic.el] 英辞郎で英単語を調べる</a>
<ul>
<li><a href="#orgheadline70">5.24.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#orgheadline74">5.25. MacOSのdictionary.appでCOBUILD5の辞書をひく</a>
<ul>
<li><a href="#orgheadline72">5.25.1. マイナーモード化</a></li>
<li><a href="#orgheadline73">5.25.2. キーバインド</a></li>
</ul>
</li>
<li><a href="#orgheadline76">5.26. [lookup.el] 辞書</a>
<ul>
<li><a href="#orgheadline75">5.26.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#orgheadline77">5.27. [cacoo] Cacoo で描く</a></li>
<li><a href="#orgheadline78">5.28. [iedit] バッファ内の同じ文字列を一度に編集する</a></li>
<li><a href="#orgheadline79">5.29. [web-mode] HTML編集</a></li>
<li><a href="#orgheadline80">5.30. [zencoding-mode] HTML編集の高速化</a></li>
<li><a href="#orgheadline81">5.31. [emmet-mode] zencoding の後継</a></li>
</ul>
</li>
<li><a href="#orgheadline107">6. 表示サポート</a>
<ul>
<li><a href="#orgheadline83">6.1. モードラインのモード名を短くする</a></li>
<li><a href="#orgheadline84">6.2. モードラインのNarrowを短くする</a></li>
<li><a href="#orgheadline86">6.3. モードラインの色をカスタマイズする</a>
<ul>
<li><a href="#orgheadline85">6.3.1. 色セット例</a></li>
</ul>
</li>
<li><a href="#orgheadline87">6.4. visible-bell のカスタマイズ</a></li>
<li><a href="#orgheadline88">6.5. 常に <b>scratch</b> を表示して起動する</a></li>
<li><a href="#orgheadline89">6.6. バッテリー情報をモードラインに表示する</a></li>
<li><a href="#orgheadline90">6.7. スクロールバーを非表示にする</a></li>
<li><a href="#orgheadline91">6.8. ツールバーを非表示にする</a></li>
<li><a href="#orgheadline92">6.9. 起動時のスプラッシュ画面を表示しない</a></li>
<li><a href="#orgheadline93">6.10. カーソル行の行数をモードラインに表示する</a></li>
<li><a href="#orgheadline94">6.11. カーソル行の関数名をモードラインに表示する</a></li>
<li><a href="#orgheadline95">6.12. 時刻をモードラインに表示する</a></li>
<li><a href="#orgheadline96">6.13. 対応するカッコをハイライトする</a></li>
<li><a href="#orgheadline97">6.14. 全角スペースと行末タブ／半角スペースを強調表示する</a></li>
<li><a href="#orgheadline98">6.15. [migemo.el] ローマ字入力で日本語を検索する</a></li>
<li><a href="#orgheadline100">6.16. [anything.el] 何でも絞り込みインターフェイス</a>
<ul>
<li><a href="#orgheadline99">6.16.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#orgheadline102">6.17. [helm.el] 続・何でも絞り込みインターフェイス</a>
<ul>
<li><a href="#orgheadline101">6.17.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#orgheadline103">6.18. [stripe-buffer.el] テーブルの色をストライプにする</a></li>
<li><a href="#orgheadline104">6.19. [rainbow-delimiters] 対応するカッコに色を付ける</a></li>
<li><a href="#orgheadline105">6.20. [git-gutter-fringe] 編集差分をフレーム端で視覚化</a></li>
<li><a href="#orgheadline106">6.21. [zlc.el] find-file バッファを zsh ライクにする</a></li>
</ul>
</li>
<li><a href="#orgheadline111">7. メディアサポート</a>
<ul>
<li><a href="#orgheadline108">7.1. [bongo.el] Emacsのバッファで音楽ライブラリを管理する</a></li>
<li><a href="#orgheadline109">7.2. [GoogleMaps.el] GoogleMaps を Emacs 内で使う</a></li>
<li><a href="#orgheadline110">7.3. [org-google-weather.el] org-agenda に天気を表示する</a></li>
</ul>
</li>
<li><a href="#orgheadline126">8. 履歴／ファイル管理</a>
<ul>
<li><a href="#orgheadline112">8.1. Undoバッファを無限に取る</a></li>
<li><a href="#orgheadline113">8.2. [undo-tree] 編集履歴をわかりやすくたどる</a></li>
<li><a href="#orgheadline114">8.3. バッファ保存時にバックアップファイルを生成する</a></li>
<li><a href="#orgheadline115">8.4. バッファ保存時にバックアップを生成させない</a></li>
<li><a href="#orgheadline116">8.5. ミニバッファの履歴を保存しリストアする</a></li>
<li><a href="#orgheadline117">8.6. 履歴サイズを大きくする</a></li>
<li><a href="#orgheadline118">8.7. Emacs終了時に開いていたバッファを起動時に復元する</a></li>
<li><a href="#orgheadline119">8.8. 最近開いたファイルリストを保持</a></li>
<li><a href="#orgheadline120">8.9. 深夜にバッファを自動整理する</a></li>
<li><a href="#orgheadline121">8.10. [auto-save-buffers.el] 一定間隔でバッファを保存する</a></li>
<li><a href="#orgheadline122">8.11. [backup-dir.el] バックアップファイルを一箇所に集める</a></li>
<li><a href="#orgheadline123">8.12. [backup-each-save] クラッシュに備える</a></li>
<li><a href="#orgheadline124">8.13. [session.el] 様々な履歴を保存し復元に利用する</a></li>
<li><a href="#orgheadline125">8.14. [wakatime-mode.el] WakaTime を利用して作業記録する</a></li>
</ul>
</li>
<li><a href="#orgheadline136">9. 開発サポート</a>
<ul>
<li><a href="#orgheadline127">9.1. 便利キーバインド</a></li>
<li><a href="#orgheadline128">9.2. [gist.el] Gist インターフェイス</a></li>
<li><a href="#orgheadline129">9.3. [doxymacs.el] Doxygen のコメントを簡単に入力する</a></li>
<li><a href="#orgheadline130">9.4. [matlab.el] Matlab用の設定</a></li>
<li><a href="#orgheadline131">9.5. [flycheck.el] 構文エラー表示</a></li>
<li><a href="#orgheadline132">9.6. [auto-complete.el] 自動補完機能</a></li>
<li><a href="#orgheadline134">9.7. [auto-complete-clang.el] オムニ補完</a>
<ul>
<li><a href="#orgheadline133">9.7.1. 参考サイト</a></li>
</ul>
</li>
<li><a href="#orgheadline135">9.8. [hideshowvis.el] 関数の表示／非表示</a></li>
</ul>
</li>
<li><a href="#orgheadline168">10. Org Mode</a>
<ul>
<li><a href="#orgheadline137">10.1. 基本設定</a></li>
<li><a href="#orgheadline138">10.2. contribution を使う</a></li>
<li><a href="#orgheadline139">10.3. iCal との連携</a></li>
<li><a href="#orgheadline140">10.4. スピードコマンド</a></li>
<li><a href="#orgheadline141">10.5. Pomodoro</a></li>
<li><a href="#orgheadline142">10.6. face 関連</a></li>
<li><a href="#orgheadline143">10.7. <span class="todo nilTODO">TODO</span> キーワードのカスタマイズ</a></li>
<li><a href="#orgheadline144">10.8. ImageMagick を使って様々な画像をインライン表示する</a></li>
<li><a href="#orgheadline145">10.9. [org-agenda]</a></li>
<li><a href="#orgheadline146">10.10. [appt.el] アラーム設定</a></li>
<li><a href="#orgheadline147">10.11. [org-capture] 高速にメモを取る</a></li>
<li><a href="#orgheadline148">10.12. [org-refile]</a></li>
<li><a href="#orgheadline149">10.13. [org-babel] 基本設定</a></li>
<li><a href="#orgheadline150">10.14. [org-babel] ソースブロックの入力キーをカスタマイズ</a></li>
<li><a href="#orgheadline151">10.15. [MobileOrg] iOS との連携</a></li>
<li><a href="#orgheadline152">10.16. [org-tree-slide] Org でプレゼンテーション</a></li>
<li><a href="#orgheadline153">10.17. [org-tree-slide] クロックインとアウトを自動化する</a></li>
<li><a href="#orgheadline155">10.18. [org-tree-slide] 特定のツリーをプロポーショナルフォントで表示する</a>
<ul>
<li><a href="#orgheadline154">10.18.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#orgheadline156">10.19. [org-fstree] ディレクトリ構造を読み取る</a></li>
<li><a href="#orgheadline157">10.20. [calfw-org] calfw に org の予定を表示する</a></li>
<li><a href="#orgheadline158">10.21. [org-export-generic] エクスポート機能を拡張する</a></li>
<li><a href="#orgheadline159">10.22. [org-odt] ODT形式に出力</a></li>
<li><a href="#orgheadline160">10.23. [org-crypt] ツリーを暗号化する</a></li>
<li><a href="#orgheadline161">10.24. [org-mac-link] 外部アプリから情報を取る</a></li>
<li><a href="#orgheadline162">10.25. [org-notify] 通知</a></li>
<li><a href="#orgheadline163">10.26. [org-grep] org ファイルを grep する</a></li>
<li><a href="#orgheadline164">10.27. <span class="todo nilREAD">READ</span> ME を常に org-mode で開く</a></li>
<li><a href="#orgheadline166">10.28. Growlnotify と org-mode でアラーム管理</a>
<ul>
<li><a href="#orgheadline165">10.28.1. キーバインド</a></li>
</ul>
</li>
<li><a href="#orgheadline167">10.29. org-mode の latex エクスポート関数をオーバーライド</a></li>
</ul>
</li>
<li><a href="#orgheadline184">11. フォント／配色関連</a>
<ul>
<li><a href="#orgheadline169">11.1. 正規表現を見やすくする</a></li>
<li><a href="#orgheadline170">11.2. 設定ファイルを見やすくする</a></li>
<li><a href="#orgheadline171">11.3. カーソル行に色をつける</a></li>
<li><a href="#orgheadline172">11.4. カーソルの色</a></li>
<li><a href="#orgheadline173">11.5. カーソルを点滅させない</a></li>
<li><a href="#orgheadline174">11.6. カーソル位置のフォントを確認</a></li>
<li><a href="#orgheadline177">11.7. フォント設定</a>
<ul>
<li><a href="#orgheadline175">11.7.1. フォントのインストール方法</a></li>
<li><a href="#orgheadline176">11.7.2. フォントチェック用コード</a></li>
</ul>
</li>
<li><a href="#orgheadline178">11.8. 行間を制御する</a></li>
<li><a href="#orgheadline179">11.9. パッチをカラフルに表示する</a></li>
<li><a href="#orgheadline180">11.10. 背景を黒系色にする</a></li>
<li><a href="#orgheadline182">11.11. [rainbow-mode.el] 配色のリアルタイム確認</a>
<ul>
<li><a href="#orgheadline181">11.11.1. 色一覧</a></li>
</ul>
</li>
<li><a href="#orgheadline183">11.12. [volatile-highlights] コピペした領域を強調</a></li>
</ul>
</li>
<li><a href="#orgheadline190">12. フレーム／ウィンドウ制御</a>
<ul>
<li><a href="#orgheadline185">12.1. 起動時の設定</a></li>
<li><a href="#orgheadline186">12.2. [elscreen.el] Emacs バッファをタブ化</a></li>
<li><a href="#orgheadline187">12.3. [e2wm.el] 二画面表示</a></li>
<li><a href="#orgheadline188">12.4. [frame-ctr.el] キーボードでフレームの場所を移す</a></li>
<li><a href="#orgheadline189">12.5. [popwin.el] ポップアップウィンドウの制御</a></li>
</ul>
</li>
<li><a href="#orgheadline193">13. ユーティリティ関数</a>
<ul>
<li><a href="#orgheadline191">13.1. [pomodoro.el] ポモドーロの実践</a></li>
<li><a href="#orgheadline192">13.2. [utility.el] 自作してテスト中の便利関数群</a></li>
</ul>
</li>
<li><a href="#orgheadline195">14. お試し中</a>
<ul>
<li><a href="#orgheadline194">14.1. yascroll</a></li>
</ul>
</li>
<li><a href="#orgheadline196">15. provide</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> はじめに</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>この文章は，<a href="https://gist.github.com/1369417">org2dokuwiki.pl</a>を使って生成しています．<br  /></li>
<li><a href="https://github.com/takaxp/emacs.d/blob/master/init.el">init.el</a> 本体は，<a href="https://github.com/takaxp/emacs.d/">github</a> に公開しています．<br  /></li>
<li><a href="https://github.com/takaxp/emacs.d/blob/master/init.org">init.org</a> から <a href="https://github.com/takaxp/emacs.d/blob/master/init.el">init.el</a>，<a href="https://github.com/takaxp/emacs.d/raw/master/init.pdf">init.pdf</a>，<a href="https://github.com/takaxp/emacs.d/raw/master/init.odt">init.odt</a>，<a href="http://pastelwill.jp/wiki/doku.php?id=emacs:init.el">wiki</a> を生成しています．<br  /></li>
<li>一部の関数定義を <a href="http://pastelwill.jp/wiki/doku.php?id=emacs:utility.el">utility.el</a> に分離しています．<br  /></li>
<li>コピペだけで動かなかった場合は，ページ最下部のコメント欄にご意見をどうぞ．<br  /></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">2</span> 基本設定</h2>
<div class="outline-text-2" id="text-2">
<p>
この設定群を利用するために設定です．おそらく記述しておかないと動きません．<br  />
</p>
</div>
