init.org
** init.el のヘッダ

#+BEGIN_SRC emacs-lisp :tangle yes
  ;;;; Configurations for Emacs
  ;;;;                                       Takaaki ISHIKAWA  <takaxp@ieee.org>
  ;;;; Cite: http://www.mygooglest.com/fni/dot-emacs.html (GREAT!)
#+END_SRC

** cl を使う
   http://lisperblog.blogspot.com/2008/12/blog-post_18.html

#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-when-compile (require 'cl-lib))
#+END_SRC

** リストで関数を渡せる autoload-if-found を使う
   http://d.hatena.ne.jp/jimo1001/20090921/1253525484

   eval-after-load とのペアでマクロ化したバージョンもある（次章参照）．

   http://e-arrows.sakura.ne.jp/2010/03/macros-in-emacs-el.html

#+BEGIN_SRC emacs-lisp :tangle no
  (defun autoload-if-found (functions file &optional docstring interactive type)
    "set autoload iff. FILE has found."
    (if (not (listp functions))
        (setq functions (list functions)))
    (and (locate-library file)
         (progn
           (dolist (function functions)
             (autoload function file docstring interactive type))
           t )))
#+END_SRC

** [eval-after-autoload-if-found.el] 遅延読み込み

Twitterでぼやいていたら [[https://twitter.com/cvmat][@cvmat]]さんが降臨して次のマクロを作ってくださいました．感謝感謝．

   [[https://gist.github.com/3513287]]

autoload-if-found で遅延読み込みすると，eval-after-load と組み合わせるので，どうしてもインデントが増えてしまう．

例えば，cycle-buffer を遅延読み込みしたい場合， =setq= で変数を書き換えするために随分とインデントが進んでいます．

   # (eval-after-autoload-if-found '(f1 f2) "f")       ;; autoload に複数指定
   # (eval-after-autoload-if-found '(f1 f2) "f" nil t) ;; interactive を使う時
   # (when (eval-after-autoload-if-found '(f1 f2) "f" nil t nil '()) (add-hook..) 

#+BEGIN_SRC emacs-lisp :tangle no
  (when (autoload-if-found
         '(cycle-buffer cycle-buffer-backward) "cycle-buffer" nil t)
    (with-eval-after-load "cycle-buffer"
      (setq cycle-buffer-allow-visible t)
      (setq cycle-buffer-show-length 12)
      (setq cycle-buffer-show-format '(" <(%s)>" . " %s"))))
#+END_SRC

これを，次の eval-after-autoload-func.el を使うと，非常にシンプルになります．行数も桁数もスッキリです．

#+BEGIN_SRC emacs-lisp :tangle no
  (eval-after-autoload-if-found
   '(cycle-buffer cycle-buffer-backward) ;; autoload で反応させる関数
   "cycle-buffer" nil t nil      ;; 反応させた関数のコールで読むパッケージ指定
   '(;; パッケージ読み込み後の設定
     (setq cycle-buffer-allow-visible t)
     (setq cycle-buffer-show-length 12)
     (setq cycle-buffer-show-format '(" <(%s)>" . " %s"))))
#+END_SRC

戻り値を判定して，グローバルなキーアサインもできます．存在しないパッケージの関数呼び出しを明示的に防ぐには有効です． =hook= も同様です．

#+BEGIN_SRC emacs-lisp :tangle no
  (when (eval-after-autoload-if-found
         '(cycle-buffer cycle-buffer-backward) "cycle-buffer" nil t nil
         '((setq cycle-buffer-allow-visible t)
           (setq cycle-buffer-show-length 12)
           (setq cycle-buffer-show-format '(" <(%s)>" . " %s"))
           ;; パッケージのキーアサインはこちら
           ;; (define-key xxx-map (kbd "q") 'hoge)
           ))
    ;; グローバルはこちら
    (global-set-key (kbd "M-]") 'cycle-buffer)
    (global-set-key (kbd "M-[") 'cycle-buffer-backward)
    ;; パッケージに紐付いたフックはこちらへ
    ;; (add-hook 'xxx-hook 'hogehoge)
    ;;
    ;; ビルドインではないmodeの auto-mode-alist 設定も必要ならこちら
    ;; (push '("\\.hoge$" . hoge-mode) auto-mode-alist)
    )
#+END_SRC

*** マクロ版

[[https://gist.github.com/3499459]]

#+BEGIN_SRC emacs-lisp :tangle no
  (defmacro eval-after-autoload-if-found
      (functions file &optional docstring interactive type &rest after-body)
    "Set up autoload and eval-after-load for FUNCTIONS iff. FILE has found."
    `(let* ((functions ,functions)
            (docstring ,docstring)
            (interactive ,interactive)
            (type ,type)
            (file ,file))
       (when (locate-library file)
         (mapc (lambda (func)
                 (autoload func file docstring interactive type))
               (if (listp functions)
                   functions
                 (list functions)))
         ,@(when after-body
             `((eval-after-load file '(progn ,@after-body))))
         t)))
#+END_SRC

