init.html

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> init.el のヘッダ</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;;;; </span><span style="color: #b22222;">Configurations for Emacs</span>
<span style="color: #b22222;">;;;;                                       </span><span style="color: #b22222;">Takaaki ISHIKAWA  <a href="mailto:takaxp%40ieee.org">&lt;takaxp@ieee.org&gt;</a></span>
<span style="color: #b22222;">;;;; </span><span style="color: #b22222;">Cite: http://www.mygooglest.com/fni/dot-emacs.html (GREAT!)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> cl を使う</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="http://lisperblog.blogspot.com/2008/12/blog-post_18.html">http://lisperblog.blogspot.com/2008/12/blog-post_18.html</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">eval-when-compile</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">cl-lib</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.3</span> リストで関数を渡せる autoload-if-found を使う</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="http://d.hatena.ne.jp/jimo1001/20090921/1253525484">http://d.hatena.ne.jp/jimo1001/20090921/1253525484</a><br  />
</p>

<p>
eval-after-load とのペアでマクロ化したバージョンもある（次章参照）．<br  />
</p>

<p>
<a href="http://e-arrows.sakura.ne.jp/2010/03/macros-in-emacs-el.html">http://e-arrows.sakura.ne.jp/2010/03/macros-in-emacs-el.html</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">autoload-if-found</span> (functions file <span style="color: #228b22;">&amp;optional</span> docstring interactive type)
  <span style="color: #8b2252;">"set autoload iff. FILE has found."</span>
  (<span style="color: #a020f0;">if</span> (not (listp functions))
      (setq functions (list functions)))
  (and (locate-library file)
       (<span style="color: #a020f0;">progn</span>
         (<span style="color: #a020f0;">dolist</span> (function functions)
           (autoload function file docstring interactive type))
         t )))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.4</span> [eval-after-autoload-if-found.el] 遅延読み込み</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Twitterでぼやいていたら <a href="https://twitter.com/cvmat">@cvmat</a>さんが降臨して次のマクロを作ってくださいました．感謝感謝．<br  />
</p>

<p>
<a href="https://gist.github.com/3513287">https://gist.github.com/3513287</a><br  />
</p>

<p>
autoload-if-found で遅延読み込みすると，eval-after-load と組み合わせるので，どうしてもインデントが増えてしまう．<br  />
</p>

<p>
例えば，cycle-buffer を遅延読み込みしたい場合， <code>setq</code> で変数を書き換えするために随分とインデントが進んでいます．<br  />
</p>



<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (autoload-if-found
       '(cycle-buffer cycle-buffer-backward) <span style="color: #8b2252;">"cycle-buffer"</span> nil t)
  (eval-after-load <span style="color: #8b2252;">"cycle-buffer"</span>
    '(<span style="color: #a020f0;">progn</span>
       (setq cycle-buffer-allow-visible t)
       (setq cycle-buffer-show-length 12)
       (setq cycle-buffer-show-format '(<span style="color: #8b2252;">" &lt;(%s)&gt;"</span> . <span style="color: #8b2252;">" %s"</span>)))))
</pre>
</div>

<p>
これを，次の eval-after-autoload-func.el を使うと，非常にシンプルになります．行数も桁数もスッキリです．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(cycle-buffer cycle-buffer-backward) <span style="color: #b22222;">;; </span><span style="color: #b22222;">autoload &#12391;&#21453;&#24540;&#12373;&#12379;&#12427;&#38306;&#25968;</span>
 <span style="color: #8b2252;">"cycle-buffer"</span> nil t nil      <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#21453;&#24540;&#12373;&#12379;&#12383;&#38306;&#25968;&#12398;&#12467;&#12540;&#12523;&#12391;&#35501;&#12416;&#12497;&#12483;&#12465;&#12540;&#12472;&#25351;&#23450;</span>
 '(<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12497;&#12483;&#12465;&#12540;&#12472;&#35501;&#12415;&#36796;&#12415;&#24460;&#12398;&#35373;&#23450;</span>
   (setq cycle-buffer-allow-visible t)
   (setq cycle-buffer-show-length 12)
   (setq cycle-buffer-show-format '(<span style="color: #8b2252;">" &lt;(%s)&gt;"</span> . <span style="color: #8b2252;">" %s"</span>))))
</pre>
</div>

<p>
戻り値を判定して，グローバルなキーアサインもできます．存在しないパッケージの関数呼び出しを明示的に防ぐには有効です． <code>hook</code> も同様です．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(cycle-buffer cycle-buffer-backward) <span style="color: #8b2252;">"cycle-buffer"</span> nil t nil
       '((setq cycle-buffer-allow-visible t)
         (setq cycle-buffer-show-length 12)
         (setq cycle-buffer-show-format '(<span style="color: #8b2252;">" &lt;(%s)&gt;"</span> . <span style="color: #8b2252;">" %s"</span>))
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12461;&#12540;&#12450;&#12469;&#12452;&#12531;&#12399;&#12371;&#12385;&#12425;</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">(define-key xxx-map (kbd "q") 'hoge)</span>
         ))
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12464;&#12525;&#12540;&#12496;&#12523;&#12399;&#12371;&#12385;&#12425;</span>
  (global-set-key (kbd <span style="color: #8b2252;">"M-]"</span>) 'cycle-buffer)
  (global-set-key (kbd <span style="color: #8b2252;">"M-["</span>) 'cycle-buffer-backward)
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#32016;&#20184;&#12356;&#12383;&#12501;&#12483;&#12463;&#12399;&#12371;&#12385;&#12425;&#12408;</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">(add-hook 'xxx-hook 'hogehoge)</span>
  <span style="color: #b22222;">;;</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12499;&#12523;&#12489;&#12452;&#12531;&#12391;&#12399;&#12394;&#12356;mode&#12398; auto-mode-alist &#35373;&#23450;&#12418;&#12371;&#12385;&#12425;</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">(push '("\\.hoge$" . hoge-mode) auto-mode-alist)</span>
  )
</pre>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">2.4.1</span> マクロ版</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
<a href="https://gist.github.com/3499459">https://gist.github.com/3499459</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">eval-after-autoload-if-found</span>
    (functions file <span style="color: #228b22;">&amp;optional</span> docstring interactive type <span style="color: #228b22;">&amp;rest</span> after-body)
  <span style="color: #8b2252;">"Set up autoload and eval-after-load for FUNCTIONS iff. FILE has found."</span>
  `(<span style="color: #a020f0;">let*</span> ((functions ,functions)
          (docstring ,docstring)
          (interactive ,interactive)
          (type ,type)
          (file ,file))
     (<span style="color: #a020f0;">when</span> (locate-library file)
       (mapc (<span style="color: #a020f0;">lambda</span> (func)
               (autoload func file docstring interactive type))
             (<span style="color: #a020f0;">if</span> (listp functions)
                 functions
               (list functions)))
       ,@(<span style="color: #a020f0;">when</span> after-body
           `((eval-after-load file '(<span style="color: #a020f0;">progn</span> ,@after-body))))
       t)))
</pre>
</div>
</div>
</div>
