init.org
*** 関数版

関数版にリスト =disabled-packages= を追加しました．これは，事前にリストに Lisp ファイル名を入れておくと，一切の設定をスキップするものです． =eval-after-atoload-if-found= を定義する前に次のような変数を設定しておきます．バイトコンパイルしていないファイルに書いて置けば，パッケージのON/OFFを簡単に制御できます．

#+BEGIN_SRC emacs-lisp :tangle no :exports yes
  (setq disabled-packages ;; 追加されていないものは，有効
        '(("org" . t) ;; 無効
          ("web-mode" . nil) ;; 有効
          ("helm-config" . t))) ;; 無効
#+END_SRC

[[https://gist.github.com/3513287]]

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun eval-after-autoload-if-found
      (functions file &optional docstring interactive type after-body)
    "Set up autoload and eval-after-load for FUNCTIONS iff. FILE has found."
    (let ((enabled t)
          (package nil))
      (when (boundp 'disabled-packages)
        (dolist (package disabled-packages)
          (when (and (stringp (car package)) (equal file (car package)))
            (when (cdr package)
              (setq enabled nil)))))
      (when enabled ;; if disabled then return nil
        (when (locate-library file)
          (mapc (lambda (func)
                  (autoload func file docstring interactive type))
                (if (listp functions)
                    functions
                  (list functions)))
          (when after-body
            (eval-after-load file `(progn ,@after-body)))
          t))))
#+END_SRC

** [library-p] load-path にライブラリがあるかを判定

パッケージが load-path に存在していて使える状態にあるかを調べます．もし存在しなければ，メッセージバッファに [NOT FOUND]を刻みます．

=libraries= には複数を指定でき，すべてが使える状態の場合のみ =t= が返ります．

="org"= を渡したり， ='("org" "helm")= を渡したりできます．

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun library-p (libraries)
    "Return t when every specified library can be located. "
    (let ((result t))
      (mapc (lambda (library)
              (unless (locate-library library)
                (message "--- [NOT FOUND] %s" library)
                (setq result nil)))
            (if (listp libraries)
                libraries
              (list libraries)))
      result))
#+END_SRC

** 警告の抑制

起動時に警告が出てうっとうしい場合に使います．起動直後に呼ばれるように， =.emacs= の上の方に書いておくとよいと思います．

[[http://d.hatena.ne.jp/kitokitoki/20100425/p1]]

#+BEGIN_SRC emacs-lisp :tangle no
  (setq byte-compile-warnings
        '(free-vars unresolved callargs redefine obsolete noruntime
                    cl-functions interactive-only make-local))
#+END_SRC

** 起動時間の計測

=emacs-init-time= を実行すると，Emacsの起動にかかった時間が表示されます．個人的にはミリ秒表示が好きなので，手を加えます．元ネタは[[http://d.hatena.ne.jp/sugyan/20120120/1327037494][すぎゃーんメモ]]からです．感謝．

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'after-init-hook
            (lambda ()
              (message "--- Emacs booting time: %.0f [msec]"
                       (* 1000
                          (float-time (time-subtract
                                       after-init-time
                                       before-init-time))))))
#+END_SRC

** C-x C-c で容易にEmacsを終了させないように質問する

=y-or-n-p= を指定するだけです．

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq confirm-kill-emacs 'y-or-n-p)  
#+END_SRC

以前は， =C-x C-c= を以下の関数に割り当てて，任意の質問文で入力を求めていました．

#+BEGIN_SRC emacs-lisp :tangle no
  ;;; Cite: http://flex.ee.uec.ac.jp/texi/emacs-jp/emacs-jp_12.html
  ;;; Cite: http://d.hatena.ne.jp/Ubuntu/20090417/1239934416
  ;; A simple solution is (setq confirm-kill-emacs 'y-or-n-p).
  (defun confirm-save-buffers-kill-emacs (&optional arg)
    "Show yes or no when you try to kill Emacs"
    (interactive "P")
    (cond (arg (save-buffers-kill-emacs))
          (t
           (when (yes-or-no-p "Are you sure to quit Emacs now? ")
             (save-buffers-kill-emacs)))))
#+END_SRC

*** キーバインド

    Show yes or no when you try to kill Emacs
    #+BEGIN_SRC emacs-lisp :tangle no
      (global-set-key (kbd "C-x C-c") 'confirm-save-buffers-kill-emacs)
    #+END_SRC

** Messages 出力を封じるためのマクロ

=shut-up.el= というマクロがあり，現在はそちらを使っています．

#+BEGIN_SRC emacs-lisp :tangle no
  (defun hoge ()
    (interactive)
    (let ((message-log-max nil))
      (shut-up (recentf-save-list))))
#+END_SRC

（参考）[[http://qiita.com/itiut@github/items/d917eafd6ab255629346][Emacs - エコーエリアや *Messages* バッファにメッセージを表示させたくない - Qiita]]

非常に強力です．自分は， =recentf-save-list= を =find-file-hook= にぶら下げていますが，そのままだと =org-agenda= の初回実行時にたくさんのメッセージが出てしまうところ，このマクロを介すだけで抑制可能です． =message-log-max= で制御できるのがすごい．

#+BEGIN_SRC emacs-lisp :tangle no
  (defmacro with-suppressed-message (&rest body)
    "Suppress new messages temporarily in the echo area and the `*Messages*' buffer while BODY is evaluated."
    (declare (indent 0))
    (let ((message-log-max nil))
      `(with-temp-message (or (current-message) "") ,@body)))
#+END_SRC

* コア設定

Emacs を操作して文書編集する上で欠かせない設定です．

