init.html

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">2.4.2</span> 関数版</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
関数版にリスト <code>disabled-packages</code> を追加しました．これは，事前にリストに Lisp ファイル名を入れておくと，一切の設定をスキップするものです．=eval-after-atoload-if-found= を構成する前に次のような変数を設定しておきます．バイトコンパイルしていないファイルに書いて置けば，パッケージのON/OFFを簡単に制御できます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq disabled-packages <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#36861;&#21152;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12418;&#12398;&#12399;&#65292;&#26377;&#21177;</span>
      '((<span style="color: #8b2252;">"org"</span> . t) <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#28961;&#21177;</span>
        (<span style="color: #8b2252;">"web-mode"</span> . nil) <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#26377;&#21177;</span>
        (<span style="color: #8b2252;">"helm-config"</span> . t))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#28961;&#21177;</span>
</pre>
</div>

<p>
<a href="https://gist.github.com/3513287">https://gist.github.com/3513287</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">eval-after-autoload-if-found</span>
    (functions file <span style="color: #228b22;">&amp;optional</span> docstring interactive type after-body)
  <span style="color: #8b2252;">"Set up autoload and eval-after-load for FUNCTIONS iff. FILE has found."</span>
  (<span style="color: #a020f0;">let</span> ((enabled t)
        (package nil))
    (<span style="color: #a020f0;">when</span> (boundp 'disabled-packages)
      (<span style="color: #a020f0;">dolist</span> (package disabled-packages)
        <span style="color: #b22222;">;;        </span><span style="color: #b22222;">(when (and (stringp package) (equal file package))</span>
        (<span style="color: #a020f0;">when</span> (and (stringp (car package)) (equal file (car package)))
          (<span style="color: #a020f0;">when</span> (cdr package)
            (setq enabled nil)))))
    (<span style="color: #a020f0;">when</span> enabled <span style="color: #b22222;">;; </span><span style="color: #b22222;">if disabled then return nil</span>
      (<span style="color: #a020f0;">when</span> (locate-library file)
        (mapc (<span style="color: #a020f0;">lambda</span> (func)
                (autoload func file docstring interactive type))
              (<span style="color: #a020f0;">if</span> (listp functions)
                  functions
                (list functions)))
        (<span style="color: #a020f0;">when</span> after-body
          (eval-after-load file `(<span style="color: #a020f0;">progn</span> ,@after-body)))
        t))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">eval-after-autoload-if-found</span>
    (functions file <span style="color: #228b22;">&amp;optional</span> docstring interactive type after-body)
  <span style="color: #8b2252;">"Set up autoload and eval-after-load for FUNCTIONS iff. FILE has found."</span>
  (<span style="color: #a020f0;">let</span> ((enabled t)
        (package nil))
    (<span style="color: #a020f0;">when</span> (boundp 'disabled-packages)
      (<span style="color: #a020f0;">dolist</span> (package disabled-packages)
        (<span style="color: #a020f0;">when</span> (and (stringp package) (equal file package))
          (setq enabled nil))))
    (<span style="color: #a020f0;">when</span> enabled <span style="color: #b22222;">;; </span><span style="color: #b22222;">if disabled then return nil</span>
      (<span style="color: #a020f0;">when</span> (locate-library file)
        (mapc (<span style="color: #a020f0;">lambda</span> (func)
                (autoload func file docstring interactive type))
              (<span style="color: #a020f0;">if</span> (listp functions)
                  functions
                (list functions)))
        (<span style="color: #a020f0;">when</span> after-body
          (eval-after-load file `(<span style="color: #a020f0;">progn</span> ,@after-body)))
        t))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.5</span> 警告の抑制</h3>
<div class="outline-text-3" id="text-2-5">
<p>
起動時に警告が出てうっとうしい場合に使います．起動直後に呼ばれるように， <code>.emacs</code> の上の方に書いておくとよいと思います．<br  />
</p>

<p>
<a href="http://d.hatena.ne.jp/kitokitoki/20100425/p1">http://d.hatena.ne.jp/kitokitoki/20100425/p1</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq byte-compile-warnings
      '(free-vars unresolved callargs redefine obsolete noruntime
                  cl-functions interactive-only make-local))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.6</span> 起動時間の計測</h3>
<div class="outline-text-3" id="text-2-6">
<p>
<code>emacs-init-time</code> を実行すると，Emacsの起動にかかった時間が表示されます．個人的にはミリ秒表示が好きなので，手を加えます．元ネタは<a href="http://d.hatena.ne.jp/sugyan/20120120/1327037494">すぎゃーんメモ</a>からです．感謝．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'after-init-hook
          (<span style="color: #a020f0;">lambda</span> ()
            (message <span style="color: #8b2252;">"--- Emacs booting time: %.0f [msec]"</span>
                     (* 1000
                        (float-time (time-subtract
                                     after-init-time
                                     before-init-time))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">2.7</span> C-x C-c で容易にEmacsを終了させないように質問する</h3>
<div class="outline-text-3" id="text-2-7">
<p>
<code>y-or-n-p</code> を指定するだけです．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq confirm-kill-emacs 'y-or-n-p)
</pre>
</div>

<p>
以前は， <code>C-x C-c</code> を以下の関数に割り当てて，任意の質問文で入力を求めていました．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;;; </span><span style="color: #b22222;">Cite: http://flex.ee.uec.ac.jp/texi/emacs-jp/emacs-jp_12.html</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Cite: http://d.hatena.ne.jp/Ubuntu/20090417/1239934416</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">A simple solution is (setq confirm-kill-emacs 'y-or-n-p).</span>
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">confirm-save-buffers-kill-emacs</span> (<span style="color: #228b22;">&amp;optional</span> arg)
  <span style="color: #8b2252;">"Show yes or no when you try to kill Emacs"</span>
  (interactive <span style="color: #8b2252;">"P"</span>)
  (<span style="color: #a020f0;">cond</span> (arg (save-buffers-kill-emacs))
        (t
         (<span style="color: #a020f0;">when</span> (yes-or-no-p <span style="color: #8b2252;">"Are you sure to quit Emacs now? "</span>)
           (save-buffers-kill-emacs)))))
</pre>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">2.7.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
Show yes or no when you try to kill Emacs<br  />
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #8b2252;">"C-x C-c"</span>) 'confirm-save-buffers-kill-emacs)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">2.8</span> Messages 出力を封じるためのマクロ</h3>
<div class="outline-text-3" id="text-2-8">
<p>
<code>shut-up.el</code> というマクロがあり，現在はそちらを使っています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">hoge</span> ()
  (interactive)
  (<span style="color: #a020f0;">let</span> ((message-log-max nil))
    (shut-up (recentf-save-list))))
</pre>
</div>

<p>
（参考）<a href="http://qiita.com/itiut@github/items/d917eafd6ab255629346">Emacs - エコーエリアや <b>Messages</b> バッファにメッセージを表示させたくない - Qiita</a><br  />
</p>

<p>
非常に強力です．自分は， <code>recentf-save-list</code> を <code>find-file-hook</code> にぶら下げていますが，そのままだと <code>org-agenda</code> の初回実行時にたくさんのメッセージが出てしまうところ，このマクロを介すだけで抑制可能です． <code>message-log-max</code> で制御できるのがすごい．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">with-suppressed-message</span> (<span style="color: #228b22;">&amp;rest</span> body)
  <span style="color: #8b2252;">"Suppress new messages temporarily in the echo area and the `</span><span style="color: #8b2252;">*Messages*</span><span style="color: #8b2252;">' buffer while BODY is evaluated."</span>
  (<span style="color: #a020f0;">declare</span> (indent 0))
  (<span style="color: #a020f0;">let</span> ((message-log-max nil))
    `(<span style="color: #a020f0;">with-temp-message</span> (or (current-message) <span style="color: #8b2252;">""</span>) ,@body)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline31" class="outline-2">
<h2 id="orgheadline31"><span class="section-number-2">3</span> コア設定</h2>
<div class="outline-text-2" id="text-3">
<p>
Emacs を操作して文書編集する上で欠かせない設定です．<br  />
</p>
</div>
