init.el

(defun eval-after-autoload-if-found
    (functions file &optional docstring interactive type after-body)
  "Set up autoload and eval-after-load for FUNCTIONS iff. FILE has found."
  (let ((enabled t)
        (package nil))
    (when (boundp 'disabled-packages)
      (dolist (package disabled-packages)
        (when (and (stringp (car package)) (equal file (car package)))
          (when (cdr package)
            (setq enabled nil)))))
    (when enabled ;; if disabled then return nil
      (when (locate-library file)
        (mapc (lambda (func)
                (autoload func file docstring interactive type))
              (if (listp functions)
                  functions
                (list functions)))
        (when after-body
          (eval-after-load file `(progn ,@after-body)))
        t))))

(defun library-p (libraries)
  "Return t when every specified library can be located. "
  (let ((result t))
    (mapc (lambda (library)
            (unless (locate-library library)
              (message "--- [NOT FOUND] %s" library)
              (setq result nil)))
          (if (listp libraries)
              libraries
            (list libraries)))
    result))

(add-hook 'after-init-hook
          (lambda ()
            (message "--- Emacs booting time: %.0f [msec]"
                     (* 1000
                        (float-time (time-subtract
                                     after-init-time
                                     before-init-time))))))

(setq confirm-kill-emacs 'y-or-n-p)
