init.org
** 言語／文字コード

徹底的にUTF-8に合わせます．

=save-buffer-coding-system= を設定すると， =buffer-file-coding-system= の値を無視して，指定した =save-buffer-coding-system= の値でバッファを保存する．つまり， =buffer-file-coding-system= に統一するなら設定不要．

=set-default-coding-systems= か =prefer-coding-system= を設定すると，同時に =file-name-coding-system=，=set-terminal-coding-system=，=set-keyboard-coding-system= も同時に設定される．=prefer-coding-system= は，文字コード自動判定の最上位判定項目を設定する．

=set-buffer-file-coding-system= は，Xとのデータやりとりを設定する．

#+BEGIN_SRC emacs-lisp :tangle yes
  (prefer-coding-system 'utf-8-unix)
  (set-language-environment "Japanese")
  (set-locale-environment "en_US.UTF-8") ; "ja_JP.UTF-8"
  (set-default-coding-systems 'utf-8-unix)
  (set-selection-coding-system 'utf-8-unix)
  (set-buffer-file-coding-system 'utf-8-unix)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no :exports no
  (set-clipboard-coding-system 'utf-8) ; included by set-selection-coding-system
  (set-keyboard-coding-system 'utf-8) ; configured by prefer-coding-system
  (set-terminal-coding-system 'utf-8) ; configured by prefer-coding-system
  (setq buffer-file-coding-system 'utf-8) ; utf-8-unix
  (setq save-buffer-coding-system 'utf-8-unix) ; nil
  (set-buffer-process-coding-system 'utf-8 'utf-8)
  (setq process-coding-system-alist
        (cons '("grep" utf-8 . utf-8) process-coding-system-alist))
#+END_SRC

** 日本語入力

Emacs23用にインラインパッチを適用している場合に使います．
Lion でも使える自分用にカスタマイズした [[https://gist.github.com/1532344][inline-patch]] を使っています．

Emacs24用には，Mavericks対応した[[https://gist.github.com/takaxp/9658281][パッチ]]を使っています．

Emacs24.5用は[[https://gist.github.com/takaxp/1d91107b311b63b57529][こちら]]．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (fboundp 'mac-add-key-passed-to-system)
    (setq default-input-method "MacOSX")
    (mac-add-key-passed-to-system 'shift))
#+END_SRC

** [ag.el] 検索

検索には =The Silver Searcher= を使います．あらかじめインストールしておく必要があります．MacPorts の場合，the_silver_searcher の名称で頒布されています． =exec-path= に =/opt/local/bin= が含まれていることを確認してください．

#+BEGIN_EXAMPLE
the_silver_searcher @0.18.1 (textproc)
 A code-searching tool similar to ack, but faster.
#+END_EXAMPLE

カスタマイズした関数を =C-M-f= にぶら下げています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(my:ag) "ag" nil t nil
         '((setq ag-highlight-search t)
           (setq ag-reuse-buffers t) ;; nil=別ウィンドウが開く
           (setq ag-reuse-window t)  ;; nil=結果を選択時に別ウィンドウに結果:を出す
           ;; q でウィンドウを抜ける
           (define-key ag-mode-map (kbd "q") 'delete-window)

           (defun my:ag ()
             (interactive)
             (call-interactively 'ag)
             (switch-to-buffer-other-frame "*ag search*"))))

    (global-set-key (kbd "C-M-f") 'my:ag))
#+END_SRC

** 基本キーバインド

次の機能にキーバインドを設定する．

- Cmd+V でペースト（Mac用）
- Cmd と Option を逆にする（Mac用）
- 削除

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eq window-system 'ns)
    (global-set-key (kbd "M-v") 'yank)
    (setq ns-command-modifier 'meta)
    (setq ns-alternate-modifier 'super)
    (global-set-key [ns-drag-file] 'ns-find-file) ; D&D for Emacs23
    (setq ns-pop-up-frames nil)) ; D&D for Emacs23
  (global-set-key [delete] 'delete-char)
  (global-set-key [kp-delete] 'delete-char)
#+END_SRC

** ナローイングするか
ナローイングを有効にする．デフォルトは，ナローイングを知らないユーザが「データが消えた！」と勘違いしないように，無効になっている．

Org でナローイングを使う場合は，特に設定しなくてもよい．

#+BEGIN_SRC emacs-lisp :tangle no
  (put 'narrow-to-region 'disabled nil)
#+END_SRC

** バッファの終わりでのnewlineを禁止する

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Avoid adding a new line at the end of buffer
  (setq next-line-add-newlines nil)
#+END_SRC

** 常に最終行に一行追加する

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Limit the final word to a line break code (automatically correct)
  (setq require-final-newline t)
#+END_SRC

** 長い文章を右端で常に折り返す

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq truncate-lines nil)
  (setq truncate-partial-width-windows nil)
#+END_SRC

** バッファが外部から編集された場合に自動で再読み込みする

=auto-save-buffers= を使っていれば，バッファは常に保存された状態になるため，revert が即座に反映される．適宜バックアップツールと組み合わせないと不安な場合もあるかも．

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-auto-revert-mode 1)
#+END_SRC

** [uniquify.el] 同じバッファ名が開かれた場合に区別する

ビルトインの =uniquify= を使います．

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq uniquify-buffer-name-style 'post-forward-angle-brackets)
#+END_SRC
** マウスで選択した領域を自動コピー

マウスで選択すると，勝手にペーストボードにデータが流れます．

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq mouse-drag-copy-region t)
#+END_SRC

** パッケージ管理

[[https://github.com/cask/cask][Cask]]+Palletの環境を採用しました．それまでは，特定のディレクトリに必要な elisp をダウンロードしておいたり，git から取り寄せて，それらをload-pathに設定するスクリプトを準備するなど，個人的なルールで運用してきましたが，希望の機能をCaskが提供しているので，Emacs24.4になるタイミングで移行しました．

ただし，頒布元が危ういようなファイルはやはり個人で管理しておきたいので，Caskで管理する対象は，MEPLA経由で入手可能なメンテナンスが行き届いたパッケージに限定しています．また，普通の使い方（casl.elを読み込んで初期化）をしていると，起動時に少し時間を要するので，所定のディレクトリにCaskで取り寄せたすべてのファイルをコピーして，そのディレクトリだけをload-pathで指定するという使い方もしています．今のところ大きな問題は生じていません．

