init.html

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.1</span> 言語／文字コード</h3>
<div class="outline-text-3" id="text-3-1">
<p>
徹底的にUTF-8に合わせます．<br  />
</p>

<p>
<code>save-buffer-coding-system</code> を設定すると， <code>buffer-file-coding-system</code> の値を無視して，指定した <code>save-buffer-coding-system</code> の値でバッファを保存する．つまり， <code>buffer-file-coding-system</code> に統一するなら設定不要．<br  />
</p>

<p>
<code>set-default-coding-systems</code> か <code>prefer-coding-system</code> を設定すると，同時に <code>file-name-coding-system=，=set-terminal-coding-system=，=set-keyboard-coding-system</code> も同時に設定される．=prefer-coding-system= は，文字コード自動判定の最上位判定項目を設定する．<br  />
</p>

<p>
<code>set-buffer-file-coding-system</code> は，Xとのデータやりとりを設定する．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(prefer-coding-system 'utf-8-unix)
(set-language-environment <span style="color: #8b2252;">"Japanese"</span>)
(set-locale-environment <span style="color: #8b2252;">"en_US.UTF-8"</span>) <span style="color: #b22222;">; </span><span style="color: #b22222;">"ja_JP.UTF-8"</span>
(set-default-coding-systems 'utf-8-unix)
(set-selection-coding-system 'utf-8-unix)
(set-buffer-file-coding-system 'utf-8-unix)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-clipboard-coding-system 'utf-8) <span style="color: #b22222;">; </span><span style="color: #b22222;">included by set-selection-coding-system</span>
(set-keyboard-coding-system 'utf-8) <span style="color: #b22222;">; </span><span style="color: #b22222;">configured by prefer-coding-system</span>
(set-terminal-coding-system 'utf-8) <span style="color: #b22222;">; </span><span style="color: #b22222;">configured by prefer-coding-system</span>
(setq buffer-file-coding-system 'utf-8) <span style="color: #b22222;">; </span><span style="color: #b22222;">utf-8-unix</span>
(setq save-buffer-coding-system 'utf-8-unix) <span style="color: #b22222;">; </span><span style="color: #b22222;">nil</span>
(set-buffer-process-coding-system 'utf-8 'utf-8)
(setq process-coding-system-alist
      (cons '(<span style="color: #8b2252;">"grep"</span> utf-8 . utf-8) process-coding-system-alist))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">3.2</span> 日本語入力</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Emacs23用にインラインパッチを適用している場合に使います．<br  />
Lion でも使える自分用にカスタマイズした <a href="https://gist.github.com/1532344">inline-patch</a> を使っています．<br  />
</p>

<p>
Emacs24用には，Mavericks対応した<a href="https://gist.github.com/takaxp/9658281">パッチ</a>を使っています．<br  />
</p>

<p>
Emacs24.5用は<a href="https://gist.github.com/takaxp/1d91107b311b63b57529">こちら</a>．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (fboundp 'mac-add-key-passed-to-system)
  (setq default-input-method <span style="color: #8b2252;">"MacOSX"</span>)
  (mac-add-key-passed-to-system 'shift))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">3.3</span> [ag.el] 検索</h3>
<div class="outline-text-3" id="text-3-3">
<p>
検索には <code>The Silver Searcher</code> を使います．あらかじめインストールしておく必要があります．MacPorts の場合，the_silver_searcher の名称で頒布されています． <code>exec-path</code> に <code>/opt/local/bin</code> が含まれていることを確認してください．<br  />
</p>

<pre class="example">
the_silver_searcher @0.18.1 (textproc)
    A code-searching tool similar to ack, but faster.
</pre>

<p>
カスタマイズした関数を <code>C-M-f</code> にぶら下げています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(my:ag) <span style="color: #8b2252;">"ag"</span> nil t nil
       '((setq ag-highlight-search t)
         (setq ag-reuse-buffers t) <span style="color: #b22222;">;; </span><span style="color: #b22222;">nil=&#21029;&#12454;&#12451;&#12531;&#12489;&#12454;&#12364;&#38283;&#12367;</span>
         (setq ag-reuse-window t)  <span style="color: #b22222;">;; </span><span style="color: #b22222;">nil=&#32080;&#26524;&#12434;&#36984;&#25246;&#26178;&#12395;&#21029;&#12454;&#12451;&#12531;&#12489;&#12454;&#12395;&#32080;&#26524;&#12434;&#20986;&#12377;</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">q &#12391;&#12454;&#12451;&#12531;&#12489;&#12454;&#12434;&#25244;&#12369;&#12427;</span>
         (define-key ag-mode-map (kbd <span style="color: #8b2252;">"q"</span>) 'delete-window)

         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:ag</span> ()
           (interactive)
           (call-interactively 'ag)
           (switch-to-buffer-other-frame <span style="color: #8b2252;">"*ag search*"</span>))))

  (global-set-key (kbd <span style="color: #8b2252;">"C-M-f"</span>) 'my:ag))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">3.4</span> 基本キーバインド</h3>
<div class="outline-text-3" id="text-3-4">
<p>
次の機能にキーバインドを設定する．<br  />
</p>

<ul class="org-ul">
<li>Cmd+V でペースト（Mac用）<br  /></li>
<li>Cmd と Option を逆にする（Mac用）<br  /></li>
<li>削除<br  /></li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eq window-system 'ns)
  (global-set-key (kbd <span style="color: #8b2252;">"M-v"</span>) 'yank)
  (setq ns-command-modifier 'meta)
  (setq ns-alternate-modifier 'super)
  (global-set-key [ns-drag-file] 'ns-find-file) <span style="color: #b22222;">; </span><span style="color: #b22222;">D&amp;D for Emacs23</span>
  (setq ns-pop-up-frames nil)) <span style="color: #b22222;">; </span><span style="color: #b22222;">D&amp;D for Emacs23</span>
(global-set-key [delete] 'delete-char)
(global-set-key [kp-delete] 'delete-char)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">3.5</span> ナローイングするか</h3>
<div class="outline-text-3" id="text-3-5">
<p>
ナローイングを有効にする．デフォルトは，ナローイングを知らないユーザが「データが消えた！」と勘違いしないように，無効になっている．<br  />
</p>

<p>
Org でナローイングを使う場合は，特に設定しなくてもよい．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(put 'narrow-to-region 'disabled nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">3.6</span> バッファの終わりでのnewlineを禁止する</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Avoid adding a new line at the end of buffer</span>
(setq next-line-add-newlines nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">3.7</span> 常に最終行に一行追加する</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Limit the final word to a line break code (automatically correct)</span>
(setq require-final-newline t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">3.8</span> 長い文章を右端で常に折り返す</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq truncate-lines nil)
(setq truncate-partial-width-windows nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">3.9</span> バッファが外部から編集された場合に自動で再読み込みする</h3>
<div class="outline-text-3" id="text-3-9">
<p>
<code>auto-save-buffers</code> を使っていれば，バッファは常に保存された状態になるため，revert が即座に反映される．適宜バックアップツールと組み合わせないと不安な場合もあるかも．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-auto-revert-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">3.10</span> [uniquify.el] 同じバッファ名が開かれた場合に区別する</h3>
<div class="outline-text-3" id="text-3-10">
<p>
ビルトインの <code>uniquify</code> を使います．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq uniquify-buffer-name-style 'post-forward-angle-brackets)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">3.11</span> マウスで選択した領域を自動コピー</h3>
<div class="outline-text-3" id="text-3-11">
<p>
マウスで選択すると，勝手にペーストボードにデータが流れます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq mouse-drag-copy-region t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">3.12</span> パッケージ管理</h3>
<div class="outline-text-3" id="text-3-12">
<p>
<a href="https://github.com/cask/cask">Cask</a>+Palletの環境を採用しました．それまでは，特定のディレクトリに必要な elisp をダウンロードしておいたり，git から取り寄せて，それらをload-pathに設定するスクリプトを準備するなど，個人的なルールで運用してきましたが，希望の機能をCaskが提供しているので，Emacs24.4になるタイミングで移行しました．<br  />
</p>

<p>
ただし，頒布元が危ういようなファイルはやはり個人で管理しておきたいので，Caskで管理する対象は，MEPLA経由で入手可能なメンテナンスが行き届いたパッケージに限定しています．また，普通の使い方（casl.elを読み込んで初期化）をしていると，起動時に少し時間を要するので，所定のディレクトリにCaskで取り寄せたすべてのファイルをコピーして，そのディレクトリだけをload-pathで指定するという使い方もしています．今のところ大きな問題は生じていません．<br  />
</p>
</div>
