init.org
*** Cask のセットアップ

 以下は自分用のメモです．

 1. curl -fsSkL https://raw.github.com/cask/cask/master/go | python
 2. ~/.cask/bin に PATH を通す (see .zshenv, export PATH="${HOME}/.cask/bin:{$PATH}")
 3. cask upgrade
 4. cd ~/.emacs.d
 5. cask init            ;; ~/.emacs.d/Cask が存在しない場合だけ実行
 6. cask install

*** load-path を一箇所にして起動を高速化

 Caskを使うと，個々のパッケージが独立にload-pathに設定されます．これにより依存関係がスッキリするわけですが，数が増えると起動時間が遅くなります．重いです．自分の例では，800[ms]のオーバーヘッドでした．これを避けるには，load-pathを一箇所に集約することが効きます．オーバーヘッドは約100[ms]まで集約できました．場合によっては依存関係に問題が生じる可能性がありますが，今のところは問題になっていません．

 1. =~/.emacs.d/.cask/package= なるフォルダを作る
 2. =~/.emacs.d/.cask/24.4.1/elpa/*/*= と =~/.emacs.d/.cask/24.4.1/elpa/*/lisp/*= をすべて上記フォルダにコピー
 3. ~/.emacs で，~/.emacs.d/.cask/package を load-path に設定し，Caskは読み込まない

 =M-x lis-packges= を使って新しいパッケージをインストールする時だけ，以下のフラグを nil に書き換えてEmacsを起動します．

#+BEGIN_SRC emacs-lisp :tangle no :exports yes
  (if t
      (load-path-setter '("~/.emacs.d/.cask/package") 'load-path)
    (when (require 'cask "~/.cask/cask.el" t) (cask-initialize)) ;; 800[ms]
    (when (require 'pallet nil t) (pallet-mode t)))
#+END_SRC

Cask で新しいパッケージを導入したり，既存のパッケージを更新したら，その都度，package ディレクトリにコピーします．手動でやると面倒なので，次のようなスクリプトで対処します．

#+BEGIN_SRC sh
  #!/bin/sh
  CASKPATH=/Users/taka/.emacs.d/.cask
  VERSION=24.5.1
  SUBDIR=package
  if [ -d "$CASKPATH/$SUBDIR" ]; then
      echo "--- Remove $CASKPATH/$SUBDIR"
      rm -rf $CASKPATH/$SUBDIR
  fi
  mkdir -p $CASKPATH/$SUBDIR

  cd ~/.emacs.d
  echo "--- Cask install"
  cask install

  echo "--- Cask update"
  cask update

  echo "--- Copying elisp files"
  /bin/cp -rf /Users/taka/.emacs.d/.cask/$VERSION/elpa/*/* $CASKPATH/$SUBDIR
  cd $CASKPATH/$SUBDIR

  echo "--- Done"
#+END_SRC

** インデント

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq-default tab-width 2)
  (setq-default indent-tabs-mode nil)
  (setq indent-line-function 'insert-tab)
  ;; (add-hook 'org-mode-hook
  ;;           '(lambda()
  ;;              (setq indent-line-function 'insert-tab)))
#+END_SRC

** [aggressive-indent] 即時バッファ整形

特定のメジャーモードで，とにかく整形しまくります．MELPAから入手できます．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(aggressive-indent-mode) "aggressive-indent")

    (add-hook 'emacs-lisp-mode-hook 'aggressive-indent-mode)
    (add-hook 'lisp-mode-hook 'aggressive-indent-mode)
    (add-hook 'perl-mode-hook 'aggressive-indent-mode)
    (add-hook 'c-mode-common-hook 'aggressive-indent-mode)
    (add-hook 'python-mode-hook 'aggressive-indent-mode)
    (add-hook 'nxml-mode-hook 'aggressive-indent-mode)
    (add-hook 'web-mode-hook 'aggressive-indent-mode))
#+END_SRC

** ファイルリンクを辿る時に確認のメッセージを出さない

そのまま辿ってファイルオープンします．

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq vc-follow-symlinks t)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no :exports no
  ;; autorevert.el の読み込みが必要
  (setq auto-revert-check-vc-info t)
#+END_SRC

* カーソル移動

  カーソルの移動は，次のポリシーに従っています．デフォルトではC-v/M-v で上下移動になっているが，M-v は windows のペーストに対応するので混乱を招くので使っていません．ページスクロールは標準の =cua-base.el= に記載されています．

  | 行移動                   | C-n/C-p     |
  | ページ移動（スクロール） | M-n/M-p     |
  | ウィンドウ移動           | C-M-n/C-M-p |
  | バッファ切り替え         | M-]/M-[     |

** バッファ内のカーソル移動

先頭に移動，最終行に移動，ページ単位の進む，ページ単位の戻る，行数を指定して移動

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "C-M-t") 'beginning-of-buffer)
  (global-set-key (kbd "C-M-b") 'end-of-buffer)
  ;; Backward page scrolling instead of M-v
  (global-set-key (kbd "M-p") 'scroll-down)
  ;; Frontward page scrolling instead of C-v
  (global-set-key (kbd "M-n") 'scroll-up)
  ;; Move cursor to a specific line
  (global-set-key (kbd "C-c g") 'goto-line)
#+END_SRC

** バッファ間のカーソル移動

=C-c o= の代わりに，ウィンドウの移動をワンアクションで行う．

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "C-M-p") '(lambda () (interactive) (other-window -1)))
  (global-set-key (kbd "C-M-n") '(lambda () (interactive) (other-window 1)))
#+END_SRC

