init.html

<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">3.12.1</span> Cask のセットアップ</h4>
<div class="outline-text-4" id="text-3-12-1">
<p>
以下は自分用のメモです．<br  />
</p>

<ol class="org-ol">
<li>curl -fsSkL <a href="https://raw.github.com/cask/cask/master/go">https://raw.github.com/cask/cask/master/go</a> | python<br  /></li>
<li>~/.cask/bin に PATH を通す (see .zshenv, export PATH="${HOME}/.cask/bin:{$PATH}")<br  /></li>
<li>cask upgrade<br  /></li>
<li>cd ~/.emacs.d<br  /></li>
<li>cask init            ;; ~/.emacs.d/Cask が存在しない場合だけ実行<br  /></li>
<li>cask install<br  /></li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">3.12.2</span> load-path を一箇所にして起動を高速化</h4>
<div class="outline-text-4" id="text-3-12-2">
<p>
Caskを使うと，個々のパッケージが独立にload-pathに設定されます．これにより依存関係がスッキリするわけですが，数が増えると起動時間が遅くなります．重いです．自分の例では，800[ms]のオーバーヘッドでした．これを避けるには，load-pathを一箇所に集約することが効きます．オーバーヘッドは約100[ms]まで集約できました．場合によっては依存関係に問題が生じる可能性がありますが，今のところは問題になっていません．<br  />
</p>

<ol class="org-ol">
<li><code>~/.emacs.d/.cask/package</code> なるフォルダを作る<br  /></li>
<li><code>~/.emacs.d/.cask/24.4.1/elpa/*/*</code> と <code>~/.emacs.d/.cask/24.4.1/elpa/*/lisp/*</code> をすべて上記フォルダにコピー<br  /></li>
<li>~/.emacs で，~/.emacs.d/.cask/package を load-path に設定し，Caskは読み込まない<br  /></li>
</ol>

<p>
<code>M-x lis-packges</code> を使って新しいパッケージをインストールする時だけ，以下のフラグを nil に書き換えてEmacsを起動します．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">if</span> t
    (load-path-setter '(<span style="color: #8b2252;">"~/.emacs.d/.cask/package"</span>) 'load-path)
  (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">cask</span> <span style="color: #8b2252;">"~/.cask/cask.el"</span> t) (cask-initialize)) <span style="color: #b22222;">;; </span><span style="color: #b22222;">800[ms]</span>
  (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">pallet</span> nil t) (pallet-mode t)))
</pre>
</div>

<p>
Cask で新しいパッケージを導入したり，既存のパッケージを更新したら，その都度，package ディレクトリにコピーします．手動でやると面倒なので，次のようなスクリプトで対処します．<br  />
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">sh</span>
<span style="color: #a0522d;">CASKPATH</span>=/Users/taka/.emacs.d/.cask
<span style="color: #a0522d;">VERSION</span>=24.5.1
<span style="color: #a0522d;">SUBDIR</span>=package
<span style="color: #a020f0;">if</span> [ -d <span style="color: #8b2252;">"$CASKPATH/$SUBDIR"</span> ]; <span style="color: #a020f0;">then</span>
    <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"--- Remove $CASKPATH/$SUBDIR"</span>
    rm -rf $<span style="color: #a0522d;">CASKPATH</span>/$<span style="color: #a0522d;">SUBDIR</span>
<span style="color: #a020f0;">fi</span>
mkdir -p $<span style="color: #a0522d;">CASKPATH</span>/$<span style="color: #a0522d;">SUBDIR</span>

<span style="color: #483d8b;">cd</span> ~/.emacs.d
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"--- Cask install"</span>
cask install

<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"--- Cask update"</span>
cask update

<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"--- Copying elisp files"</span>
/bin/cp -rf /Users/taka/.emacs.d/.cask/$<span style="color: #a0522d;">VERSION</span>/elpa/*/* $<span style="color: #a0522d;">CASKPATH</span>/$<span style="color: #a0522d;">SUBDIR</span>
<span style="color: #483d8b;">cd</span> $<span style="color: #a0522d;">CASKPATH</span>/$<span style="color: #a0522d;">SUBDIR</span>

<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"--- Done"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">3.13</span> インデント</h3>
<div class="outline-text-3" id="text-3-13">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default tab-width 2)
(setq-default indent-tabs-mode nil)
(setq indent-line-function 'insert-tab)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(add-hook 'org-mode-hook</span>
<span style="color: #b22222;">;;           </span><span style="color: #b22222;">'(lambda()</span>
<span style="color: #b22222;">;;              </span><span style="color: #b22222;">(setq indent-line-function 'insert-tab)))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">3.14</span> [aggressive-indent] 即時バッファ整形</h3>
<div class="outline-text-3" id="text-3-14">
<p>
特定のメジャーモードで，とにかく整形しまくります．MELPAから入手できます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(aggressive-indent-mode) <span style="color: #8b2252;">"aggressive-indent"</span> nil t nil
       '())
  (add-hook 'emacs-lisp-mode-hook 'aggressive-indent-mode)
  (add-hook 'lisp-mode-hook 'aggressive-indent-mode)
  (add-hook 'perl-mode-hook 'aggressive-indent-mode)
  (add-hook 'c-mode-common-hook 'aggressive-indent-mode)
  (add-hook 'nxml-mode-hook 'aggressive-indent-mode)
  (add-hook 'web-mode-hook 'aggressive-indent-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">3.15</span> ファイルリンクを辿る時に確認のメッセージを出さない</h3>
<div class="outline-text-3" id="text-3-15">
<p>
そのまま辿ってファイルオープンします．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq vc-follow-symlinks t)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">autorevert.el &#12398;&#35501;&#12415;&#36796;&#12415;&#12364;&#24517;&#35201;</span>
(setq auto-revert-check-vc-info t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline45" class="outline-2">
<h2 id="orgheadline45"><span class="section-number-2">4</span> カーソル移動</h2>
<div class="outline-text-2" id="text-4">
<p>
カーソルの移動は，次のポリシーに従っています．デフォルトではC-v/M-v で上下移動になっているが，M-v は windows のペーストに対応するので混乱を招くので使っていません．ページスクロールは標準の <code>cua-base.el</code> に記載されています．<br  />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">行移動</td>
<td class="org-left">C-n/C-p</td>
</tr>

<tr>
<td class="org-left">ページ移動（スクロール）</td>
<td class="org-left">M-n/M-p</td>
</tr>

<tr>
<td class="org-left">ウィンドウ移動</td>
<td class="org-left">C-M-n/C-M-p</td>
</tr>

<tr>
<td class="org-left">バッファ切り替え</td>
<td class="org-left">M-]/M-[</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">4.1</span> バッファ内のカーソル移動</h3>
<div class="outline-text-3" id="text-4-1">
<p>
先頭に移動，最終行に移動，ページ単位の進む，ページ単位の戻る，行数を指定して移動<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #8b2252;">"C-M-t"</span>) 'beginning-of-buffer)
(global-set-key (kbd <span style="color: #8b2252;">"C-M-b"</span>) 'end-of-buffer)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Backward page scrolling instead of M-v</span>
(global-set-key (kbd <span style="color: #8b2252;">"M-p"</span>) 'scroll-down)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Frontward page scrolling instead of C-v</span>
(global-set-key (kbd <span style="color: #8b2252;">"M-n"</span>) 'scroll-up)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Move cursor to a specific line</span>
(global-set-key (kbd <span style="color: #8b2252;">"C-c g"</span>) 'goto-line)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">4.2</span> バッファ間のカーソル移動</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<code>C-c o</code> の代わりに，ウィンドウの移動をワンアクションで行う．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #8b2252;">"C-M-p"</span>) '(<span style="color: #a020f0;">lambda</span> () (interactive) (other-window -1)))
(global-set-key (kbd <span style="color: #8b2252;">"C-M-n"</span>) '(<span style="color: #a020f0;">lambda</span> () (interactive) (other-window 1)))
</pre>
</div>
</div>
</div>
