init.org
** スクロールを制御

一行づつスクロールさせます．デフォルトではバッファの端でスクロールすると，半画面移動します．また，上下の端にカーソルがどのくらい近づいたらスクロールとみなすかも指定できます．

http://marigold.sakura.ne.jp/devel/emacs/scroll/index.html

非ASCII文字を扱っているときに一行づつスクロールしない場合は，scroll-conservatively の値を1ではなく大きい数字にすると直るかもしれません．

http://www.emacswiki.org/emacs/SmoothScrolling

scroll-margin を指定すると，カーソルがウィンドウの端から離れた状態でスクロールされます．

#+BEGIN_SRC emacs-lisp :tangle yes :exports yes
  ;; Scroll window on a line-by-line basis
  (setq scroll-conservatively 1000)
  (setq scroll-step 1)
  (setq scroll-margin 0) ; default=0
#+END_SRC

スクロール時のジャンプが気になる場合は次のパッケージを使うとよいです．

http://adamspiers.org/computing/elisp/smooth-scrolling.el

#+BEGIN_SRC emacs-lisp :tangle no
  (when (require 'smooth-scrolling nil t)
    (setq smooth-scroll-margin 1))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no :exports no
  (when (autoload-if-found
         '(smooth-scrolling) "smooth-scrolling" nil t)
    (eval-after-load "smooth-scrolling"
      '(progn
         (setq smooth-scroll-margin 1))))
#+END_SRC

** スクロールで表示を重複させる行数

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Scroll window on a page-by-pabe basis with N line overlapping
  (setq next-screen-context-lines 1)
#+END_SRC

** [SmoothScroll.el] カーソル固定でスクロールする

https://raw.github.com/takaxp/EmacsScripts/master/SmoothScroll.el
https://github.com/pglotov/EmacsScripts/blob/master/SmoothScroll.el

カーソル位置と行を固定してバッファを背景スクロールできます．

オリジナルのままだとコンパイル時に警告がでるので， =line-move-visual= で書き換えています．残念ながら最近は使っていません．

#+BEGIN_SRC emacs-lisp :tangle no
  (eval-after-autoload-if-found
   '(scroll-one-up scroll-one-down) "smoothscroll")
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no :exports no
  (autoload-if-found
   '(scroll-one-up scroll-one-down) "smoothscroll" nil t)
#+END_SRC

*** キーバインド

#+BEGIN_SRC emacs-lisp :tangle no
  (global-set-key (kbd "s-<up>") 'scroll-one-down)
  (global-set-key (kbd "s-<down>") 'scroll-one-up)
#+END_SRC

** [smooth-scroll.el] 滑らかなスクロール

良い感じです．スススっとスクロールします．

#+BEGIN_SRC emacs-lisp :tangle no
  (eval-after-autoload-if-found
   '(smooth-scroll) "smooth-scroll" nil t nil
      '((smooth-scroll-mode t)
        (setq smooth-scroll/vscroll-step-size 6)
        (setq smooth-scroll/hscroll-step-size 6)))
#+END_SRC

** [point-undo.el] カーソル位置を簡単にたどる

autoload や autoload-if-found で定義すると，使いたい時に履歴が取れていないのでよろしくないです．起動時に有効化します． bm.el で明示的にマーカーを残して履歴をたどる方が気に入っているので，最近は point-undo を使っていません．

#+BEGIN_SRC emacs-lisp :tangle no
  (require 'point-undo nil t)
#+END_SRC

*** キーバインド

 シングルキーを割り当てておくと使いやすいです．

#+BEGIN_SRC emacs-lisp :tangle no
  ;; [point-undo.el] Move the cursor to the previous position
  (global-set-key (kbd "<f7>") 'point-undo)
  ;; [point-undo.el] Redo of point-undo
  (global-set-key (kbd "S-<f7>") 'point-redo)
#+END_SRC

** [cycle-buffer.el] カレントバッファの表示切り替え

http://www.emacswiki.org/emacs/download/cycle-buffer.el

Cycle-buffer を使うと，バッファの履歴をスライドショーのようにたどれます．ミニバッファに前後の履歴が表示されるので，何回キーを押せばいいかの目安になります．それを超える場合には，おとなしくバッファリストを使います．直近数件のバッファをたどるのに便利です．

#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-autoload-if-found
   '(cycle-buffer cycle-buffer-backward) "cycle-buffer" nil t nil
      '((setq cycle-buffer-allow-visible t)
        (setq cycle-buffer-show-length 12)
        (setq cycle-buffer-show-format '(" <(%s)>" . " %s"))))
#+END_SRC

*** キーバインド

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "M-]") 'cycle-buffer)
  (global-set-key (kbd "M-[") 'cycle-buffer-backward)
#+END_SRC

