init.html

<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">4.3</span> スクロールを制御</h3>
<div class="outline-text-3" id="text-4-3">
<p>
一行づつスクロールさせます．デフォルトではバッファの端でスクロールすると，半画面移動します．また，上下の端にカーソルがどのくらい近づいたらスクロールとみなすかも指定できます．<br  />
</p>

<p>
<a href="http://marigold.sakura.ne.jp/devel/emacs/scroll/index.html">http://marigold.sakura.ne.jp/devel/emacs/scroll/index.html</a><br  />
</p>

<p>
非ASCII文字を扱っているときに一行づつスクロールしない場合は，scroll-conservatively の値を1ではなく大きい数字にすると直るかもしれません．<br  />
</p>

<p>
<a href="http://www.emacswiki.org/emacs/SmoothScrolling">http://www.emacswiki.org/emacs/SmoothScrolling</a><br  />
</p>

<p>
scroll-margin を指定すると，カーソルがウィンドウの端から離れた状態でスクロールされます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Scroll window on a line-by-line basis</span>
(setq scroll-conservatively 1000)
(setq scroll-step 1)
(setq scroll-margin 0) <span style="color: #b22222;">; </span><span style="color: #b22222;">default=0</span>
</pre>
</div>

<p>
スクロール時のジャンプが気になる場合は次のパッケージを使うとよいです．<br  />
</p>

<p>
<a href="http://adamspiers.org/computing/elisp/smooth-scrolling.el">http://adamspiers.org/computing/elisp/smooth-scrolling.el</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">smooth-scrolling</span> nil t)
  (setq smooth-scroll-margin 1))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (autoload-if-found
       '(smooth-scrolling) <span style="color: #8b2252;">"smooth-scrolling"</span> nil t)
  (eval-after-load <span style="color: #8b2252;">"smooth-scrolling"</span>
    '(<span style="color: #a020f0;">progn</span>
       (setq smooth-scroll-margin 1))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline35" class="outline-3">
<h3 id="orgheadline35"><span class="section-number-3">4.4</span> スクロールで表示を重複させる行数</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Scroll window on a page-by-pabe basis with N line overlapping</span>
(setq next-screen-context-lines 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline37" class="outline-3">
<h3 id="orgheadline37"><span class="section-number-3">4.5</span> [SmoothScroll.el] カーソル固定でスクロールする</h3>
<div class="outline-text-3" id="text-4-5">
<p>
<a href="https://raw.github.com/takaxp/EmacsScripts/master/SmoothScroll.el">https://raw.github.com/takaxp/EmacsScripts/master/SmoothScroll.el</a><br  />
<a href="https://github.com/pglotov/EmacsScripts/blob/master/SmoothScroll.el">https://github.com/pglotov/EmacsScripts/blob/master/SmoothScroll.el</a><br  />
</p>

<p>
カーソル位置と行を固定してバッファを背景スクロールできます．<br  />
</p>

<p>
オリジナルのままだとコンパイル時に警告がでるので， <code>line-move-visual</code> で書き換えています．残念ながら最近は使っていません．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(scroll-one-up scroll-one-down) <span style="color: #8b2252;">"smoothscroll"</span> nil t)
</pre>
</div>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(autoload-if-found
 '(scroll-one-up scroll-one-down) <span style="color: #8b2252;">"smoothscroll"</span> nil t)
</pre>
</div>
</div>

<div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36"><span class="section-number-4">4.5.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-4-5-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #8b2252;">"s-&lt;up&gt;"</span>) 'scroll-one-down)
(global-set-key (kbd <span style="color: #8b2252;">"s-&lt;down&gt;"</span>) 'scroll-one-up)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline38" class="outline-3">
<h3 id="orgheadline38"><span class="section-number-3">4.6</span> [smooth-scroll.el] 滑らかなスクロール</h3>
<div class="outline-text-3" id="text-4-6">
<p>
良い感じです．スススっとスクロールします．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(smooth-scroll) <span style="color: #8b2252;">"smooth-scroll"</span> nil t nil
 '((smooth-scroll-mode t)
   (setq smooth-scroll/vscroll-step-size 6)
   (setq smooth-scroll/hscroll-step-size 6)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline40" class="outline-3">
<h3 id="orgheadline40"><span class="section-number-3">4.7</span> [point-undo.el] カーソル位置を簡単にたどる</h3>
<div class="outline-text-3" id="text-4-7">
<p>
autoload や autoload-if-found で定義すると，使いたい時に履歴が取れていないのでよろしくないです．起動時に有効化します． bm.el で明示的にマーカーを残して履歴をたどる方が気に入っているので，最近は point-undo を使っていません．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">point-undo</span> nil t)
</pre>
</div>
</div>

<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="section-number-4">4.7.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-4-7-1">
<p>
シングルキーを割り当てておくと使いやすいです．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">[point-undo.el] Move the cursor to the previous position</span>
(global-set-key (kbd <span style="color: #8b2252;">"&lt;f7&gt;"</span>) 'point-undo)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">[point-undo.el] Redo of point-undo</span>
(global-set-key (kbd <span style="color: #8b2252;">"S-&lt;f7&gt;"</span>) 'point-redo)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline42" class="outline-3">
<h3 id="orgheadline42"><span class="section-number-3">4.8</span> [cycle-buffer.el] カレントバッファの表示切り替え</h3>
<div class="outline-text-3" id="text-4-8">
<p>
<a href="http://www.emacswiki.org/emacs/download/cycle-buffer.el">http://www.emacswiki.org/emacs/download/cycle-buffer.el</a><br  />
</p>

<p>
Cycle-buffer を使うと，バッファの履歴をスライドショーのようにたどれます．ミニバッファに前後の履歴が表示されるので，何回キーを押せばいいかの目安になります．それを超える場合には，おとなしくバッファリストを使います．直近数件のバッファをたどるのに便利です．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(cycle-buffer cycle-buffer-backward) <span style="color: #8b2252;">"cycle-buffer"</span> nil t nil
 '((setq cycle-buffer-allow-visible t)
   (setq cycle-buffer-show-length 12)
   (setq cycle-buffer-show-format '(<span style="color: #8b2252;">" &lt;(%s)&gt;"</span> . <span style="color: #8b2252;">" %s"</span>))))
</pre>
</div>
</div>
