init.org
** [bm.el] カーソル位置をブックマークして追う

[[https://github.com/joodland/bm][bm.el]]は，カーソル位置をブックマークしておくためのツールです． =point-undo= と比較して，ユーザが明示的に位置を保存でき，見た目にも使いやすいです．以下の例では， =org-mode= のツリー内にブックマークがある時にも，上手い具合に表示ができるように調整してあります．カーソル移動は，順方向（ =bm-next= ）にだけ使っています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(bm-toggle my:bm-next bm-buffer-save bm-buffer-restore
                     bm-buffer-save-all bm-repository-save
                     bm-repository-load) "bm" nil t nil
                     '((setq-default bm-buffer-persistence t) ;; t
                       (setq bm-repository-file "~/Dropbox/emacs.d/.bookmark")
                       ;; autoload との組み合わせでは無意味
                       ;;（after-init-hook を利用せよ）
                       ;; (setq bm-restore-repository-on-load t)
                       (setq bm-persistent-face 'bm-face)
                       (defun my:bm-toggle ()
                         "bm-toggle with updating history"
                         (interactive)
                         (bm-toggle)
                         (bm-save))

                       (defun my:bm-next ()
                         "bm-next with org-mode"
                         (interactive)
                         (bm-next)
                         (when (and (equal major-mode 'org-mode)
                                    (not (org-before-first-heading-p)))
                           (widen)
                           (org-overview)
                           (org-reveal)
                           (org-cycle-hide-drawers 'all)
                           (org-show-entry)
                           (show-children)
                           (org-show-siblings)))))

    (add-hook 'after-init-hook 'bm-repository-load)
    (add-hook 'find-file-hook 'bm-buffer-restore)
    (add-hook 'after-revert-hook 'bm-buffer-restore)
    (add-hook 'kill-buffer-hook 'bm-buffer-save)
    (add-hook 'after-save-hook 'bm-buffer-save)
    (add-hook 'vc-before-checkin-hook 'bm-buffer-save)
    (add-hook 'kill-emacs-hook 'bm-save)

    (global-set-key (kbd "<f10>") 'my:bm-toggle)
    (global-set-key (kbd "<C-f10>") 'my:bm-next))
#+END_SRC

** [centered-cursor-mode.el] カーソル位置を中央に固定

=isearch-mode= の時だけ有効にしています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(centered-cursor-mode) "centered-cursor-mode")

    (add-hook 'isearch-mode-hook
              '(lambda () (interactive) (centered-cursor-mode 1)))
    (add-hook 'isearch-mode-end-hook
              '(lambda () (interactive) (centered-cursor-mode -1))))
#+END_SRC

* 編集サポート
** 矩形編集／連番入力

Built-in の cua-base.el（CUA-mode）を使う．矩形選択は，領域選択後 =cua-toggle-rectangle-mark= でもできるが， 24.4 からは， =C-x SPC= を押下すると矩形モードに入り直感的に矩形選択ができるようになっています．

#+BEGIN_SRC emacs-lisp :tangle no
  (require 'cua-base)
  (cua-mode 1)
  (setq cua-enable-cua-keys nil)
#+END_SRC

矩形選択した後に， =M-n= を押すと，連番をふれる．開始値，増加値を入力してから，hoge%03d.pgm などとすれば，hoge001，hoge002，，，と入力される．これと，org-mode の表機能（ =C-c |= で選択部分を簡単に表にできる）を組み合わせれば，連番で数値をふったテーブルを容易に作れる．

なお，標準の rect.el に以下の機能が実装されている．

| 矩形切り取り         | C-x r k |
| 矩形削除             | C-x r d |
| 矩形貼り付け         | C-x r y |
| 矩形先頭に文字を挿入 | C-x r t |
| 矩形を空白に変換する | C-x r c |

** Yank時に装飾を取る

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq yank-excluded-properties t)
#+END_SRC

