init.html

<div id="outline-container-orgheadline41" class="outline-4">
<h4 id="orgheadline41"><span class="section-number-4">4.8.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-4-8-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #8b2252;">"M-]"</span>) 'cycle-buffer)
(global-set-key (kbd <span style="color: #8b2252;">"M-["</span>) 'cycle-buffer-backward)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline43" class="outline-3">
<h3 id="orgheadline43"><span class="section-number-3">4.9</span> [bm.el] カーソル位置をブックマークして追う</h3>
<div class="outline-text-3" id="text-4-9">
<p>
<a href="https://github.com/joodland/bm">bm.el</a>は，カーソル位置をブックマークしておくためのツールです． <code>point-undo</code> と比較して，ユーザが明示的に位置を保存でき，見た目にも使いやすいです．以下の例では， <code>org-mode</code> のツリー内にブックマークがある時にも，上手い具合に表示ができるように調整してあります．カーソル移動は，順方向（ <code>bm-next</code> ）にだけ使っています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(bm-toggle my:bm-next bm-buffer-save bm-buffer-restore
                   bm-buffer-save-all bm-repository-save
                   bm-repository-load) <span style="color: #8b2252;">"bm"</span> nil t nil
                   '((setq-default bm-buffer-persistence t) <span style="color: #b22222;">;; </span><span style="color: #b22222;">t</span>
                     (setq bm-repository-file <span style="color: #8b2252;">"~/Dropbox/emacs.d/.bookmark"</span>)
                     <span style="color: #b22222;">;; </span><span style="color: #b22222;">autoload &#12392;&#12398;&#32068;&#12415;&#21512;&#12431;&#12379;&#12391;&#12399;&#28961;&#24847;&#21619;</span>
                     <span style="color: #b22222;">;;</span><span style="color: #b22222;">&#65288;after-init-hook &#12434;&#21033;&#29992;&#12379;&#12424;&#65289;</span>
                     <span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq bm-restore-repository-on-load t)</span>
                     (setq bm-persistent-face 'bm-face)
                     (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:bm-toggle</span> ()
                       <span style="color: #8b2252;">"bm-toggle with updating history"</span>
                       (interactive)
                       (bm-toggle)
                       (bm-save))

                     (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:bm-next</span> ()
                       <span style="color: #8b2252;">"bm-next with org-mode"</span>
                       (interactive)
                       (bm-next)
                       (<span style="color: #a020f0;">when</span> (and (equal major-mode 'org-mode)
                                  (not (org-before-first-heading-p)))
                         (widen)
                         (org-overview)
                         (org-reveal)
                         (org-cycle-hide-drawers 'all)
                         (org-show-entry)
                         (show-children)
                         (org-show-siblings)))))

  (add-hook 'after-init-hook 'bm-repository-load)
  (add-hook 'find-file-hook 'bm-buffer-restore)
  (add-hook 'after-revert-hook 'bm-buffer-restore)
  (add-hook 'kill-buffer-hook 'bm-buffer-save)
  (add-hook 'after-save-hook 'bm-buffer-save)
  (add-hook 'vc-before-checkin-hook 'bm-buffer-save)
  (add-hook 'kill-emacs-hook 'bm-save)

  (global-set-key (kbd <span style="color: #8b2252;">"&lt;f10&gt;"</span>) 'my:bm-toggle)
  (global-set-key (kbd <span style="color: #8b2252;">"&lt;C-f10&gt;"</span>) 'my:bm-next))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline44" class="outline-3">
<h3 id="orgheadline44"><span class="section-number-3">4.10</span> [centered-cursor-mode.el] カーソル位置を中央に固定</h3>
<div class="outline-text-3" id="text-4-10">
<p>
<code>isearch-mode</code> の時だけ有効にしています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(centered-cursor-mode) <span style="color: #8b2252;">"centered-cursor-mode"</span> nil t nil
       '())
  (add-hook 'isearch-mode-hook
            '(<span style="color: #a020f0;">lambda</span> () (interactive) (centered-cursor-mode 1)))
  (add-hook 'isearch-mode-end-hook
            '(<span style="color: #a020f0;">lambda</span> () (interactive) (centered-cursor-mode -1))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline82" class="outline-2">
<h2 id="orgheadline82"><span class="section-number-2">5</span> 編集サポート</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline46" class="outline-3">
<h3 id="orgheadline46"><span class="section-number-3">5.1</span> 矩形編集／連番入力</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Built-in の cua-base.el（CUA-mode）を使う．矩形選択は，領域選択後 <code>cua-toggle-rectangle-mark</code> でもできるが， 24.4 からは， <code>C-x SPC</code> を押下すると矩形モードに入り直感的に矩形選択ができるようになっています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">cua-base</span>)
(cua-mode 1)
(setq cua-enable-cua-keys nil)
</pre>
</div>

<p>
矩形選択した後に， <code>M-n</code> を押すと，連番をふれる．開始値，増加値を入力してから，hoge%03d.pgm などとすれば，hoge001，hoge002，，，と入力される．これと，org-mode の表機能（ <code>C-c |</code> で選択部分を簡単に表にできる）を組み合わせれば，連番で数値をふったテーブルを容易に作れる．<br  />
</p>

<p>
なお，標準の rect.el に以下の機能が実装されている．<br  />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">矩形切り取り</td>
<td class="org-left">C-x r k</td>
</tr>

<tr>
<td class="org-left">矩形削除</td>
<td class="org-left">C-x r d</td>
</tr>

<tr>
<td class="org-left">矩形貼り付け</td>
<td class="org-left">C-x r y</td>
</tr>

<tr>
<td class="org-left">矩形先頭に文字を挿入</td>
<td class="org-left">C-x r t</td>
</tr>

<tr>
<td class="org-left">矩形を空白に変換する</td>
<td class="org-left">C-x r c</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline47" class="outline-3">
<h3 id="orgheadline47"><span class="section-number-3">5.2</span> Yank時に装飾を取る</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq yank-excluded-properties t)
</pre>
</div>
</div>
</div>
