init.el
       '(bm-toggle my:bm-next bm-buffer-save bm-buffer-restore
                   bm-buffer-save-all bm-repository-save
                   bm-repository-load) "bm" nil t nil
                   '((setq-default bm-buffer-persistence t) ;; t
                     (setq bm-repository-file "~/Dropbox/emacs.d/.bookmark")
                     ;; autoload との組み合わせでは無意味
                     ;;（after-init-hook を利用せよ）
                     ;; (setq bm-restore-repository-on-load t)
                     (setq bm-persistent-face 'bm-face)
                     (defun my:bm-toggle ()
                       "bm-toggle with updating history"
                       (interactive)
                       (bm-toggle)
                       (bm-save))

                     (defun my:bm-next ()
                       "bm-next with org-mode"
                       (interactive)
                       (bm-next)
                       (when (and (equal major-mode 'org-mode)
                                  (not (org-before-first-heading-p)))
                         (widen)
                         (org-overview)
                         (org-reveal)
                         (org-cycle-hide-drawers 'all)
                         (org-show-entry)
                         (show-children)
                         (org-show-siblings)))))

  (add-hook 'after-init-hook 'bm-repository-load)
  (add-hook 'find-file-hook 'bm-buffer-restore)
  (add-hook 'after-revert-hook 'bm-buffer-restore)
  (add-hook 'kill-buffer-hook 'bm-buffer-save)
  (add-hook 'after-save-hook 'bm-buffer-save)
  (add-hook 'vc-before-checkin-hook 'bm-buffer-save)
  (add-hook 'kill-emacs-hook 'bm-save)

  (global-set-key (kbd "<f10>") 'my:bm-toggle)
  (global-set-key (kbd "<C-f10>") 'my:bm-next))

(when (eval-after-autoload-if-found
       '(centered-cursor-mode) "centered-cursor-mode")

  (add-hook 'isearch-mode-hook
            '(lambda () (interactive) (centered-cursor-mode 1)))
  (add-hook 'isearch-mode-end-hook
            '(lambda () (interactive) (centered-cursor-mode -1))))

(setq yank-excluded-properties t)
