init.org
** ファイル保存時に時間を記録する

Built-in の time-stamp.el を使う．

バッファの保存時にタイムスタンプを記録する．以下の設定では，バッファの先頭から10行以内に，"Last Update: " があると，"Last Update: 2011-12-31@12:00"のようにタイムスタンプが記録される．

#+BEGIN_SRC emacs-lisp :tangle yes :exports no
  ;; org-tre-slide が有効ならタイムスタンプを更新しない
  ;; （Undo範囲が限定されてしまうため）

  ;; #+UPDATE 用
  (when (eval-after-autoload-if-found
         '(update-stamp) "update-stamp" nil t nil
         '((setq update-stamp-start "UPDATE:[ \t]*")
           (setq update-stamp-format "%02H:%02M:%02S")
           (setq update-stamp-end "$")
           (setq update-stamp-line-limit 10))) ; def=8

    (add-hook 'before-save-hook
              '(lambda ()
                 (if (boundp 'org-tree-slide-mode)
                     (unless org-tree-slide-mode) (update-stamp))
                 (update-stamp))))

  ;; #+DATE 用
  (when (eval-after-autoload-if-found
         '(time-stamp) "time-stamp" nil t nil
         '((setq time-stamp-start "DATE:[ \t]*")
           (setq time-stamp-format "%04y-%02m-%02d")
           (setq time-stamp-end "$")
           (setq time-stamp-line-limit 10) ; def=8
           ))

    (add-hook 'before-save-hook
              '(lambda ()
                 (if (boundp 'org-tree-slide-mode)
                     (unless org-tree-slide-mode) (time-stamp))
                 (time-stamp))))  
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no :exports yes
  (add-hook 'before-save-hook 'time-stamp)
  (with-eval-after-load "time-stamp"
    (setq time-stamp-start "Last Update: ")
    (setq time-stamp-format "%04y-%02m-%02d@%02H:%02M")
    (setq time-stamp-end "$")
    (setq time-stamp-line-limit 10)) ; def=8  
#+END_SRC

** 選択リージョンを使って検索

検索語をミニバッファに入力するのが面倒なので，リージョンをそのまま検索語として利用します．

http://dev.ariel-networks.com/articles/emacs/part5/

#+BEGIN_SRC emacs-lisp :tangle yes
  (defadvice isearch-mode
      (around isearch-mode-default-string
              (forward &optional regexp op-fun recursive-edit word-p) activate)
    (if (and transient-mark-mode mark-active (not (eq (mark) (point))))
        (progn
          (isearch-update-ring (buffer-substring-no-properties (mark) (point)))
          (deactivate-mark)
          ad-do-it
          (if (not forward)
              (isearch-repeat-backward)
            (goto-char (mark))
            (isearch-repeat-forward)))
      ad-do-it))
#+END_SRC

** ChangeLog モード

#+BEGIN_SRC emacs-lisp :tangle no
  (setq user-full-name "Your NAME")
  (setq user-mail-address "your@address.com")
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'change-log-mode-hook
            '(lambda()
               (setq tab-width 4)
               (setq left-margin 4)))
#+END_SRC

** テキストモード

http://d.hatena.ne.jp/NeoCat/20080211

とは言っても，Org-modeを知ってから =.txt= もテキストモードで開かなくなったので，ほぼ無意味な設定となりました．しかも， =nxml-mode= で =TAB= が効かなくなる現象が起きているので，以下の設定はしない方がよさげ．

#+BEGIN_SRC emacs-lisp :tangle no
  (add-hook 'text-mode-hook
            '(lambda()
               (setq tab-width 4)
               (setq indent-line-function 'tab-to-tab-stop)             
               (setq tab-stop-list
                     '(4 8 12 16 20 24 28 32 36 40 44 48 52 56 60
                         64 68 72 76 80))))
#+END_SRC

** C/C++モード

#+BEGIN_SRC emacs-lisp :tangle yes
  (push '("\\.h$" . c++-mode) auto-mode-alist)
#+END_SRC

** C#モード

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(csharp-mode) "csharp-mode" "Major mode for editing C# mode.")

    (push '("\\.cs$" . csharp-mode) auto-mode-alist))
#+END_SRC

** Infoモード

Org-mode の日本語翻訳済みinfoを読むための設定．[[https://github.com/org-mode-doc-ja/org-ja][翻訳プロジェクト]]で頒布しています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-autoload-if-found
   '(info org-info-ja) "info" nil t nil
   '((add-to-list 'Info-additional-directory-list
                  (expand-file-name "~/devel/mygit/org-ja/work/"))
     (defun org-info-ja (&optional node)
       "(Japanese) Read documentation for Org-mode in the info system.
      With optional NODE, go directly to that node."
       (interactive)
       (info (format "(org-ja)%s" (or node ""))))))
#+END_SRC

** Rモード

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(R-mode R) "ess-site" "Emacs Speaks Statistics mode")
    (push '("\\.[rR]$" . R-mode) auto-mode-alist))
#+END_SRC

