init.html

<div id="outline-container-orgheadline48" class="outline-3">
<h3 id="orgheadline48"><span class="section-number-3">5.3</span> ファイル保存時に時間を記録する</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Built-in の time-stamp.el を使う．<br  />
</p>

<p>
バッファの保存時にタイムスタンプを記録する．以下の設定では，バッファの先頭から10行以内に，"Last Update: " があると，"Last Update: 2011-12-31@12:00"のようにタイムスタンプが記録される．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">org-tre-slide &#12364;&#26377;&#21177;&#12394;&#12425;&#12479;&#12452;&#12512;&#12473;&#12479;&#12531;&#12503;&#12434;&#26356;&#26032;&#12375;&#12394;&#12356;</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#65288;Undo&#31684;&#22258;&#12364;&#38480;&#23450;&#12373;&#12428;&#12390;&#12375;&#12414;&#12358;&#12383;&#12417;&#65289;</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">#+UPDATE &#29992;</span>
(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(update-stamp) <span style="color: #8b2252;">"update-stamp"</span> nil t nil
       '((setq update-stamp-start <span style="color: #8b2252;">"UPDATE:[ \t]*"</span>)
         (setq update-stamp-format <span style="color: #8b2252;">"%02H:%02M:%02S"</span>)
         (setq update-stamp-end <span style="color: #8b2252;">"$"</span>)
         (setq update-stamp-line-limit 10))) <span style="color: #b22222;">; </span><span style="color: #b22222;">def=8</span>

  (add-hook 'before-save-hook
            '(<span style="color: #a020f0;">lambda</span> ()
               (<span style="color: #a020f0;">if</span> (boundp 'org-tree-slide-mode)
                   (<span style="color: #a020f0;">unless</span> org-tree-slide-mode) (update-stamp))
               (update-stamp))))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">#+DATE &#29992;</span>
(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(time-stamp) <span style="color: #8b2252;">"time-stamp"</span> nil t nil
       '((setq time-stamp-start <span style="color: #8b2252;">"DATE:[ \t]*"</span>)
         (setq time-stamp-format <span style="color: #8b2252;">"%04y-%02m-%02d"</span>)
         (setq time-stamp-end <span style="color: #8b2252;">"$"</span>)
         (setq time-stamp-line-limit 10) <span style="color: #b22222;">; </span><span style="color: #b22222;">def=8</span>
         ))

  (add-hook 'before-save-hook
            '(<span style="color: #a020f0;">lambda</span> ()
               (<span style="color: #a020f0;">if</span> (boundp 'org-tree-slide-mode)
                   (<span style="color: #a020f0;">unless</span> org-tree-slide-mode) (time-stamp))
               (time-stamp))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'before-save-hook 'time-stamp)
(eval-after-load <span style="color: #8b2252;">"time-stamp"</span>
  '(<span style="color: #a020f0;">progn</span>
     (setq time-stamp-start <span style="color: #8b2252;">"Last Update: "</span>)
     (setq time-stamp-format <span style="color: #8b2252;">"%04y-%02m-%02d@%02H:%02M"</span>)
     (setq time-stamp-end <span style="color: #8b2252;">"$"</span>)
     (setq time-stamp-line-limit 10))) <span style="color: #b22222;">; </span><span style="color: #b22222;">def=8</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline49" class="outline-3">
<h3 id="orgheadline49"><span class="section-number-3">5.4</span> 選択リージョンを使って検索</h3>
<div class="outline-text-3" id="text-5-4">
<p>
検索語をミニバッファに入力するのが面倒なので，リージョンをそのまま検索語として利用します．<br  />
</p>

<p>
<a href="http://dev.ariel-networks.com/articles/emacs/part5/">http://dev.ariel-networks.com/articles/emacs/part5/</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defadvice</span> <span style="color: #0000ff;">isearch-mode</span>
    (around isearch-mode-default-string
            (forward <span style="color: #228b22;">&amp;optional</span> regexp op-fun recursive-edit word-p) activate)
  (<span style="color: #a020f0;">if</span> (and transient-mark-mode mark-active (not (eq (mark) (point))))
      (<span style="color: #a020f0;">progn</span>
        (isearch-update-ring (buffer-substring-no-properties (mark) (point)))
        (deactivate-mark)
        ad-do-it
        (<span style="color: #a020f0;">if</span> (not forward)
            (isearch-repeat-backward)
          (goto-char (mark))
          (isearch-repeat-forward)))
    ad-do-it))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline50" class="outline-3">
<h3 id="orgheadline50"><span class="section-number-3">5.5</span> ChangeLog モード</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq user-full-name <span style="color: #8b2252;">"Your NAME"</span>)
(setq user-mail-address <span style="color: #8b2252;">"your@address.com"</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'change-log-mode-hook
          '(<span style="color: #a020f0;">lambda</span>()
             (setq tab-width 4)
             (setq left-margin 4)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline51" class="outline-3">
<h3 id="orgheadline51"><span class="section-number-3">5.6</span> テキストモード</h3>
<div class="outline-text-3" id="text-5-6">
<p>
<a href="http://d.hatena.ne.jp/NeoCat/20080211">http://d.hatena.ne.jp/NeoCat/20080211</a><br  />
</p>

<p>
とは言っても，Org-modeを知ってから <code>.txt</code> もテキストモードで開かなくなったので，ほぼ無意味な設定となりました．しかも， <code>nxml-mode</code> で <code>TAB</code> が効かなくなる現象が起きているので，以下の設定はしない方がよさげ．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'text-mode-hook
          '(<span style="color: #a020f0;">lambda</span>()
             (setq tab-width 4)
             (setq indent-line-function 'tab-to-tab-stop)             
             (setq tab-stop-list
                   '(4 8 12 16 20 24 28 32 36 40 44 48 52 56 60
                       64 68 72 76 80))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline52" class="outline-3">
<h3 id="orgheadline52"><span class="section-number-3">5.7</span> C/C++モード</h3>
<div class="outline-text-3" id="text-5-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(push '(<span style="color: #8b2252;">"\\.h$"</span> . c++-mode) auto-mode-alist)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline53" class="outline-3">
<h3 id="orgheadline53"><span class="section-number-3">5.8</span> C#モード</h3>
<div class="outline-text-3" id="text-5-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(csharp-mode) <span style="color: #8b2252;">"csharp-mode"</span> <span style="color: #8b2252;">"Major mode for editing C# mode."</span> t nil
       '())
  (push '(<span style="color: #8b2252;">"\\.cs$"</span> . csharp-mode) auto-mode-alist))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline54" class="outline-3">
<h3 id="orgheadline54"><span class="section-number-3">5.9</span> Infoモード</h3>
<div class="outline-text-3" id="text-5-9">
<p>
Org-mode の日本語翻訳済みinfoを読むための設定．<a href="https://github.com/org-mode-doc-ja/org-ja">翻訳プロジェクト</a>で頒布しています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(info org-info-ja) <span style="color: #8b2252;">"info"</span> nil t nil
 '((add-to-list 'Info-additional-directory-list
                (expand-file-name <span style="color: #8b2252;">"~/devel/mygit/org-ja/work/"</span>))
   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">org-info-ja</span> (<span style="color: #228b22;">&amp;optional</span> node)
     <span style="color: #8b2252;">"(Japanese) Read documentation for Org-mode in the info system.</span>
<span style="color: #8b2252;">    With optional NODE, go directly to that node."</span>
     (interactive)
     (info (format <span style="color: #8b2252;">"(org-ja)%s"</span> (or node <span style="color: #8b2252;">""</span>))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline55" class="outline-3">
<h3 id="orgheadline55"><span class="section-number-3">5.10</span> Rモード</h3>
<div class="outline-text-3" id="text-5-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(R-mode R) <span style="color: #8b2252;">"ess-site"</span> <span style="color: #8b2252;">"Emacs Speaks Statistics mode"</span> t nil
       '())
  (push '(<span style="color: #8b2252;">"\\.[rR]$"</span> . R-mode) auto-mode-alist))
</pre>
</div>
</div>
</div>
