init.el

;; org-tre-slide が有効ならタイムスタンプを更新しない
;; （Undo範囲が限定されてしまうため）

;; #+UPDATE 用
(when (eval-after-autoload-if-found
       '(update-stamp) "update-stamp" nil t nil
       '((setq update-stamp-start "UPDATE:[ \t]*")
         (setq update-stamp-format "%02H:%02M:%02S")
         (setq update-stamp-end "$")
         (setq update-stamp-line-limit 10))) ; def=8

  (add-hook 'before-save-hook
            '(lambda ()
               (if (boundp 'org-tree-slide-mode)
                   (unless org-tree-slide-mode) (update-stamp))
               (update-stamp))))

;; #+DATE 用
(when (eval-after-autoload-if-found
       '(time-stamp) "time-stamp" nil t nil
       '((setq time-stamp-start "DATE:[ \t]*")
         (setq time-stamp-format "%04y-%02m-%02d")
         (setq time-stamp-end "$")
         (setq time-stamp-line-limit 10) ; def=8
         ))

  (add-hook 'before-save-hook
            '(lambda ()
               (if (boundp 'org-tree-slide-mode)
                   (unless org-tree-slide-mode) (time-stamp))
               (time-stamp))))

(defadvice isearch-mode
    (around isearch-mode-default-string
            (forward &optional regexp op-fun recursive-edit word-p) activate)
  (if (and transient-mark-mode mark-active (not (eq (mark) (point))))
      (progn
        (isearch-update-ring (buffer-substring-no-properties (mark) (point)))
        (deactivate-mark)
        ad-do-it
        (if (not forward)
            (isearch-repeat-backward)
          (goto-char (mark))
          (isearch-repeat-forward)))
    ad-do-it))

(add-hook 'change-log-mode-hook
          '(lambda()
             (setq tab-width 4)
             (setq left-margin 4)))

(push '("\\.h$" . c++-mode) auto-mode-alist)

(when (eval-after-autoload-if-found
       '(csharp-mode) "csharp-mode" "Major mode for editing C# mode.")

  (push '("\\.cs$" . csharp-mode) auto-mode-alist))

(eval-after-autoload-if-found
 '(info org-info-ja) "info" nil t nil
 '((add-to-list 'Info-additional-directory-list
                (expand-file-name "~/devel/mygit/org-ja/work/"))
   (defun org-info-ja (&optional node)
     "(Japanese) Read documentation for Org-mode in the info system.
    With optional NODE, go directly to that node."
     (interactive)
     (info (format "(org-ja)%s" (or node ""))))))

(when (eval-after-autoload-if-found
       '(R-mode R) "ess-site" "Emacs Speaks Statistics mode")
  (push '("\\.[rR]$" . R-mode) auto-mode-alist))

(add-hook 'nxml-mode-hook
          '(lambda ()
