init.org
** nXMLモード

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'nxml-mode-hook
            '(lambda ()
               (define-key nxml-mode-map "\r" 'newline-and-indent)
               (setq auto-fill-mode -1)
               (setq nxml-slash-auto-complete-flag t)
               (setq tab-width 1)
               (setq nxml-child-indent 1)
               (setq indent-tabs-mode t)
               (setq nxml-attribute-indent 0)))
#+END_SRC

** yamlモード

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(yaml-mode) "yaml-mode")
    (push '("\\.yml$" . yaml-mode) auto-mode-alist))
#+END_SRC

** jsonモード

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(json-mode) "json-mode")
    (push '("\\.json$" . json-mode) auto-mode-alist))
#+END_SRC

** javascriptモード

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found '(js2-mode) "js2-mode")
    (push '("\\.js$" . js2-mode) auto-mode-alist))

  (when (eval-after-autoload-if-found '(ac-js2-mode) "ac-js2")
    (add-hook 'js2-mode-hook 'ac-js2-mode))

  (if (executable-find "tern")
      (when (eval-after-autoload-if-found
             '(tern-mode) "tern" nil t nil
             '((tern-mode 1)
               (when (require 'tern-auto-complete nil t)
                 (tern-ac-setup))))
        (add-hook 'js2-mode-hook 'tern-mode))

    (message "--- tern is NOT installed in this system."))


#+END_SRC

** csvモード

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(csv-mode) "csv-mode")
    (push '("\\.csv$" . csv-mode) auto-mode-alist))
#+END_SRC

** asciiモード

カーソル下の文字のアスキーコードを別ウィンドウでリアルタイムに確認できます．

#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-autoload-if-found '(ascii-on ascii-off) "ascii")
#+END_SRC

** スペルチェック

Built-in の ispell を使う．チェックエンジンは，aspell を利用する．

| 'ns  | sudo port install aspell aspell-dict-en                   |
| 'x32 | installer.exe and aspell-en from http://aspell.net/win32/ |

#+BEGIN_SRC emacs-lisp :tangle yes
  ;;; Use aspell for spell checking instead of ispell.
  (when (executable-find "aspell")
    (eval-after-autoload-if-found
     '(ispell-region) "ispell" nil t nil
     '((setq-default ispell-program-name "aspell")
       (when (eq window-system 'w32)
         (setq-default ispell-program-name
                       "C:/Program Files/Aspell/bin/aspell.exe"))
       ;;(setq ispell-grep-command "grep")
       ;; for English and Japanese mixed

       (add-to-list 'ispell-skip-region-alist '("[^\000-\377]"))
       (setq ispell-dictionarry "english")
       (setq ispell-personal-dictionary "~/.emacs.d/.aspell.en.pws")

       ;; This will also avoid an IM-OFF issue for flyspell-mode.
       ;;  (setq ispell-aspell-supports-utf8 t)
       ;;  (setq ispell-encoding8-command t)
       (setq ispell-local-dictionary-alist
             '((nil "[a-zA-Z]" "[^a-zA-Z]" "'" t
                    ("-d" "en" "--encoding=utf-8") nil utf-8))))))
#+END_SRC 

*** キーバインド

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Spell checking within a specified region
  (global-set-key (kbd "C-c f 5") 'ispell-region)
#+END_SRC

** リアルタイムスペルチェック

Built-in の [[http://www.emacswiki.org/emacs/FlySpell][flyspell.el]] を使います．

重いので現在は使っていません．

http://www.morishima.net/~naoto/fragments/archives/2005/12/20/flyspell/

#+BEGIN_SRC emacs-lisp :tangle no
  (dolist
      (hook
       '(text-mode-hook change-log-mode-hook c++-mode-hook
                        latex-mode-hook org-mode-hook))
    (add-hook hook (lambda () (flyspell-mode 1))))

  (add-hook 'c++-mode-hook
            (lambda () (flyspell-prog-mode)))

  ;; Auto complete との衝突を回避
  (ac-flyspell-workaround)
#+END_SRC

** [latex-math-preview.el] TeX数式をプレビュー

  - http://www.emacswiki.org/emacs/latex-math-preview.el
  - http://transitive.info/software/latex-math-preview/

以下の設定では， 数式で =<f7>= を押すとプレビューが走り，さらに =<f7>= を押すとプレビューウィンドウを閉じるように動作します．通常，=q= でプレビューを閉じられます．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found       
         '(latex-math-preview-expression
           latex-math-preview-insert-symbol
           latex-math-preview-save-image-file
           latex-math-preview-beamer-frame)
         "latex-math-preview" nil t nil
         '((define-key latex-math-preview-expression-mode-map (kbd "<f7>")
             'latex-math-preview-delete-buffer)))

    (global-set-key (kbd "<f7>") 'latex-math-preview-expression))
#+END_SRC

