init.html

<div id="outline-container-orgheadline56" class="outline-3">
<h3 id="orgheadline56"><span class="section-number-3">5.11</span> nXMLモード</h3>
<div class="outline-text-3" id="text-5-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'nxml-mode-hook
          '(<span style="color: #a020f0;">lambda</span> ()
             (define-key nxml-mode-map <span style="color: #8b2252;">"\r"</span> 'newline-and-indent)
             (setq auto-fill-mode -1)
             (setq nxml-slash-auto-complete-flag t)
             (setq tab-width 1)
             (setq nxml-child-indent 1)
             (setq indent-tabs-mode t)
             (setq nxml-attribute-indent 0)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline57" class="outline-3">
<h3 id="orgheadline57"><span class="section-number-3">5.12</span> yamlモード</h3>
<div class="outline-text-3" id="text-5-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(yaml-mode) <span style="color: #8b2252;">"yaml-mode"</span> nil t nil
       '())
  (push '(<span style="color: #8b2252;">"\\.yml$"</span> . yaml-mode) auto-mode-alist))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline58" class="outline-3">
<h3 id="orgheadline58"><span class="section-number-3">5.13</span> jsonモード</h3>
<div class="outline-text-3" id="text-5-13">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(json-mode) <span style="color: #8b2252;">"json-mode"</span> nil t nil
       '())
  (push '(<span style="color: #8b2252;">"\\.json$"</span> . json-mode) auto-mode-alist))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline59" class="outline-3">
<h3 id="orgheadline59"><span class="section-number-3">5.14</span> javascriptモード</h3>
<div class="outline-text-3" id="text-5-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(js2-mode) <span style="color: #8b2252;">"js2-mode"</span> nil t nil
       '())
  (push '(<span style="color: #8b2252;">"\\.js$"</span> . js2-mode) auto-mode-alist))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline60" class="outline-3">
<h3 id="orgheadline60"><span class="section-number-3">5.15</span> csvモード</h3>
<div class="outline-text-3" id="text-5-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(csv-mode) <span style="color: #8b2252;">"csv-mode"</span> nil t nil
       '())
  (push '(<span style="color: #8b2252;">"\\.csv$"</span> . csv-mode) auto-mode-alist))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline62" class="outline-3">
<h3 id="orgheadline62"><span class="section-number-3">5.16</span> スペルチェック</h3>
<div class="outline-text-3" id="text-5-16">
<p>
Built-in の ispell を使う．チェックエンジンは，aspell を利用する．<br  />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">'ns</td>
<td class="org-left">sudo port install aspell aspell-dict-en</td>
</tr>

<tr>
<td class="org-left">'x32</td>
<td class="org-left">installer.exe and aspell-en from <a href="http://aspell.net/win32/">http://aspell.net/win32/</a></td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;;; </span><span style="color: #b22222;">Use aspell for spell checking instead of ispell.</span>
(<span style="color: #a020f0;">when</span> (executable-find <span style="color: #8b2252;">"aspell"</span>)
  (eval-after-autoload-if-found
   '(ispell-region) <span style="color: #8b2252;">"ispell"</span> nil t nil
   '((setq-default ispell-program-name <span style="color: #8b2252;">"aspell"</span>)
     (<span style="color: #a020f0;">when</span> (eq window-system 'w32)
       (setq-default ispell-program-name
                     <span style="color: #8b2252;">"C:/Program Files/Aspell/bin/aspell.exe"</span>))
     <span style="color: #b22222;">;;</span><span style="color: #b22222;">(setq ispell-grep-command "grep")</span>
     <span style="color: #b22222;">;; </span><span style="color: #b22222;">for English and Japanese mixed</span>

     (add-to-list 'ispell-skip-region-alist '(<span style="color: #8b2252;">"[</span><span style="color: #8b2252;">^</span><span style="color: #8b2252;">\000-\377]"</span>))
     (setq ispell-dictionarry <span style="color: #8b2252;">"english"</span>)
     (setq ispell-personal-dictionary <span style="color: #8b2252;">"~/.emacs.d/.aspell.en.pws"</span>)

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">This will also avoid an IM-OFF issue for flyspell-mode.</span>
     <span style="color: #b22222;">;;  </span><span style="color: #b22222;">(setq ispell-aspell-supports-utf8 t)</span>
     <span style="color: #b22222;">;;  </span><span style="color: #b22222;">(setq ispell-encoding8-command t)</span>
     (setq ispell-local-dictionary-alist
           '((nil <span style="color: #8b2252;">"[a-zA-Z]"</span> <span style="color: #8b2252;">"[</span><span style="color: #8b2252;">^</span><span style="color: #8b2252;">a-zA-Z]"</span> <span style="color: #8b2252;">"'"</span> t
                  (<span style="color: #8b2252;">"-d"</span> <span style="color: #8b2252;">"en"</span> <span style="color: #8b2252;">"--encoding=utf-8"</span>) nil utf-8))))))
</pre>
</div>
</div>

<div id="outline-container-orgheadline61" class="outline-4">
<h4 id="orgheadline61"><span class="section-number-4">5.16.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-5-16-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Spell checking within a specified region</span>
(global-set-key (kbd <span style="color: #8b2252;">"C-c 0"</span>) 'ispell-region)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline63" class="outline-3">
<h3 id="orgheadline63"><span class="section-number-3">5.17</span> リアルタイムスペルチェック</h3>
<div class="outline-text-3" id="text-5-17">
<p>
Built-in の <a href="http://www.emacswiki.org/emacs/FlySpell">flyspell.el</a> を使います．<br  />
</p>

<p>
重いので現在は使っていません．<br  />
</p>

<p>
<a href="http://www.morishima.net/~naoto/fragments/archives/2005/12/20/flyspell/">http://www.morishima.net/~naoto/fragments/archives/2005/12/20/flyspell/</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">dolist</span>
    (hook
     '(text-mode-hook change-log-mode-hook c++-mode-hook
                      latex-mode-hook org-mode-hook))
  (add-hook hook (<span style="color: #a020f0;">lambda</span> () (flyspell-mode 1))))

(add-hook 'c++-mode-hook
          (<span style="color: #a020f0;">lambda</span> () (flyspell-prog-mode)))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Auto complete &#12392;&#12398;&#34909;&#31361;&#12434;&#22238;&#36991;</span>
(ac-flyspell-workaround)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline64" class="outline-3">
<h3 id="orgheadline64"><span class="section-number-3">5.18</span> [latex-math-preview.el] TeX数式をプレビュー</h3>
<div class="outline-text-3" id="text-5-18">
<ul class="org-ul">
<li><a href="http://www.emacswiki.org/emacs/latex-math-preview.el">http://www.emacswiki.org/emacs/latex-math-preview.el</a><br  /></li>
<li><a href="http://transitive.info/software/latex-math-preview/">http://transitive.info/software/latex-math-preview/</a><br  /></li>
</ul>

<p>
以下の設定では， 数式で <code>&lt;f7&gt;</code> を押すとプレビューが走り，さらに <code>&lt;f7&gt;</code> を押すとプレビューウィンドウを閉じるように動作します．通常，=q= でプレビューを閉じられます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found       
       '(latex-math-preview-expression
         latex-math-preview-insert-symbol
         latex-math-preview-save-image-file
         latex-math-preview-beamer-frame)
       <span style="color: #8b2252;">"latex-math-preview"</span> nil t nil
       '((define-key latex-math-preview-expression-mode-map (kbd <span style="color: #8b2252;">"&lt;f7&gt;"</span>)
           'latex-math-preview-delete-buffer)))
  (global-set-key (kbd <span style="color: #8b2252;">"&lt;f7&gt;"</span>) 'latex-math-preview-expression))
</pre>
</div>
</div>
</div>
