init.el
             (define-key nxml-mode-map "\r" 'newline-and-indent)
             (setq auto-fill-mode -1)
             (setq nxml-slash-auto-complete-flag t)
             (setq tab-width 1)
             (setq nxml-child-indent 1)
             (setq indent-tabs-mode t)
             (setq nxml-attribute-indent 0)))

(when (eval-after-autoload-if-found
       '(yaml-mode) "yaml-mode")
  (push '("\\.yml$" . yaml-mode) auto-mode-alist))

(when (eval-after-autoload-if-found
       '(json-mode) "json-mode")
  (push '("\\.json$" . json-mode) auto-mode-alist))

(when (eval-after-autoload-if-found '(js2-mode) "js2-mode")
  (push '("\\.js$" . js2-mode) auto-mode-alist))

(when (eval-after-autoload-if-found '(ac-js2-mode) "ac-js2")
  (add-hook 'js2-mode-hook 'ac-js2-mode))

(if (executable-find "tern")
    (when (eval-after-autoload-if-found
           '(tern-mode) "tern" nil t nil
           '((tern-mode 1)
             (when (require 'tern-auto-complete nil t)
               (tern-ac-setup))))
      (add-hook 'js2-mode-hook 'tern-mode))

  (message "--- tern is NOT installed in this system."))

(when (eval-after-autoload-if-found
       '(csv-mode) "csv-mode")
  (push '("\\.csv$" . csv-mode) auto-mode-alist))

(eval-after-autoload-if-found '(ascii-on ascii-off) "ascii")

;;; Use aspell for spell checking instead of ispell.
(when (executable-find "aspell")
  (eval-after-autoload-if-found
   '(ispell-region) "ispell" nil t nil
   '((setq-default ispell-program-name "aspell")
     (when (eq window-system 'w32)
       (setq-default ispell-program-name
                     "C:/Program Files/Aspell/bin/aspell.exe"))
     ;;(setq ispell-grep-command "grep")
     ;; for English and Japanese mixed

     (add-to-list 'ispell-skip-region-alist '("[^\000-\377]"))
     (setq ispell-dictionarry "english")
     (setq ispell-personal-dictionary "~/.emacs.d/.aspell.en.pws")

     ;; This will also avoid an IM-OFF issue for flyspell-mode.
     ;;  (setq ispell-aspell-supports-utf8 t)
     ;;  (setq ispell-encoding8-command t)
     (setq ispell-local-dictionary-alist
           '((nil "[a-zA-Z]" "[^a-zA-Z]" "'" t
                  ("-d" "en" "--encoding=utf-8") nil utf-8))))))

;; Spell checking within a specified region
(global-set-key (kbd "C-c f 5") 'ispell-region)

(when (eval-after-autoload-if-found       
       '(latex-math-preview-expression
         latex-math-preview-insert-symbol
         latex-math-preview-save-image-file
         latex-math-preview-beamer-frame)
       "latex-math-preview" nil t nil
       '((define-key latex-math-preview-expression-mode-map (kbd "<f7>")
           'latex-math-preview-delete-buffer)))

  (global-set-key (kbd "<f7>") 'latex-math-preview-expression))
