init.org
** [po-mode.el] 翻訳ファイルの編集

http://www.emacswiki.org/emacs/PoMode
http://www.emacswiki.org/emacs/po-mode+.el

#+BEGIN_SRC emacs-lisp :tangle yes
  ;;(autoload 'po-mode "po-mode+" nil nil)
  ;;(autoload 'po-mode "po-mode" nil t)
  (when (eval-after-autoload-if-found
         '(po-mode) "po-mode")
    (push '("\\.po[tx]?\\'\\|\\.po\\$" . po-mode) auto-mode-alist))
#+END_SRC

** [word-count.el] リージョン内の文字をカウントする

有効な頒布元に変更があった．[[http://www.emacswiki.org/emacs/WordCount][word-count.el]] から新しい頒布元にたどりつける．

#+BEGIN_SRC emacs-lisp :tangle no
  (when (eval-after-autoload-if-found
         '(word-count-mode) "word-count" "Minor mode to count words.")
    (global-set-key (kbd "M-+") 'word-count-mode))
#+END_SRC

と思ったら，ビルドインの simple.el に十分な機能なのがあった．

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "M-=") 'count-words)
#+END_SRC

** [yatex.el] YaTeXモード

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(yatex-mode) "yatex" "Yet Another LaTeX mode" t nil
         '((setq YaTeX-kanji-code 4))) ;; 1=Shift JIS, 2=JIS, 3=EUC, 4=UTF-8
    (push '("\\.tex$" . yatex-mode) auto-mode-alist)
    ;; Disable auto line break
    (add-hook 'yatex-mode-hook
              '(lambda () (setq auto-fill-function nil))))
#+END_SRC

** [wclock.el] 世界時計

http://pastelwill.jp/wiki/doku.php?id=emacs
#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-autoload-if-found 'wclock "wclock")
#+END_SRC

** [yasnippet.el] Emacs用のテンプレートシステム

[[https://github.com/capitaomorte/yasnippet]]

  - http://yasnippet-doc-jp.googlecode.com/svn/trunk/doc-jp/index.html
  - http://d.hatena.ne.jp/IMAKADO/20080401/1206715770
  - http://coderepos.org/share/browser/config/yasnippet
  - https://github.com/RickMoynihan/yasnippet-org-mode

[[http://orgmode.org/manual/Conflicts.html][Org-modeとの衝突を避ける]]

#+BEGIN_SRC emacs-lisp :tangle yes :exports no
  (when (eval-after-autoload-if-found
         '(yas-global-mode yas-minor-mode)
         "yasnippet" nil t nil
         '((setq yas-verbosity 2)
           (setq yas-snippet-dirs
                 (list "~/Dropbox/emacs.d/yas-dict"
                       'yas-installed-snippets-dir)) ;; for Cask
           (custom-set-variables '(yas-trigger-key [tab]))
           (yas-global-mode 1)
           ))

    (dolist (hook
             (list 'perl-mode-hook
                   'c-mode-common-hook 'js2-mode-hook 'org-mode-hook
                   'python-mode-hook))
      (add-hook hook 'yas-minor-mode)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no :exports yes
  (when (eval-after-autoload-if-found
         '(yas-minir-mode yas-expand yas-org-very-safe-expand)
         "yasnippet" nil t nil
         '((setq yas-verbosity 2)
           (setq yas-snippet-dirs
                 (list "~/Dropbox/emacs.d/yas-dict"
                       'yas-installed-snippets-dir))
           (custom-set-variables '(yas-trigger-key [tab]))
           (yas-global-mode 1)

           (defun yas-org-very-safe-expand ()
             (let ((yas-fallback-behavior 'return-nil)) (yas-expand)))))

    (dolist (hook (list 'perl-mode-hook 'c-mode-common-hook))
      ;;                       'emacs-lisp-mode-hook))
      (add-hook hook 'yas-minor-mode))

    (add-hook 'org-mode-hook
              '(lambda ()
                 (yas-minor-mode)
                 ;; org-cycle (<TAB>) との衝突を避ける
                 (setq yas-trigger-symbol [tab])
                 (add-to-list 'org-tab-first-hook 'yas-org-very-safe-expand)
                 (define-key yas-keymap [tab] 'yas-next-field))))
#+END_SRC

** [sdic.el] 英辞郎で英単語を調べる

http://www.namazu.org/~tsuchiya/sdic/index.html

Emacs から辞書を使う．lookup を使う方法もあるが，Emacsから使うのは英辞郎に限定．

#+BEGIN_SRC emacs-lisp :tangle no :exports no
  (when (autoload-if-found
         '(sdic-describe-word sdic-describe-word-at-point)
         "sdic" nil t)
    (eval-after-load "sdic"
      '(progn
         (setq sdic-face-color "#3333FF")
         (setq sdic-default-coding-system 'utf-8)
         ;; Dictionary (English => Japanese)
         (setq sdic-eiwa-dictionary-list
               '((sdicf-client "~/Dropbox/Dic/EIJIRO6/EIJI-128.sdic")))
         ;; Dictionary (Japanese => English)
         (setq sdic-waei-dictionary-list
               '((sdicf-client "~/Dropbox/Dic/EIJIRO6/WAEI-128.sdic"))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no :exports yes
  (eval-after-autoload-if-found
   '(sdic-describe-word sdic-describe-word-at-point) "sdic" nil t nil
   '((setq sdic-face-color "#3333FF")
     (setq sdic-default-coding-system 'utf-8)
     ;; Dictionary (English => Japanese)
     (setq sdic-eiwa-dictionary-list
           '((sdicf-client "~/Dropbox/Dic/EIJIRO6/EIJI-128.sdic")))
     ;; Dictionary (Japanese => English)
     (setq sdic-waei-dictionary-list
           '((sdicf-client "~/Dropbox/Dic/EIJIRO6/WAEI-128.sdic")))))
#+END_SRC

