init.html

<div id="outline-container-orgheadline65" class="outline-3">
<h3 id="orgheadline65"><span class="section-number-3">5.19</span> [po-mode.el] 翻訳ファイルの編集</h3>
<div class="outline-text-3" id="text-5-19">
<p>
<a href="http://www.emacswiki.org/emacs/PoMode">http://www.emacswiki.org/emacs/PoMode</a><br  />
<a href="http://www.emacswiki.org/emacs/po-mode+.el">http://www.emacswiki.org/emacs/po-mode+.el</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;;</span><span style="color: #b22222;">(autoload 'po-mode "po-mode+" nil nil)</span>
<span style="color: #b22222;">;;</span><span style="color: #b22222;">(autoload 'po-mode "po-mode" nil t)</span>
(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(po-mode) <span style="color: #8b2252;">"po-mode"</span> nil t nil
       '())
  (push '(<span style="color: #8b2252;">"\\.po[tx]?\\'</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">|</span><span style="color: #8b2252;">\\.po\\$"</span> . po-mode) auto-mode-alist))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline66" class="outline-3">
<h3 id="orgheadline66"><span class="section-number-3">5.20</span> [word-count.el] リージョン内の文字をカウントする</h3>
<div class="outline-text-3" id="text-5-20">
<p>
有効な頒布元に変更があった．<a href="http://www.emacswiki.org/emacs/WordCount">word-count.el</a> から新しい頒布元にたどりつける．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(word-count-mode) <span style="color: #8b2252;">"word-count"</span> <span style="color: #8b2252;">"Minor mode to count words."</span> t nil
       '())
  (global-set-key (kbd <span style="color: #8b2252;">"M-+"</span>) 'word-count-mode))
</pre>
</div>

<p>
と思ったら，ビルドインの simple.el に十分な機能なのがあった．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #8b2252;">"M-="</span>) 'count-words)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline67" class="outline-3">
<h3 id="orgheadline67"><span class="section-number-3">5.21</span> [yatex.el] YaTeXモード</h3>
<div class="outline-text-3" id="text-5-21">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(yatex-mode) <span style="color: #8b2252;">"yatex"</span> <span style="color: #8b2252;">"Yet Another LaTeX mode"</span> t nil
       '((setq YaTeX-kanji-code 4))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">1=Shift JIS, 2=JIS, 3=EUC, 4=UTF-8</span>
  (push '(<span style="color: #8b2252;">"\\.tex$"</span> . yatex-mode) auto-mode-alist)
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Disable auto line break</span>
  (add-hook 'yatex-mode-hook
            '(<span style="color: #a020f0;">lambda</span> ()
               (setq auto-fill-function nil))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline68" class="outline-3">
<h3 id="orgheadline68"><span class="section-number-3">5.22</span> [wclock.el] 世界時計</h3>
<div class="outline-text-3" id="text-5-22">
<p>
<a href="http://pastelwill.jp/wiki/doku.php?id=emacs">http://pastelwill.jp/wiki/doku.php?id=emacs</a><br  />
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found 'wclock <span style="color: #8b2252;">"wclock"</span> nil t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline69" class="outline-3">
<h3 id="orgheadline69"><span class="section-number-3">5.23</span> [yasnippet.el] Emacs用のテンプレートシステム</h3>
<div class="outline-text-3" id="text-5-23">
<p>
<a href="https://github.com/capitaomorte/yasnippet">https://github.com/capitaomorte/yasnippet</a><br  />
</p>

<ul class="org-ul">
<li><a href="http://yasnippet-doc-jp.googlecode.com/svn/trunk/doc-jp/index.html">http://yasnippet-doc-jp.googlecode.com/svn/trunk/doc-jp/index.html</a><br  /></li>
<li><a href="http://d.hatena.ne.jp/IMAKADO/20080401/1206715770">http://d.hatena.ne.jp/IMAKADO/20080401/1206715770</a><br  /></li>
<li><a href="http://coderepos.org/share/browser/config/yasnippet">http://coderepos.org/share/browser/config/yasnippet</a><br  /></li>
<li><a href="https://github.com/RickMoynihan/yasnippet-org-mode">https://github.com/RickMoynihan/yasnippet-org-mode</a><br  /></li>
</ul>

<p>
<a href="http://orgmode.org/manual/Conflicts.html">Org-modeとの衝突を避ける</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(yas-global-mode yas-minor-mode)
       <span style="color: #8b2252;">"yasnippet"</span> nil t nil
       '((setq yas-verbosity 2)
         (setq yas-snippet-dirs
               (list <span style="color: #8b2252;">"~/Dropbox/emacs.d/yas-dict"</span>
                     'yas-installed-snippets-dir)) <span style="color: #b22222;">;; </span><span style="color: #b22222;">for Cask</span>
         (custom-set-variables '(yas-trigger-key [tab]))
         (yas-global-mode 1)
         ))

  (<span style="color: #a020f0;">dolist</span> (hook (list 'perl-mode-hook 'c-mode-common-hook 'org-mode-hook))
    (add-hook hook 'yas-minor-mode)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(yas-minir-mode yas-expand yas-org-very-safe-expand) <span style="color: #8b2252;">"yasnippet"</span> nil t nil
 '((setq yas-verbosity 2)
   (setq yas-snippet-dirs
         (list <span style="color: #8b2252;">"~/Dropbox/emacs.d/yas-dict"</span>
               'yas-installed-snippets-dir))
   (custom-set-variables '(yas-trigger-key [tab]))
   (yas-global-mode 1)

   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">yas-org-very-safe-expand</span> ()
     (<span style="color: #a020f0;">let</span> ((yas-fallback-behavior 'return-nil)) (yas-expand)))))

(<span style="color: #a020f0;">dolist</span> (hook (list 'perl-mode-hook 'c-mode-common-hook))
  <span style="color: #b22222;">;;                       </span><span style="color: #b22222;">'emacs-lisp-mode-hook))</span>
  (add-hook hook 'yas-minor-mode))

(add-hook 'org-mode-hook
          '(<span style="color: #a020f0;">lambda</span> ()
             (yas-minor-mode)
             <span style="color: #b22222;">;; </span><span style="color: #b22222;">org-cycle (&lt;TAB&gt;) &#12392;&#12398;&#34909;&#31361;&#12434;&#36991;&#12369;&#12427;</span>
             (setq yas-trigger-symbol [tab])
             (add-to-list 'org-tab-first-hook 'yas-org-very-safe-expand)
             (define-key yas-keymap [tab] 'yas-next-field)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline71" class="outline-3">
<h3 id="orgheadline71"><span class="section-number-3">5.24</span> [sdic.el] 英辞郎で英単語を調べる</h3>
<div class="outline-text-3" id="text-5-24">
<p>
<a href="http://www.namazu.org/~tsuchiya/sdic/index.html">http://www.namazu.org/~tsuchiya/sdic/index.html</a><br  />
</p>

<p>
Emacs から辞書を使う．lookup を使う方法もあるが，Emacsから使うのは英辞郎に限定．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (autoload-if-found
       '(sdic-describe-word sdic-describe-word-at-point)
       <span style="color: #8b2252;">"sdic"</span> nil t)
  (eval-after-load <span style="color: #8b2252;">"sdic"</span>
    '(<span style="color: #a020f0;">progn</span>
       (setq sdic-face-color <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #3333FF;">#3333FF</span><span style="color: #8b2252;">"</span>)
       (setq sdic-default-coding-system 'utf-8)
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">Dictionary (English =&gt; Japanese)</span>
       (setq sdic-eiwa-dictionary-list
             '((sdicf-client <span style="color: #8b2252;">"~/Dropbox/Dic/EIJIRO6/EIJI-128.sdic"</span>)))
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">Dictionary (Japanese =&gt; English)</span>
       (setq sdic-waei-dictionary-list
             '((sdicf-client <span style="color: #8b2252;">"~/Dropbox/Dic/EIJIRO6/WAEI-128.sdic"</span>))))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(sdic-describe-word sdic-describe-word-at-point) <span style="color: #8b2252;">"sdic"</span> nil t nil
 '((setq sdic-face-color <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #3333FF;">#3333FF</span><span style="color: #8b2252;">"</span>)
   (setq sdic-default-coding-system 'utf-8)
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Dictionary (English =&gt; Japanese)</span>
   (setq sdic-eiwa-dictionary-list
         '((sdicf-client <span style="color: #8b2252;">"~/Dropbox/Dic/EIJIRO6/EIJI-128.sdic"</span>)))
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Dictionary (Japanese =&gt; English)</span>
   (setq sdic-waei-dictionary-list
         '((sdicf-client <span style="color: #8b2252;">"~/Dropbox/Dic/EIJIRO6/WAEI-128.sdic"</span>)))))
</pre>
</div>
</div>
