init.el

;;(autoload 'po-mode "po-mode+" nil nil)
;;(autoload 'po-mode "po-mode" nil t)
(when (eval-after-autoload-if-found
       '(po-mode) "po-mode")
  (push '("\\.po[tx]?\\'\\|\\.po\\$" . po-mode) auto-mode-alist))

(global-set-key (kbd "M-=") 'count-words)

(when (eval-after-autoload-if-found
       '(yatex-mode) "yatex" "Yet Another LaTeX mode" t nil
       '((setq YaTeX-kanji-code 4))) ;; 1=Shift JIS, 2=JIS, 3=EUC, 4=UTF-8
  (push '("\\.tex$" . yatex-mode) auto-mode-alist)
  ;; Disable auto line break
  (add-hook 'yatex-mode-hook
            '(lambda () (setq auto-fill-function nil))))

(eval-after-autoload-if-found 'wclock "wclock")

(when (eval-after-autoload-if-found
       '(yas-global-mode yas-minor-mode)
       "yasnippet" nil t nil
       '((setq yas-verbosity 2)
         (setq yas-snippet-dirs
               (list "~/Dropbox/emacs.d/yas-dict"
                     'yas-installed-snippets-dir)) ;; for Cask
         (custom-set-variables '(yas-trigger-key [tab]))
         (yas-global-mode 1)
         ))

  (dolist (hook
           (list 'perl-mode-hook
                 'c-mode-common-hook 'js2-mode-hook 'org-mode-hook
                 'python-mode-hook))
    (add-hook hook 'yas-minor-mode)))

(when (eval-after-autoload-if-found
