init.org
*** キーバインド

#+BEGIN_SRC emacs-lisp :tangle no :exports yes
  ;; カーソルの位置の英単語の意味を調べる
  (global-set-key (kbd "C-M-w") 'sdic-describe-word-at-point)
  ;; ミニバッファに英単語を入れて英辞郎を使う
  (global-set-key (kbd "C-c w") 'sdic-describe-word)
#+END_SRC

** MacOSのdictionary.appで辞書をひく

=osx-dictionary= なるパッケージが存在します．さくさくと高速に動作します．

#+BEGIN_SRC emacs-lisp :tangle yes :exports yes 
  (when (eval-after-autoload-if-found
         '(osx-dictionary-search-pointer osx-dictionary-search-input)
         "osx-dictionary" nil t nil
         '((setq osx-dictionary-dictionary-choice "英辞郎 第七版")))
    (global-set-key (kbd "C-M-w") 'osx-dictionary-search-pointer))
#+END_SRC

COBUILD5をデフォルトで使うには，次のサイト参照してください．

  - [[http://safx-dev.blogspot.jp/2012/02/collins-cobuld-5dictionaryapp.html][Collins COBULD 5をDictionary.appで利用できるようにする]]

私の場合は，できあがった辞書を =/Library/Dictionaries/= 以下に置いています．その状態で dictionary.app の設定で辞書の優先順位を変えることで，常にCOBUILD5の情報を引っ張り出せます．もしくは， =osx-dictionary-dictionary-choice= で辞書名を指定します．

** MacOSのdictionary.appでCOBUILD5の辞書をひく（旧）

OS標準の辞書アプリ（dictionary.app）を経由して，バッファにCOBUILD5のデータを流し込むことができます．

  - [[http://sakito.jp/mac/dictionary.html#emacs][辞書(Dictionary).appを使い倒そう]]

以下の関数を準備します．

#+BEGIN_SRC emacs-lisp :tangle no :exports yes
  (defun dictionary ()
    "dictionary.app"
    (interactive)

    (let ((editable (not buffer-read-only))
          (pt (save-excursion (mouse-set-point last-nonmenu-event)))
          beg end)

      (if (and mark-active
               (<= (region-beginning) pt) (<= pt (region-end)) )
          (setq beg (region-beginning)
                end (region-end))
        (save-excursion
          (goto-char pt)
          (setq end (progn (forward-word) (point)))
          (setq beg (progn (backward-word) (point)))
          ))

      (let ((word (buffer-substring-no-properties beg end))
            ;;            (win (selected-window))
            (tmpbuf " * dict-process*"))
        (pop-to-buffer tmpbuf)
        (erase-buffer)
        (insert "Query: " word "\n\n")
        (start-process "dict-process" tmpbuf "dict.py" word)
        (goto-char 0)
        ;;        (select-window win)
        )))
#+END_SRC

これでカーソル以下の単語の情報が別ウィンドウに出ます．チェックし終わったら =C-x 1= (delete-other-windows) で表示を閉じます． =q= で閉じられるようにしたり，ツールチップで表示したりもできるはずです．

マスタカさんのナイスソリューションをまだ試していないので，こちらの方がエレガントかもしれません．

  - [[http://masutaka.net/chalow/2011-05-18-1.html][Emacs で Mac の辞書を sdic っぽく使う ]]
  - [[http://masutaka.net/chalow/2012-09-17-1.html][EmacsからMacの辞書をお手軽に使う]]

なお，COBUILD5の辞書データをdictionary.appで引けるようにするには以下の操作が必要です．

  - [[http://safx-dev.blogspot.jp/2012/02/collins-cobuld-5dictionaryapp.html][Collins COBULD 5をDictionary.appで利用できるようにする]]

私の場合は，できあがった辞書を =/Library/Dictionaries/= 以下に置いています．その状態で dictionary.app の設定で辞書の優先順位を変えることで，常にCOBUILD5の情報を引っ張り出せます．

*** マイナーモード化

    =q= で閉じたくなったのでマイナーモードを作りました．これまで通り， =C-M-w= でカーソル下の単語を調べてポップアップで表示．カーソルはその新しいバッファに移しておき， =q= で閉じられます．新しいバッファ内で別な単語を =C-M-w= で調べると，同じバッファに結果を再描画します．

    マイナーモード化した elisp は，[[https://gist.github.com/takaxp/9786376][gist]]で公開しています．

*** キーバインド

    マイナーモード化した dict-app を使う場合は以下のようにします．sdic を使っている人は，sdic 用の設定と衝突しないように気をつけます．

#+BEGIN_SRC emacs-lisp :tangle no :exports yes
  (when (eval-after-autoload-if-found
         '(dict-app-search) "dict-app")
    ;; カーソルの位置の英単語の意味を調べる  
    (global-set-key (kbd "C-M-w") 'dict-app-search))
#+END_SRC

