init.html

<div id="outline-container-orgheadline70" class="outline-4">
<h4 id="orgheadline70"><span class="section-number-4">5.24.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-5-24-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12459;&#12540;&#12477;&#12523;&#12398;&#20301;&#32622;&#12398;&#33521;&#21336;&#35486;&#12398;&#24847;&#21619;&#12434;&#35519;&#12409;&#12427;</span>
(global-set-key (kbd <span style="color: #8b2252;">"C-M-w"</span>) 'sdic-describe-word-at-point)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12511;&#12491;&#12496;&#12483;&#12501;&#12449;&#12395;&#33521;&#21336;&#35486;&#12434;&#20837;&#12428;&#12390;&#33521;&#36766;&#37070;&#12434;&#20351;&#12358;</span>
(global-set-key (kbd <span style="color: #8b2252;">"C-c w"</span>) 'sdic-describe-word)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline74" class="outline-3">
<h3 id="orgheadline74"><span class="section-number-3">5.25</span> MacOSのdictionary.appでCOBUILD5の辞書をひく</h3>
<div class="outline-text-3" id="text-5-25">
<p>
OS標準の辞書アプリ（dictionary.app）を経由して，バッファにCOBUILD5のデータを流し込むことができます．<br  />
</p>

<ul class="org-ul">
<li><a href="http://sakito.jp/mac/dictionary.html#emacs">辞書(Dictionary).appを使い倒そう</a><br  /></li>
</ul>

<p>
以下の関数を準備します．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">dictionary</span> ()
  <span style="color: #8b2252;">"dictionary.app"</span>
  (interactive)

  (<span style="color: #a020f0;">let</span> ((editable (not buffer-read-only))
        (pt (<span style="color: #a020f0;">save-excursion</span> (mouse-set-point last-nonmenu-event)))
        beg end)

    (<span style="color: #a020f0;">if</span> (and mark-active
             (&lt;= (region-beginning) pt) (&lt;= pt (region-end)) )
        (setq beg (region-beginning)
              end (region-end))
      (<span style="color: #a020f0;">save-excursion</span>
        (goto-char pt)
        (setq end (<span style="color: #a020f0;">progn</span> (forward-word) (point)))
        (setq beg (<span style="color: #a020f0;">progn</span> (backward-word) (point)))
        ))

    (<span style="color: #a020f0;">let</span> ((word (buffer-substring-no-properties beg end))
          <span style="color: #b22222;">;;            </span><span style="color: #b22222;">(win (selected-window))</span>
          (tmpbuf <span style="color: #8b2252;">" * dict-process*"</span>))
      (pop-to-buffer tmpbuf)
      (erase-buffer)
      (insert <span style="color: #8b2252;">"Query: "</span> word <span style="color: #8b2252;">"\n\n"</span>)
      (start-process <span style="color: #8b2252;">"dict-process"</span> tmpbuf <span style="color: #8b2252;">"dict.py"</span> word)
      (goto-char 0)
      <span style="color: #b22222;">;;        </span><span style="color: #b22222;">(select-window win)</span>
      )))
</pre>
</div>

<p>
これでカーソル以下の単語の情報が別ウィンドウに出ます．チェックし終わったら <code>C-x 1</code> (delete-other-windows) で表示を閉じます． <code>q</code> で閉じられるようにしたり，ツールチップで表示したりもできるはずです．<br  />
</p>

<p>
マスタカさんのナイスソリューションをまだ試していないので，こちらの方がエレガントかもしれません．<br  />
</p>

<ul class="org-ul">
<li><a href="http://masutaka.net/chalow/2011-05-18-1.html">Emacs で Mac の辞書を sdic っぽく使う </a><br  /></li>
<li><a href="http://masutaka.net/chalow/2012-09-17-1.html">EmacsからMacの辞書をお手軽に使う</a><br  /></li>
</ul>

<p>
なお，COBUILD5の辞書データをdictionary.appで引けるようにするには以下の操作が必要です．<br  />
</p>

<ul class="org-ul">
<li><a href="http://safx-dev.blogspot.jp/2012/02/collins-cobuld-5dictionaryapp.html">Collins COBULD 5をDictionary.appで利用できるようにする</a><br  /></li>
</ul>

<p>
私の場合は，できあがった辞書を <code>/Library/Dictionaries/</code> 以下に置いています．その状態で dictionary.app の設定で辞書の優先順位を変えることで，常にCOBUILD5の情報を引っ張り出せます．<br  />
</p>
</div>

<div id="outline-container-orgheadline72" class="outline-4">
<h4 id="orgheadline72"><span class="section-number-4">5.25.1</span> マイナーモード化</h4>
<div class="outline-text-4" id="text-5-25-1">
<p>
<code>q</code> で閉じたくなったのでマイナーモードを作りました．これまで通り， <code>C-M-w</code> でカーソル下の単語を調べてポップアップで表示．カーソルはその新しいバッファに移しておき， <code>q</code> で閉じられます．新しいバッファ内で別な単語を <code>C-M-w</code> で調べると，同じバッファに結果を再描画します．<br  />
</p>

<p>
マイナーモード化した elisp は，<a href="https://gist.github.com/takaxp/9786376">gist</a>で公開しています．<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline73" class="outline-4">
<h4 id="orgheadline73"><span class="section-number-4">5.25.2</span> キーバインド</h4>
<div class="outline-text-4" id="text-5-25-2">
<p>
マイナーモード化した dict-app を使う場合は以下のようにします．sdic を使っている人は，sdic 用の設定と衝突しないように気をつけます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(dict-app-search) <span style="color: #8b2252;">"dict-app"</span> nil t nil
       '())
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12459;&#12540;&#12477;&#12523;&#12398;&#20301;&#32622;&#12398;&#33521;&#21336;&#35486;&#12398;&#24847;&#21619;&#12434;&#35519;&#12409;&#12427;  </span>
  (global-set-key (kbd <span style="color: #8b2252;">"C-M-w"</span>) 'dict-app-search))
</pre>
</div>
</div>
</div>
</div>
