init.el
       '(osx-dictionary-search-pointer osx-dictionary-search-input)
       "osx-dictionary" nil t nil
       '((setq osx-dictionary-dictionary-choice "英辞郎 第七版")))
  (global-set-key (kbd "C-M-w") 'osx-dictionary-search-pointer))

(when (eval-after-autoload-if-found
