init.org
** [lookup.el] 辞書

最近使っていません．

#+BEGIN_SRC emacs-lisp :tangle no
  ;; .lookup/cache.el
  (setq lookup-init-directory "~/env/dot_files/.lookup")

  (autoload 'lookup "lookup" nil t)
  (autoload 'lookup-region "lookup" nil t)
  (autoload 'lookup-word "lookup" nil t)
  (autoload 'lookup-select-dictionaries "lookup" nil t)

  (setq lookup-search-modules
        '(("default"
           ("ndeb:/Users/taka/Dropbox/Dic/COBUILD5/cobuild" :priority t)
           ("ndeb:/Users/taka/Dropbox/Dic/COBUILD5/wordbank" :priority t)
           ("ndeb:/Users/taka/Dropbox/Dic/LDOCE4/ldoce4" :priority t)
           ("ndeb:/Users/taka/Dropbox/Dic/LDOCE4/bank" :priority t)
           ("ndeb:/Users/taka/Dropbox/Dic/LDOCE4/colloc" :priority t)
           ("ndeb:/Users/taka/Dropbox/Dic/LDOCE4/activ" :priority t))))

  (setq lookup-agent-attributes
        '(("ndeb:/Users/taka/Dropbox/Dic/COBUILD5"
           (dictionaries "cobuild" "wordbank"))
          ("ndeb:/Users/taka/Dropbox/Dic/LDOCE4"
           (dictionaries "ldoce4" "bank" "colloc" "activ"))))

  (setq lookup-dictionary-attributes
        '(("ndeb:/Users/taka/Dropbox/Dic/COBUILD5/cobuild"
           (title . "COBUILD 5th Edition")
           (methods exact prefix))
          ("ndeb:/Users/taka/Dropbox/Dic/COBUILD5/wordbank"
           (title . "Wordbank")
           (methods))
          ("ndeb:/Users/taka/Dropbox/Dic/LDOCE4/ldoce4"
           (title . "Longman 4th Edition")
           (methods exact prefix))
          ("ndeb:/Users/taka/Dropbox/Dic/LDOCE4/bank"
           (title . "LDOCE4 Examples and Phrases")
           (methods exact prefix menu))
          ("ndeb:/Users/taka/Dropbox/Dic/LDOCE4/colloc"
           (title . "LDOCE4 Collocation")
           (methods exact prefix))
          ("ndeb:/Users/taka/Dropbox/Dic/LDOCE4/activ"
           (title . "Longman Activator")
           (methods exact prefix menu))))

  (setq lookup-default-dictionary-options
        '((:stemmer .  stem-english)))
  (setq lookup-use-kakasi nil)

  ;;; lookup for dictionary (require EB Library, eblook, and lookup.el)
  ;; package download: http://sourceforge.net/projects/lookup
  ;; http://lookup.sourceforge.net/docs/ja/index.shtml#Top
  ;; http://www.bookshelf.jp/texi/lookup/lookup-guide.html#SEC_Top
                                          ;(load "lookup-autoloads") ; for 1.99
                                          ;(autoload 'lookup "lookup" nil t)
                                          ;(autoload 'lookup-region "lookup" nil t)
                                          ;(autoload 'lookup-word "lookup" nil t)
                                          ;(autoload 'lookup-select-dictionaries "lookup" nil t)
  ;; Search Agents
  ;; ndeb option requries "eblook" command
                                          ; Use expand-file-name!
                                          ;(setq lookup-search-agents `((ndeb ,(concat homedir "/Dropbox/Dic/COBUILD5"))
                                          ;                            (ndeb ,(concat homedir "/Dropbox/Dic/LDOCE4"))))
                                          ;(setq lookup-use-bitmap nil)
                                          ;(setq ndeb-program-name "/usr/bin/eblook")
                                          ;(when (eq window-system 'ns)
                                          ;  (setq ndeb-program-name "/opt/local/bin/eblook")
                                          ;  (setq ndeb-program-arguments '("-q" "-e" "euc-jp"))
                                          ;  (setq ndeb-process-coding-system 'utf-8)) ; utf-8-hfs
#+END_SRC

*** キーバインド

#+BEGIN_SRC emacs-lisp :tangle no
  (global-set-key (kbd "<f6>") 'lookup-word)
#+END_SRC

** [cacoo] Cacoo で描く

画像をリサイズしてバッファに表示する用途にも使える．

#+BEGIN_SRC emacs-lisp :tangle no :exports no
  (when (autoload-if-found 'toggle-cacoo-minor-mode "cacoo" nil t)
    (global-set-key (kbd "M--") 'toggle-cacoo-minor-mode)
    (eval-after-load "cacoo"
      '(progn
         (require 'cacoo-plugins))))  
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
  (when (eval-after-autoload-if-found
         '(toggle-cacoo-minor-mode) "cacoo" nil t nil
         '((require 'cacoo-plugins)))

    (global-set-key (kbd "M--") 'toggle-cacoo-minor-mode))
#+END_SRC

** [iedit] バッファ内の同じ文字列を一度に編集する

[[http://emacswiki.org/emacs/iedit.el][iedit.el]] を使うと，バッファ内の同じ文字列を一度に編集することができる．部分重複のない変数名を置き換えるときに有用な場合がある．

#+BEGIN_SRC emacs-lisp :tangle no
  (require 'iedit nil t)
#+END_SRC

