init.html

<div id="outline-container-orgheadline76" class="outline-3">
<h3 id="orgheadline76"><span class="section-number-3">5.26</span> [lookup.el] 辞書</h3>
<div class="outline-text-3" id="text-5-26">
<p>
最近使っていません．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">.lookup/cache.el</span>
(setq lookup-init-directory <span style="color: #8b2252;">"~/env/dot_files/.lookup"</span>)

(autoload 'lookup <span style="color: #8b2252;">"lookup"</span> nil t)
(autoload 'lookup-region <span style="color: #8b2252;">"lookup"</span> nil t)
(autoload 'lookup-word <span style="color: #8b2252;">"lookup"</span> nil t)
(autoload 'lookup-select-dictionaries <span style="color: #8b2252;">"lookup"</span> nil t)

(setq lookup-search-modules
      '((<span style="color: #8b2252;">"default"</span>
         (<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/COBUILD5/cobuild"</span> <span style="color: #483d8b;">:priority</span> t)
         (<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/COBUILD5/wordbank"</span> <span style="color: #483d8b;">:priority</span> t)
         (<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/LDOCE4/ldoce4"</span> <span style="color: #483d8b;">:priority</span> t)
         (<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/LDOCE4/bank"</span> <span style="color: #483d8b;">:priority</span> t)
         (<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/LDOCE4/colloc"</span> <span style="color: #483d8b;">:priority</span> t)
         (<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/LDOCE4/activ"</span> <span style="color: #483d8b;">:priority</span> t))))

(setq lookup-agent-attributes
      '((<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/COBUILD5"</span>
         (dictionaries <span style="color: #8b2252;">"cobuild"</span> <span style="color: #8b2252;">"wordbank"</span>))
        (<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/LDOCE4"</span>
         (dictionaries <span style="color: #8b2252;">"ldoce4"</span> <span style="color: #8b2252;">"bank"</span> <span style="color: #8b2252;">"colloc"</span> <span style="color: #8b2252;">"activ"</span>))))

(setq lookup-dictionary-attributes
      '((<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/COBUILD5/cobuild"</span>
         (title . <span style="color: #8b2252;">"COBUILD 5th Edition"</span>)
         (methods exact prefix))
        (<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/COBUILD5/wordbank"</span>
         (title . <span style="color: #8b2252;">"Wordbank"</span>)
         (methods))
        (<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/LDOCE4/ldoce4"</span>
         (title . <span style="color: #8b2252;">"Longman 4th Edition"</span>)
         (methods exact prefix))
        (<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/LDOCE4/bank"</span>
         (title . <span style="color: #8b2252;">"LDOCE4 Examples and Phrases"</span>)
         (methods exact prefix menu))
        (<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/LDOCE4/colloc"</span>
         (title . <span style="color: #8b2252;">"LDOCE4 Collocation"</span>)
         (methods exact prefix))
        (<span style="color: #8b2252;">"ndeb:/Users/taka/Dropbox/Dic/LDOCE4/activ"</span>
         (title . <span style="color: #8b2252;">"Longman Activator"</span>)
         (methods exact prefix menu))))

(setq lookup-default-dictionary-options
      '((<span style="color: #483d8b;">:stemmer</span> .  stem-english)))
(setq lookup-use-kakasi nil)

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">lookup for dictionary (require EB Library, eblook, and lookup.el)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">package download: http://sourceforge.net/projects/lookup</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">http://lookup.sourceforge.net/docs/ja/index.shtml#Top</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">http://www.bookshelf.jp/texi/lookup/lookup-guide.html#SEC_Top</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">(load "lookup-autoloads") ; for 1.99</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">(autoload 'lookup "lookup" nil t)</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">(autoload 'lookup-region "lookup" nil t)</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">(autoload 'lookup-word "lookup" nil t)</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">(autoload 'lookup-select-dictionaries "lookup" nil t)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Search Agents</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">ndeb option requries "eblook" command</span>
                                        <span style="color: #b22222;">; </span><span style="color: #b22222;">Use expand-file-name!</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">(setq lookup-search-agents `((ndeb ,(concat homedir "/Dropbox/Dic/COBUILD5"))</span>
                                        <span style="color: #b22222;">;                            </span><span style="color: #b22222;">(ndeb ,(concat homedir "/Dropbox/Dic/LDOCE4"))))</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">(setq lookup-use-bitmap nil)</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">(setq ndeb-program-name "/usr/bin/eblook")</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">(when (eq window-system 'ns)</span>
                                        <span style="color: #b22222;">;  </span><span style="color: #b22222;">(setq ndeb-program-name "/opt/local/bin/eblook")</span>
                                        <span style="color: #b22222;">;  </span><span style="color: #b22222;">(setq ndeb-program-arguments '("-q" "-e" "euc-jp"))</span>
                                        <span style="color: #b22222;">;  </span><span style="color: #b22222;">(setq ndeb-process-coding-system 'utf-8)) ; utf-8-hfs</span>
</pre>
</div>
</div>
<div id="outline-container-orgheadline75" class="outline-4">
<h4 id="orgheadline75"><span class="section-number-4">5.26.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-5-26-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #8b2252;">"&lt;f6&gt;"</span>) 'lookup-word)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline77" class="outline-3">
<h3 id="orgheadline77"><span class="section-number-3">5.27</span> [cacoo] Cacoo で描く</h3>
<div class="outline-text-3" id="text-5-27">
<p>
画像をリサイズしてバッファに表示する用途にも使える．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (autoload-if-found 'toggle-cacoo-minor-mode <span style="color: #8b2252;">"cacoo"</span> nil t)
  (global-set-key (kbd <span style="color: #8b2252;">"M--"</span>) 'toggle-cacoo-minor-mode)
  (eval-after-load <span style="color: #8b2252;">"cacoo"</span>
    '(<span style="color: #a020f0;">progn</span>
       (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">cacoo-plugins</span>))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(toggle-cacoo-minor-mode) <span style="color: #8b2252;">"cacoo"</span> nil t nil
       '((<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">cacoo-plugins</span>)))

  (global-set-key (kbd <span style="color: #8b2252;">"M--"</span>) 'toggle-cacoo-minor-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline78" class="outline-3">
<h3 id="orgheadline78"><span class="section-number-3">5.28</span> [iedit] バッファ内の同じ文字列を一度に編集する</h3>
<div class="outline-text-3" id="text-5-28">
<p>
<a href="http://emacswiki.org/emacs/iedit.el">iedit.el</a> を使うと，バッファ内の同じ文字列を一度に編集することができる．部分重複のない変数名を置き換えるときに有用な場合がある．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">iedit</span> nil t)
</pre>
</div>
</div>
</div>
