init.html

<div id="outline-container-orgheadline79" class="outline-3">
<h3 id="orgheadline79"><span class="section-number-3">5.29</span> [web-mode] HTML編集</h3>
<div class="outline-text-3" id="text-5-29">
<p>
HTML編集をするなら <a href="http://web-mode.org/">web-mode</a> がお勧めです．古いHTMLモードを使っている方は，移行時期です．以下の <code>my:web-indent-fold</code> では， タブキーを打つたびにタグでくくられた領域を展開／非表示して整形します．Org-mode っぽい動作になりますが，操作の度にバッファに変更が加わったと判断されるので好みが分かれると思います．自動保存を有効にしているとそれほど気になりません．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(web-mode) <span style="color: #8b2252;">"web-mode"</span> <span style="color: #8b2252;">"web-mode"</span> t nil
       '((<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:web-indent-fold</span> ()
           (interactive)
           (web-mode-fold-or-unfold)
           (web-mode-buffer-indent)
           (indent-for-tab-command))

         <span style="color: #b22222;">;; </span><span style="color: #b22222;">indent</span>
         (setq web-mode-markup-indent-offset 1)

         <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#33394;&#12398;&#35373;&#23450;</span>
         (custom-set-faces
          <span style="color: #b22222;">;; </span><span style="color: #b22222;">custom-set-faces was added by Custom.</span>
          <span style="color: #b22222;">;; </span><span style="color: #b22222;">If you edit it by hand, you could mess it up, so be careful.</span>
          <span style="color: #b22222;">;; </span><span style="color: #b22222;">Your init file should contain only one such instance.</span>
          <span style="color: #b22222;">;; </span><span style="color: #b22222;">If there is more than one, they won't work right.</span>
          '(default ((t (<span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #202020;">#202020</span><span style="color: #8b2252;">"</span>))))
          '(web-mode-comment-face ((t (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #D9333F;">#D9333F</span><span style="color: #8b2252;">"</span>))))
          '(web-mode-css-at-rule-face ((t (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FF7F00;">#FF7F00</span><span style="color: #8b2252;">"</span>))))
          '(web-mode-css-pseudo-class-face ((t (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FF7F00;">#FF7F00</span><span style="color: #8b2252;">"</span>))))
          '(web-mode-css-rule-face ((t (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #A0D8EF;">#A0D8EF</span><span style="color: #8b2252;">"</span>))))
          '(web-mode-doctype-face ((t (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #82AE46;">#82AE46</span><span style="color: #8b2252;">"</span>))))
          '(web-mode-html-attr-name-face ((t (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #C97586;">#C97586</span><span style="color: #8b2252;">"</span>))))
          '(web-mode-html-attr-value-face ((t (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #82AE46;">#82AE46</span><span style="color: #8b2252;">"</span>))))
          '(web-mode-html-tag-face ((t (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"#</span><span style="color: #ffffff; background-color: #4682ae;">#4682ae</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:weight</span> bold))))
          '(web-mode-server-comment-face ((t (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #D9333F;">#D9333F</span><span style="color: #8b2252;">"</span>)))))
         (define-key web-mode-map (kbd <span style="color: #8b2252;">"&lt;tab&gt;"</span>) 'my:web-indent-fold)))


  <span style="color: #b22222;">;; </span><span style="color: #b22222;">web-mode &#12391;&#38283;&#12367;&#12501;&#12449;&#12452;&#12523;&#12398;&#25313;&#24373;&#23376;&#12434;&#25351;&#23450;</span>
  (setq auto-mode-alist
        (append '((<span style="color: #8b2252;">"\\.phtml\\'"</span> . web-mode)
                  (<span style="color: #8b2252;">"\\.tpl\\.php\\'"</span> . web-mode)
                  (<span style="color: #8b2252;">"\\.jsp\\'"</span> . web-mode)
                  (<span style="color: #8b2252;">"\\.as[cp]x\\'"</span> . web-mode)
                  (<span style="color: #8b2252;">"\\.erb\\'"</span> . web-mode)
                  (<span style="color: #8b2252;">"\\.mustache\\'"</span> . web-mode)
                  (<span style="color: #8b2252;">"\\.djhtml\\'"</span> . web-mode)
                  (<span style="color: #8b2252;">"\\.html?\\'"</span> . web-mode))
                auto-mode-alist)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline80" class="outline-3">
<h3 id="orgheadline80"><span class="section-number-3">5.30</span> [zencoding-mode] HTML編集の高速化</h3>
<div class="outline-text-3" id="text-5-30">
<p>
zencoding でタグ打ちを効率化します．<br  />
</p>

<ul class="org-ul">
<li><a href="http://www.emacswiki.org/emacs/ZenCoding">http://www.emacswiki.org/emacs/ZenCoding</a><br  /></li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'sgml-mode-hook 'zencoding-mode)
(add-hook 'html-mode-hook 'zencoding-mode)
(add-hook 'web-mode-hook 'zencoding-mode)
(eval-after-autoload-if-found
 '(zencoding-mode zencoding-expand-line) <span style="color: #8b2252;">"zencoding-mode"</span> <span style="color: #8b2252;">"Zen-coding"</span> t nil
 '((define-key zencoding-mode-keymap (kbd <span style="color: #8b2252;">"M-&lt;return&gt;"</span>) 'zencoding-expand-line)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline81" class="outline-3">
<h3 id="orgheadline81"><span class="section-number-3">5.31</span> [emmet-mode] zencoding の後継</h3>
<div class="outline-text-3" id="text-5-31">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(emmet-mode) <span style="color: #8b2252;">"emmet-mode"</span> nil t nil
       '((setq emmet-indentation 2)
         (setq emmet-move-cursor-between-quotes t)))
  (push '(<span style="color: #8b2252;">"\\.xml\\'"</span> . nxml-mode) auto-mode-alist)
  (push '(<span style="color: #8b2252;">"\\.rdf\\'"</span> . nxml-mode) auto-mode-alist)
  (add-hook 'sgml-mode-hook 'emmet-mode)
  (add-hook 'nxml-mode-hook 'emmet-mode)
  (add-hook 'css-mode-hook 'emmet-mode)
  (add-hook 'html-mode-hook 'emmet-mode)
  (add-hook 'web-mode-hook 'emmet-mode))
</pre>
</div>
</div>
</div>
</div>
