init.el
       '(web-mode) "web-mode" "web-mode" t nil
       '((defun my:web-indent-fold ()
           (interactive)
           (web-mode-fold-or-unfold)
           (web-mode-buffer-indent)
           (indent-for-tab-command))

         ;; indent
         (setq web-mode-markup-indent-offset 1)

         ;; 色の設定
         (custom-set-faces
          ;; custom-set-faces was added by Custom.
          ;; If you edit it by hand, you could mess it up, so be careful.
          ;; Your init file should contain only one such instance.
          ;; If there is more than one, they won't work right.
          '(default ((t (:background "#FFFFFF" :foreground "#202020"))))
          '(web-mode-comment-face ((t (:foreground "#D9333F"))))
          '(web-mode-css-at-rule-face ((t (:foreground "#FF7F00"))))
          '(web-mode-css-pseudo-class-face ((t (:foreground "#FF7F00"))))
          '(web-mode-css-rule-face ((t (:foreground "#A0D8EF"))))
          '(web-mode-doctype-face ((t (:foreground "#82AE46"))))
          '(web-mode-html-attr-name-face ((t (:foreground "#C97586"))))
          '(web-mode-html-attr-value-face ((t (:foreground "#82AE46"))))
          '(web-mode-html-tag-face ((t (:foreground "##4682ae" :weight bold))))
          '(web-mode-server-comment-face ((t (:foreground "#D9333F")))))
         (define-key web-mode-map (kbd "<tab>") 'my:web-indent-fold)))


  ;; web-mode で開くファイルの拡張子を指定
  (setq auto-mode-alist
        (append '(("\\.phtml\\'" . web-mode)
                  ("\\.tpl\\.php\\'" . web-mode)
                  ("\\.jsp\\'" . web-mode)
                  ("\\.as[cp]x\\'" . web-mode)
                  ("\\.erb\\'" . web-mode)
                  ("\\.mustache\\'" . web-mode)
                  ("\\.djhtml\\'" . web-mode)
                  ("\\.html?\\'" . web-mode))
                auto-mode-alist)))

(when (eval-after-autoload-if-found
       '(emmet-mode) "emmet-mode" nil t nil
       '((setq emmet-indentation 2)
         (setq emmet-move-cursor-between-quotes t)))
  (push '("\\.xml\\'" . nxml-mode) auto-mode-alist)
  (push '("\\.rdf\\'" . nxml-mode) auto-mode-alist)
  (add-hook 'sgml-mode-hook 'emmet-mode)
  (add-hook 'nxml-mode-hook 'emmet-mode)
  (add-hook 'css-mode-hook 'emmet-mode)
  (add-hook 'html-mode-hook 'emmet-mode)
  (add-hook 'web-mode-hook 'emmet-mode))

(eval-after-autoload-if-found
 '(describe-number describe-number-at-point) "describe-number")

(when (require 'diminish nil t)
