init.org
** モードラインのモード名を短くする

以前は自作したパッケージを使っていましたが，不具合も多く，調べると =diminish.el= という素晴らしいパッケージがあったので移行しました．これはマイナーモードの短縮表示なので，メジャーモードは個別にフックで =mode-name= を書き換えて対応します． =use-package.el= を使っていると依存関係から自動的にインストールされます．

#+BEGIN_SRC emacs-lisp :tangle no :exports no
  (require 'mode-name-abbrev nil t)
#+END_SRC

=diminish.el= を使えば，短縮名に書き換えることも，存在自体を消してしまうこともできます．helm だけ行儀が悪いので，後段での設定時に diminish を呼ぶようにしています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (require 'diminish nil t)
    (with-eval-after-load "isearch" (diminish 'isearch-mode))
    (with-eval-after-load "smooth-scroll" (diminish 'smooth-scroll-mode))
    (with-eval-after-load "whitespace" (diminish 'global-whitespace-mode))
    (with-eval-after-load "centered-cursor-mode"
      (diminish 'centered-cursor-mode))
    (with-eval-after-load "volatile-highlights"
      (diminish 'volatile-highlights-mode))
    (with-eval-after-load "aggressive-indent"
      (diminish 'aggressive-indent-mode " Ai"))
    (with-eval-after-load "emmet-mode" (diminish 'emmet-mode " e"))
    (with-eval-after-load "abbrev" (diminish 'abbrev-mode " a"))
    (with-eval-after-load "yasnippet" (diminish 'yas-minor-mode " y"))
    (with-eval-after-load "doxymacs" (diminish 'doxymacs-mode " d"))
    (with-eval-after-load "rainbow-mode" (diminish 'rainbow-mode))
    (with-eval-after-load "guide-key" (diminish 'guide-key-mode))
    (with-eval-after-load "org-autolist" (diminish 'org-autolist-mode))
  ;;;  (with-eval-after-load "helm" (diminish 'helm-mode " H"))
    )
#+END_SRC

メジャーモードは，単純に各モードの =hook= で対処します．

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'c-mode-hook '(lambda () (setq mode-name "C")))
  (add-hook 'js2-mode-hook '(lambda () (setq mode-name "JS")))
  (add-hook 'c++-mode-hook '(lambda () (setq mode-name "C++")))
  (add-hook 'csharp-mode-hook '(lambda () (setq mode-name "C#")))
  (add-hook 'prog-mode-hook '(lambda () (setq mode-name "S")))
  (add-hook 'emacs-lisp-mode-hook '(lambda () (setq mode-name "el")))
  (add-hook 'python-mode-hook '(lambda () (setq mode-name "py")))
  (add-hook 'perl-mode-hook '(lambda () (setq mode-name "pl")))
  (add-hook 'web-mode-hook '(lambda () (setq mode-name "W")))
  (add-hook 'lisp-interaction-mode-hook '(lambda () (setq mode-name "Lisp")))
#+END_SRC

** モードラインのNarrowを短くする

標準では「Narrow」と表示されますが，「N」に短縮します．

#+BEGIN_SRC emacs-lisp :tangle yes
  (defvar my:narrow-display " N")
  (setq mode-line-modes
        (mapcar
         (lambda (entry)
           (if (and (stringp entry)
                    (string= entry "%n"))
               '(:eval (if (and (= 1 (point-min))
                                (= (1+ (buffer-size)) (point-max))) ""
                         my:narrow-display)) entry))
         mode-line-modes))
#+END_SRC

** モードラインの節約（VC-mode編）

定形で表示されている =Git= を消します．

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "vc-hooks"
    (setcdr (assq 'vc-mode mode-line-format)
            '((:eval (replace-regexp-in-string "^ Git" " " vc-mode)))))  
#+END_SRC

** モードラインの色をカスタマイズする

#+BEGIN_SRC emacs-lisp :tangle yes
  (set-face-attribute 'mode-line nil :overline "#203e6f" :box nil)
  (set-face-foreground 'mode-line "#203e6f")
  (set-face-background 'mode-line "#b2cefb")
  (set-face-attribute 'mode-line-inactive nil :overline "#94bbf9" :box nil)
  (set-face-foreground 'mode-line-inactive  "#94bbf9")
  (set-face-background 'mode-line-inactive "#d8e6fd")
#+END_SRC

*** 色セット例

  - 青／白

|          | background | foreground | overline |
| active   | 558BE2     | FFFFFF     | 566f99   |
| inactive | 94bbf9     | EFEFEF     | a4bfea   |

  - 青

|          | background | foreground | overline |
| active   | b2cefb     | 203e6f     | 203e6f   |
| inactive | 94bbf9     | 94bbf9     | 94bbf9   |

  - 緑

|          | background | foreground | overline |
| active   | b1fbd6     | 206f47     | 206f47   |
| inactive | 95f9c7     | 95f9c7     | 95f9c7   |

