init.html

<div id="outline-container-orgheadline107" class="outline-2">
<h2 id="orgheadline107"><span class="section-number-2">6</span> 表示サポート</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgheadline83" class="outline-3">
<h3 id="orgheadline83"><span class="section-number-3">6.1</span> モードラインのモード名を短くする</h3>
<div class="outline-text-3" id="text-6-1">
<p>
以前は自作したパッケージを使っていましたが，不具合も多く，調べると <code>diminish.el</code> という素晴らしいパッケージがあったので移行しました．これはマイナーモードの短縮表示なので，メジャーモードは個別にフックで <code>mode-name</code> を書き換えて対応します． <code>use-package.el</code> を使っていると依存関係から自動的にインストールされます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">mode-name-abbrev</span> nil t)
</pre>
</div>

<p>
<code>diminish.el</code> を使えば，短縮名に書き換えることも，存在自体を消してしまうこともできます．helm だけ行儀が悪いので，後段での設定時に diminish を呼ぶようにしています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">diminish</span> nil t)
  (<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"isearch"</span> (diminish 'isearch-mode))
  (<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"smooth-scroll"</span> (diminish 'smooth-scroll-mode))
  (<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"whitespace"</span> (diminish 'global-whitespace-mode))
  (<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"centered-cursor-mode"</span>
    (diminish 'centered-cursor-mode))
  (<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"volatile-highlights"</span>
    (diminish 'volatile-highlights-mode))
  (<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"aggressive-indent"</span>
    (diminish 'aggressive-indent-mode <span style="color: #8b2252;">" Ai"</span>))
  (<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"emmet-mode"</span> (diminish 'emmet-mode <span style="color: #8b2252;">" e"</span>))
  (<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"abbrev"</span> (diminish 'abbrev-mode <span style="color: #8b2252;">" a"</span>))
  (<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"yasnippet"</span> (diminish 'yas-minor-mode <span style="color: #8b2252;">" y"</span>))
  (<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"doxymacs"</span> (diminish 'doxymacs-mode <span style="color: #8b2252;">" d"</span>))
  (<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"rainbow-mode"</span> (diminish 'rainbow-mode))
<span style="color: #b22222;">;;;  </span><span style="color: #b22222;">(with-eval-after-load "helm" (diminish 'helm-mode " H"))</span>
  )
</pre>
</div>

<p>
メジャーモードは，単純に各モードの <code>hook</code> で対処します．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'c-mode-hook '(<span style="color: #a020f0;">lambda</span> () (setq mode-name <span style="color: #8b2252;">"C"</span>)))
(add-hook 'c++-mode-hook '(<span style="color: #a020f0;">lambda</span> () (setq mode-name <span style="color: #8b2252;">"C++"</span>)))
(add-hook 'csharp-mode-hook '(<span style="color: #a020f0;">lambda</span> () (setq mode-name <span style="color: #8b2252;">"C#"</span>)))
(add-hook 'emacs-lisp-mode-hook '(<span style="color: #a020f0;">lambda</span> () (setq mode-name <span style="color: #8b2252;">"el"</span>)))
(add-hook 'perl-mode-hook '(<span style="color: #a020f0;">lambda</span> () (setq mode-name <span style="color: #8b2252;">"pl"</span>)))
(add-hook 'web-mode-hook '(<span style="color: #a020f0;">lambda</span> () (setq mode-name <span style="color: #8b2252;">"W"</span>)))
(add-hook 'lisp-interaction-mode-hook '(<span style="color: #a020f0;">lambda</span> () (setq mode-name <span style="color: #8b2252;">"Lisp"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline84" class="outline-3">
<h3 id="orgheadline84"><span class="section-number-3">6.2</span> モードラインのNarrowを短くする</h3>
<div class="outline-text-3" id="text-6-2">
<p>
標準では「Narrow」と表示されますが，「N」に短縮します．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">my:narrow-display</span> <span style="color: #8b2252;">" N"</span>)
(setq mode-line-modes
      (mapcar (<span style="color: #a020f0;">lambda</span> (entry)
                (<span style="color: #a020f0;">if</span> (and (stringp entry)
                         (string= entry <span style="color: #8b2252;">"%n"</span>))
                    '(<span style="color: #483d8b;">:eval</span> (<span style="color: #a020f0;">if</span> (and (= 1 (point-min))
                                     (= (1+ (buffer-size)) (point-max))) <span style="color: #8b2252;">""</span>
                              my:narrow-display)) entry))
              mode-line-modes))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline86" class="outline-3">
<h3 id="orgheadline86"><span class="section-number-3">6.3</span> モードラインの色をカスタマイズする</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-face-attribute 'mode-line nil <span style="color: #483d8b;">:overline</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #203e6f;">#203e6f</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:box</span> nil)
(set-face-foreground 'mode-line <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #203e6f;">#203e6f</span><span style="color: #8b2252;">"</span>)
(set-face-background 'mode-line <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #b2cefb;">#b2cefb</span><span style="color: #8b2252;">"</span>)
(set-face-attribute 'mode-line-inactive nil <span style="color: #483d8b;">:overline</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #94bbf9;">#94bbf9</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:box</span> nil)
(set-face-foreground 'mode-line-inactive  <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #94bbf9;">#94bbf9</span><span style="color: #8b2252;">"</span>)
(set-face-background 'mode-line-inactive <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #d8e6fd;">#d8e6fd</span><span style="color: #8b2252;">"</span>)
</pre>
</div>
</div>
