init.el
  (with-eval-after-load "isearch" (diminish 'isearch-mode))
  (with-eval-after-load "smooth-scroll" (diminish 'smooth-scroll-mode))
  (with-eval-after-load "whitespace" (diminish 'global-whitespace-mode))
  (with-eval-after-load "centered-cursor-mode"
    (diminish 'centered-cursor-mode))
  (with-eval-after-load "volatile-highlights"
    (diminish 'volatile-highlights-mode))
  (with-eval-after-load "aggressive-indent"
    (diminish 'aggressive-indent-mode " Ai"))
  (with-eval-after-load "emmet-mode" (diminish 'emmet-mode " e"))
  (with-eval-after-load "abbrev" (diminish 'abbrev-mode " a"))
  (with-eval-after-load "yasnippet" (diminish 'yas-minor-mode " y"))
  (with-eval-after-load "doxymacs" (diminish 'doxymacs-mode " d"))
  (with-eval-after-load "rainbow-mode" (diminish 'rainbow-mode))
  (with-eval-after-load "guide-key" (diminish 'guide-key-mode))
  (with-eval-after-load "org-autolist" (diminish 'org-autolist-mode))
;;;  (with-eval-after-load "helm" (diminish 'helm-mode " H"))
  )

(add-hook 'c-mode-hook '(lambda () (setq mode-name "C")))
(add-hook 'js2-mode-hook '(lambda () (setq mode-name "JS")))
(add-hook 'c++-mode-hook '(lambda () (setq mode-name "C++")))
(add-hook 'csharp-mode-hook '(lambda () (setq mode-name "C#")))
(add-hook 'prog-mode-hook '(lambda () (setq mode-name "S")))
(add-hook 'emacs-lisp-mode-hook '(lambda () (setq mode-name "el")))
(add-hook 'python-mode-hook '(lambda () (setq mode-name "py")))
(add-hook 'perl-mode-hook '(lambda () (setq mode-name "pl")))
(add-hook 'web-mode-hook '(lambda () (setq mode-name "W")))
(add-hook 'lisp-interaction-mode-hook '(lambda () (setq mode-name "Lisp")))

(defvar my:narrow-display " N")
(setq mode-line-modes
      (mapcar
       (lambda (entry)
         (if (and (stringp entry)
                  (string= entry "%n"))
             '(:eval (if (and (= 1 (point-min))
                              (= (1+ (buffer-size)) (point-max))) ""
                       my:narrow-display)) entry))
       mode-line-modes))

(with-eval-after-load "vc-hooks"
  (setcdr (assq 'vc-mode mode-line-format)
          '((:eval (replace-regexp-in-string "^ Git" " " vc-mode)))))

(set-face-attribute 'mode-line nil :overline "#203e6f" :box nil)
(set-face-foreground 'mode-line "#203e6f")
(set-face-background 'mode-line "#b2cefb")
(set-face-attribute 'mode-line-inactive nil :overline "#94bbf9" :box nil)
(set-face-foreground 'mode-line-inactive  "#94bbf9")
(set-face-background 'mode-line-inactive "#d8e6fd")
