init.org
** visible-bell のカスタマイズ

http://www.emacswiki.org/emacs/MilesBader を参考にカスタマイズしていました．現在は後継パッケージ（http://www.emacswiki.org/emacs/echo-bell.el）があり，MELPAから取れます．

visibl-bell を使うと，操作ミスで発生するビープ音を，視覚的な表示に入れ替えられます．ただ，デフォルトではバッファ中央に黒い四角が表示されて少々鬱陶しいので，ミニバッファの点滅に変更します．

#+BEGIN_SRC emacs-lisp :tangle no
  (eval-after-autoload-if-found
   '(echo-area-bell) "echo-area-bell" nil t nil
   '((setq visible-bell t)
     (setq ring-bell-function 'echo-area-bell)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
  ;; パッケージ（echo-bell）の場合
  (when (require 'echo-bell nil t)
    (echo-bell-mode 1)
    (setq echo-bell-string "")
    (setq echo-bell-background "#FFDCDC")
    (setq echo-bell-delay 0.1))
#+END_SRC

ビープ音も無しかつ視覚効果も無くすには，次のようにします．

see http://yohshiy.blog.fc2.com/blog-entry-171.html

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq visible-bell t)
  (setq ring-bell-function 'ignore)
#+END_SRC

** 常に *scratch* を表示して起動する
=session.el= や =desktop.el= を使っていても，いつも =*scratch*= バッファを表示する．そうじゃないと安心できない人向け．

#+BEGIN_SRC emacs-lisp :tangle no
  ;; Start Emacs with scratch buffer even though it call session.el/desktop.el
  (add-hook 'emacs-startup-hook '(lambda () (switch-to-buffer "*scratch*")))
#+END_SRC

もしくは，以下でもOKかも．

#+BEGIN_SRC emacs-lisp :tangle yes
(setq initial-buffer-choice t)
#+END_SRC

さらに，使われるメジャーモードと表示する文字列も制御できます．

#+BEGIN_SRC emacs-lisp :tangle no :exports yes
  (setq initial-major-mode 'text-mode)
  (setq initial-scratch-message
        (concat "                                                              "
                (format-time-string "%Y-%m-%d (%a.)") "\n"
                "-----------------------------------------------------"
                "--------------------------\n"))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports no
  (when (require 'buffer nil t)
    (setq initial-scratch-message nil)
    (setq initial-major-mode 'buffer-mode)
    (set-face-attribute 'header-line nil :overline nil :underline "#203e6f")
    (set-face-foreground 'header-line "#203e6f")
    (set-face-background 'header-line "#d8e6fd")

    (defvar my:header-clock 
      (setq header-line-format
            (concat
             "  Buffers                                                       "
             (format-time-string "%Y-%m-%d (%a.)")))))

  (global-set-key (kbd "C-M-s")
                  '(lambda () (interactive) (switch-to-buffer "*scratch*")))
#+END_SRC

** バッテリー情報をモードラインに表示する

#+BEGIN_SRC emacs-lisp :tangle no
  ;; Show battery information on the mode line.
  (display-battery-mode t)
#+END_SRC

** スクロールバーを非表示にする

スクロールバーを非表示にするには，nil を指定します．
右側に表示したい場合は，'right とします．

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Show scroll bar or not
  (set-scroll-bar-mode nil) ; 'right
#+END_SRC

** ツールバーを非表示にする

ツールバーは使わないので非表示にします．

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Disable to show the tool bar.
  (tool-bar-mode 0)
#+END_SRC

** 起動時のスプラッシュ画面を表示しない

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Disable to show the splash window at startup
  (setq inhibit-startup-screen t)
#+END_SRC

** カーソル行の行数をモードラインに表示する

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Show line number in the mode line.
  (line-number-mode t)
#+END_SRC

** カーソル行の関数名をモードラインに表示する

  - emacs24.3 で重く感じるので外している．
#+BEGIN_SRC emacs-lisp :tangle no
  ;; Show function name in the mode line.
  (which-function-mode t)
#+END_SRC

** 時刻をモードラインに表示する

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Show clock in in the mode line
  (setq display-time-format "%H:%M")
  (setq display-time-default-load-average nil)
  (display-time-mode t)
#+END_SRC

