init.html

<div id="outline-container-orgheadline85" class="outline-4">
<h4 id="orgheadline85"><span class="section-number-4">6.3.1</span> 色セット例</h4>
<div class="outline-text-4" id="text-6-3-1">
<ul class="org-ul">
<li>青／白<br  /></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">background</td>
<td class="org-left">foreground</td>
<td class="org-left">overline</td>
</tr>

<tr>
<td class="org-left">active</td>
<td class="org-left">558BE2</td>
<td class="org-left">FFFFFF</td>
<td class="org-left">566f99</td>
</tr>

<tr>
<td class="org-left">inactive</td>
<td class="org-left">94bbf9</td>
<td class="org-left">EFEFEF</td>
<td class="org-left">a4bfea</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>青<br  /></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">background</td>
<td class="org-left">foreground</td>
<td class="org-left">overline</td>
</tr>

<tr>
<td class="org-left">active</td>
<td class="org-left">b2cefb</td>
<td class="org-left">203e6f</td>
<td class="org-left">203e6f</td>
</tr>

<tr>
<td class="org-left">inactive</td>
<td class="org-left">94bbf9</td>
<td class="org-left">94bbf9</td>
<td class="org-left">94bbf9</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>緑<br  /></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">background</td>
<td class="org-left">foreground</td>
<td class="org-left">overline</td>
</tr>

<tr>
<td class="org-left">active</td>
<td class="org-left">b1fbd6</td>
<td class="org-left">206f47</td>
<td class="org-left">206f47</td>
</tr>

<tr>
<td class="org-left">inactive</td>
<td class="org-left">95f9c7</td>
<td class="org-left">95f9c7</td>
<td class="org-left">95f9c7</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgheadline87" class="outline-3">
<h3 id="orgheadline87"><span class="section-number-3">6.4</span> visible-bell のカスタマイズ</h3>
<div class="outline-text-3" id="text-6-4">
<p>
<a href="http://www.emacswiki.org/emacs/MilesBader">http://www.emacswiki.org/emacs/MilesBader</a> を参考にカスタマイズしていました．現在は後継パッケージ（<a href="http://www.emacswiki.org/emacs/echo-bell.el%EF%BC%89%E3%81%8C%E3%81%82%E3%82%8A%EF%BC%8CMELPA%E3%81%8B%E3%82%89%E5%8F%96%E3%82%8C%E3%81%BE%E3%81%99">http://www.emacswiki.org/emacs/echo-bell.el%EF%BC%89%E3%81%8C%E3%81%82%E3%82%8A%EF%BC%8CMELPA%E3%81%8B%E3%82%89%E5%8F%96%E3%82%8C%E3%81%BE%E3%81%99</a>．<br  />
</p>

<p>
visibl-bell を使うと，操作ミスで発生するビープ音を，視覚的な表示に入れ替えられます．ただ，デフォルトではバッファ中央に黒い四角が表示されて少々鬱陶しいので，ミニバッファの点滅に変更します．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(echo-area-bell) <span style="color: #8b2252;">"echo-area-bell"</span> nil t nil
 '((setq visible-bell t)
   (setq ring-bell-function 'echo-area-bell)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12497;&#12483;&#12465;&#12540;&#12472;&#65288;echo-bell&#65289;&#12398;&#22580;&#21512;</span>
(<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">echo-bell</span> nil t)
  (echo-bell-mode 1)
  (setq echo-bell-string <span style="color: #8b2252;">""</span>)
  (setq echo-bell-background <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FF7D7D;">#FF7D7D</span><span style="color: #8b2252;">"</span>)
  (setq echo-bell-delay 0.1))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline88" class="outline-3">
<h3 id="orgheadline88"><span class="section-number-3">6.5</span> 常に <b>scratch</b> を表示して起動する</h3>
<div class="outline-text-3" id="text-6-5">
<p>
<code>session.el</code> や <code>desktop.el</code> を使っていても，いつも <code>*scratch*</code> バッファを表示する．そうじゃないと安心できない人向け．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Start Emacs with scratch buffer even though it call session.el/desktop.el</span>
(add-hook 'emacs-startup-hook '(<span style="color: #a020f0;">lambda</span> () (switch-to-buffer <span style="color: #8b2252;">"*scratch*"</span>)))
</pre>
</div>

<p>
もしくは，以下でもOKかも．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq initial-buffer-choice t)
</pre>
</div>

<p>
さらに，使われるメジャーモードと表示する文字列も制御できます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq initial-major-mode 'text-mode)
(setq initial-scratch-message
      (concat <span style="color: #8b2252;">"                                                              "</span>
              (format-time-string <span style="color: #8b2252;">"%Y-%m-%d (%a.)"</span>) <span style="color: #8b2252;">"\n"</span>
              <span style="color: #8b2252;">"-----------------------------------------------------"</span>
              <span style="color: #8b2252;">"--------------------------\n"</span>))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">buffer</span> nil t)
(global-set-key (kbd <span style="color: #8b2252;">"C-M-s"</span>)
                '(<span style="color: #a020f0;">lambda</span> () (interactive) (switch-to-buffer <span style="color: #8b2252;">"*scratch*"</span>)))
(setq initial-scratch-message nil)
(setq initial-major-mode 'buffer-mode)
(set-face-attribute 'header-line nil <span style="color: #483d8b;">:overline</span> nil <span style="color: #483d8b;">:underline</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #203e6f;">#203e6f</span><span style="color: #8b2252;">"</span>)
(set-face-foreground 'header-line <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #203e6f;">#203e6f</span><span style="color: #8b2252;">"</span>)
(set-face-background 'header-line <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #d8e6fd;">#d8e6fd</span><span style="color: #8b2252;">"</span>)
(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">my:header-clock</span> 
  (setq header-line-format
        (concat
         <span style="color: #8b2252;">"  Buffers                                                       "</span>
         (format-time-string <span style="color: #8b2252;">"%Y-%m-%d (%a.)"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline89" class="outline-3">
<h3 id="orgheadline89"><span class="section-number-3">6.6</span> バッテリー情報をモードラインに表示する</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Show battery information on the mode line.</span>
(display-battery-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline90" class="outline-3">
<h3 id="orgheadline90"><span class="section-number-3">6.7</span> スクロールバーを非表示にする</h3>
<div class="outline-text-3" id="text-6-7">
<p>
スクロールバーを非表示にするには，nil を指定します．<br  />
右側に表示したい場合は，'right とします．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Show scroll bar or not</span>
(set-scroll-bar-mode nil) <span style="color: #b22222;">; </span><span style="color: #b22222;">'right</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline91" class="outline-3">
<h3 id="orgheadline91"><span class="section-number-3">6.8</span> ツールバーを非表示にする</h3>
<div class="outline-text-3" id="text-6-8">
<p>
ツールバーは使わないので非表示にします．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Disable to show the tool bar.</span>
(tool-bar-mode 0)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline92" class="outline-3">
<h3 id="orgheadline92"><span class="section-number-3">6.9</span> 起動時のスプラッシュ画面を表示しない</h3>
<div class="outline-text-3" id="text-6-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Disable to show the splash window at startup</span>
(setq inhibit-startup-screen t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline93" class="outline-3">
<h3 id="orgheadline93"><span class="section-number-3">6.10</span> カーソル行の行数をモードラインに表示する</h3>
<div class="outline-text-3" id="text-6-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Show line number in the mode line.</span>
(line-number-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline94" class="outline-3">
<h3 id="orgheadline94"><span class="section-number-3">6.11</span> カーソル行の関数名をモードラインに表示する</h3>
<div class="outline-text-3" id="text-6-11">
<ul class="org-ul">
<li>emacs24.3 で重く感じるので外している．<br  /></li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Show function name in the mode line.</span>
(which-function-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline95" class="outline-3">
<h3 id="orgheadline95"><span class="section-number-3">6.12</span> 時刻をモードラインに表示する</h3>
<div class="outline-text-3" id="text-6-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Show clock in in the mode line</span>
(setq display-time-format <span style="color: #8b2252;">"%H:%M"</span>)
(setq display-time-default-load-average nil)
(display-time-mode t)
</pre>
</div>
</div>
</div>
