init.el

(setq visible-bell t)
(setq ring-bell-function 'ignore)

(setq initial-buffer-choice t)

(when (require 'buffer nil t)
  (setq initial-scratch-message nil)
  (setq initial-major-mode 'buffer-mode)
  (set-face-attribute 'header-line nil :overline nil :underline "#203e6f")
  (set-face-foreground 'header-line "#203e6f")
  (set-face-background 'header-line "#d8e6fd")

  (defvar my:header-clock 
    (setq header-line-format
          (concat
           "  Buffers                                                       "
           (format-time-string "%Y-%m-%d (%a.)")))))

(global-set-key (kbd "C-M-s")
                '(lambda () (interactive) (switch-to-buffer "*scratch*")))

;; Show scroll bar or not
(set-scroll-bar-mode nil) ; 'right

;; Disable to show the tool bar.
(tool-bar-mode 0)

;; Disable to show the splash window at startup
(setq inhibit-startup-screen t)

;; Show line number in the mode line.
(line-number-mode t)

;; Show clock in in the mode line
(setq display-time-format "%H:%M")
(setq display-time-default-load-average nil)
(display-time-mode t)

(when (eval-after-autoload-if-found
