init.org
** 対応するカッコをハイライトする

Built-in の paren.el が利用できる．拡張版として [[http://www.emacswiki.org/emacs/mic-paren.el][mic-paren.el]] があり，現在はこれを利用している．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(paren-activate) "mic-paren" nil t nil
         '((setq paren-sexp-mode nil)
           (set-face-foreground 'paren-face-match "#FFFFFF")
           ;; Deep blue: #6666CC, orange: #FFCC66
           (set-face-background 'paren-face-match "66CC66")))

    (paren-activate))
#+END_SRC

paren.el の場合は以下の設定．

#+BEGIN_SRC emacs-lisp :tangle no
  (setq show-paren-delay 0)
  (show-paren-mode t)
  ;; (setq show-paren-style 'expression) ; カッコ内も強調
                                          ;(set-face-background 'show-paren-match-face "#5DA4ff") ; カーソルより濃い青
  (set-face-background 'show-paren-match-face "#a634ff")
  (set-face-foreground 'show-paren-match-face "#FFFFFF")
  (set-face-underline-p 'show-paren-match-face nil)
  (setq show-paren-style 'parenthesis)
#+END_SRC 

** 全角スペースと行末タブ／半角スペースを強調表示する

[[http://ubulog.blogspot.jp/2007/09/emacs_09.html]]

英語で原稿を書く時に全角スペースが入っているを苦労するので，強調表示して編集中でも気づくようにします．また，行末のタブや半角スペースも無駄なので，入り込まないように強調しています．

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; スペース
  (defface my:face-b-1
    '((t (:background "gray" :bold t :underline "red")))
    nil :group 'font-lock-highlighting-faces)
  ;; タブだけの行
  (defface my:face-b-2
    '((t (:background "orange" :bold t :underline "red")))
    nil :group 'font-lock-highlighting-faces)
  ;; 半角スペース
  (defface my:face-b-3 '((t (:background "orange")))
    nil :group 'font-lock-highlighting-faces)

  (defvar my:face-b-1 'my:face-b-1)
  (defvar my:face-b-2 'my:face-b-2)
  (defvar my:face-b-3 'my:face-b-3)
  (defadvice font-lock-mode (before my:font-lock-mode ())
    (font-lock-add-keywords
     major-mode
     ;; "[\t]+$" 行末のタブ
     '(("　" 0 my:face-b-1 append)
       ;;       ("[ ]+$" 0 my:face-b-3 append)
       ("[\t]+$" 0 my:face-b-2 append))))
  (ad-enable-advice 'font-lock-mode 'before 'my:font-lock-mode)
  (ad-activate 'font-lock-mode)
#+END_SRC

** [migemo.el] ローマ字入力で日本語を検索する

http://0xcc.net/migemo/#download

以下は，[[http://www.kaoriya.net/software/cmigemo][cmigemo]] を使う設定です．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when
      (eval-after-autoload-if-found
       '(migemo-init) "migemo" nil t nil
       '((setq completion-ignore-case t) ;; case-independent
         (setq migemo-command "cmigemo")
         (setq migemo-options '("-q" "--emacs" "-i" "\a"))
         (setq migemo-dictionary "/usr/local/share/migemo/utf-8/migemo-dict")
         (setq migemo-user-dictionary nil)
         (setq migemo-regex-dictionary nil)
         (setq migemo-use-pattern-alist t)
         (setq migemo-use-frequent-pattern-alist t)
         (setq migemo-pattern-alist-length 1024)
         (setq migemo-coding-system 'utf-8-unix)))

    (when (executable-find "cmigemo")
      (add-hook 'isearch-mode-hook 'migemo-init)))
#+END_SRC

