init.html

<div id="outline-container-orgheadline96" class="outline-3">
<h3 id="orgheadline96"><span class="section-number-3">6.13</span> 対応するカッコをハイライトする</h3>
<div class="outline-text-3" id="text-6-13">
<p>
Built-in の paren.el が利用できる．拡張版として <a href="http://www.emacswiki.org/emacs/mic-paren.el">mic-paren.el</a> があり，現在はこれを利用している．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(paren-activate) <span style="color: #8b2252;">"mic-paren"</span> nil t nil
       '((setq paren-sexp-mode nil)
         (set-face-foreground 'paren-face-match <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #8b2252;">"</span>)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">Deep </span><span style="color: #ffffff; background-color: #0000ff;">blue</span><span style="color: #b22222;">: </span><span style="color: #ffffff; background-color: #6666CC;">#6666CC</span><span style="color: #b22222;">, </span><span style="color: #000000; background-color: #ffa500;">orange</span><span style="color: #b22222;">: </span><span style="color: #000000; background-color: #FFCC66;">#FFCC66</span>
         (set-face-background 'paren-face-match <span style="color: #8b2252;">"66CC66"</span>)))

  (paren-activate))
</pre>
</div>

<p>
paren.el の場合は以下の設定．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq show-paren-delay 0)
(show-paren-mode t)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq show-paren-style 'expression) ; &#12459;&#12483;&#12467;&#20869;&#12418;&#24375;&#35519;</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">(set-face-background 'show-paren-match-face "</span><span style="color: #000000; background-color: #5DA4ff;">#5DA4ff</span><span style="color: #b22222;">") ; &#12459;&#12540;&#12477;&#12523;&#12424;&#12426;&#28611;&#12356;&#38738;</span>
(set-face-background 'show-paren-match-face <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #a634ff;">#a634ff</span><span style="color: #8b2252;">"</span>)
(set-face-foreground 'show-paren-match-face <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #8b2252;">"</span>)
(set-face-underline-p 'show-paren-match-face nil)
(setq show-paren-style 'parenthesis)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline97" class="outline-3">
<h3 id="orgheadline97"><span class="section-number-3">6.14</span> 全角スペースと行末タブ／半角スペースを強調表示する</h3>
<div class="outline-text-3" id="text-6-14">
<p>
<a href="http://ubulog.blogspot.jp/2007/09/emacs_09.html">http://ubulog.blogspot.jp/2007/09/emacs_09.html</a><br  />
</p>

<p>
英語で原稿を書く時に全角スペースが入っているを苦労するので，強調表示して編集中でも気づくようにします．また，行末のタブや半角スペースも無駄なので，入り込まないように強調しています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12473;&#12506;&#12540;&#12473;</span>
(<span style="color: #a020f0;">defface</span> <span style="color: #a0522d;">my:face-b-1</span> '((t (<span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #bebebe;">gray</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:bold</span> t <span style="color: #483d8b;">:underline</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #ff0000;">red</span><span style="color: #8b2252;">"</span>))) nil <span style="color: #483d8b;">:group</span> 'font-lock-highlighting-faces)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12479;&#12502;&#12384;&#12369;&#12398;&#34892;</span>
(<span style="color: #a020f0;">defface</span> <span style="color: #a0522d;">my:face-b-2</span> '((t (<span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #ffa500;">orange</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:bold</span> t <span style="color: #483d8b;">:underline</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #ff0000;">red</span><span style="color: #8b2252;">"</span>))) nil <span style="color: #483d8b;">:group</span> 'font-lock-highlighting-faces)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#21322;&#35282;&#12473;&#12506;&#12540;&#12473;</span>
(<span style="color: #a020f0;">defface</span> <span style="color: #a0522d;">my:face-b-3</span> '((t (<span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #ffa500;">orange</span><span style="color: #8b2252;">"</span>))) nil <span style="color: #483d8b;">:group</span> 'font-lock-highlighting-faces)
(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">my:face-b-1</span> 'my:face-b-1)
(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">my:face-b-2</span> 'my:face-b-2)
(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">my:face-b-3</span> 'my:face-b-3)
(<span style="color: #a020f0;">defadvice</span> <span style="color: #0000ff;">font-lock-mode</span> (before my:font-lock-mode ())
  (font-lock-add-keywords
   major-mode
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">"[\t]+$" &#34892;&#26411;&#12398;&#12479;&#12502;</span>
   '((<span style="color: #8b2252;">"</span><span style="color: #8b2252; background-color: #bebebe; font-weight: bold; text-decoration: underline;">&#12288;</span><span style="color: #8b2252;">"</span> 0 my:face-b-1 append)
     <span style="color: #b22222;">;;       </span><span style="color: #b22222;">("[ ]+$" 0 my:face-b-3 append)</span>
     (<span style="color: #8b2252;">"[\t]+$"</span> 0 my:face-b-2 append))))
(ad-enable-advice 'font-lock-mode 'before 'my:font-lock-mode)
(ad-activate 'font-lock-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline98" class="outline-3">
<h3 id="orgheadline98"><span class="section-number-3">6.15</span> [migemo.el] ローマ字入力で日本語を検索する</h3>
<div class="outline-text-3" id="text-6-15">
<p>
<a href="http://0xcc.net/migemo/#download">http://0xcc.net/migemo/#download</a><br  />
</p>

<p>
以下は，<a href="http://www.kaoriya.net/software/cmigemo">cmigemo</a> を使う設定です．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span>
    (eval-after-autoload-if-found
     '(migemo-init) <span style="color: #8b2252;">"migemo"</span> nil t nil
     '((setq completion-ignore-case t) <span style="color: #b22222;">;; </span><span style="color: #b22222;">case-independent</span>
       (setq migemo-command <span style="color: #8b2252;">"cmigemo"</span>)
       (setq migemo-options '(<span style="color: #8b2252;">"-q"</span> <span style="color: #8b2252;">"--emacs"</span> <span style="color: #8b2252;">"-i"</span> <span style="color: #8b2252;">"\a"</span>))
       (setq migemo-dictionary <span style="color: #8b2252;">"/usr/local/share/migemo/utf-8/migemo-dict"</span>)
       (setq migemo-user-dictionary nil)
       (setq migemo-regex-dictionary nil)
       (setq migemo-use-pattern-alist t)
       (setq migemo-use-frequent-pattern-alist t)
       (setq migemo-pattern-alist-length 1024)
       (setq migemo-coding-system 'utf-8-unix)))

  (<span style="color: #a020f0;">when</span> (executable-find <span style="color: #8b2252;">"cmigemo"</span>)
    (add-hook 'isearch-mode-hook 'migemo-init)))
</pre>
</div>
</div>
</div>
