init.el
       '(paren-activate) "mic-paren" nil t nil
       '((setq paren-sexp-mode nil)
         (set-face-foreground 'paren-face-match "#FFFFFF")
         ;; Deep blue: #6666CC, orange: #FFCC66
         (set-face-background 'paren-face-match "66CC66")))

  (paren-activate))

;; スペース
(defface my:face-b-1
  '((t (:background "gray" :bold t :underline "red")))
  nil :group 'font-lock-highlighting-faces)
;; タブだけの行
(defface my:face-b-2
  '((t (:background "orange" :bold t :underline "red")))
  nil :group 'font-lock-highlighting-faces)
;; 半角スペース
(defface my:face-b-3 '((t (:background "orange")))
  nil :group 'font-lock-highlighting-faces)

(defvar my:face-b-1 'my:face-b-1)
(defvar my:face-b-2 'my:face-b-2)
(defvar my:face-b-3 'my:face-b-3)
(defadvice font-lock-mode (before my:font-lock-mode ())
  (font-lock-add-keywords
   major-mode
   ;; "[\t]+$" 行末のタブ
   '(("　" 0 my:face-b-1 append)
     ;;       ("[ ]+$" 0 my:face-b-3 append)
     ("[\t]+$" 0 my:face-b-2 append))))
(ad-enable-advice 'font-lock-mode 'before 'my:font-lock-mode)
(ad-activate 'font-lock-mode)

(when
    (eval-after-autoload-if-found
     '(migemo-init) "migemo" nil t nil
     '((setq completion-ignore-case t) ;; case-independent
       (setq migemo-command "cmigemo")
       (setq migemo-options '("-q" "--emacs" "-i" "\a"))
       (setq migemo-dictionary "/usr/local/share/migemo/utf-8/migemo-dict")
       (setq migemo-user-dictionary nil)
       (setq migemo-regex-dictionary nil)
       (setq migemo-use-pattern-alist t)
       (setq migemo-use-frequent-pattern-alist t)
       (setq migemo-pattern-alist-length 1024)
       (setq migemo-coding-system 'utf-8-unix)))

  (when (executable-find "cmigemo")
    (add-hook 'isearch-mode-hook 'migemo-init)))

(eval-after-autoload-if-found
 '(helm-M-x helm-locate helm-recentf helm-buffers-list
            helm-occur helm-swoop helm-flycheck)
