init.org
** [anything.el] 何でも絞り込みインターフェイス（旧）

  - helm に移行しました．

http://svn.coderepos.org/share/lang/elisp/anything-c-moccur/trunk/anything-c-moccur.el
http://d.hatena.ne.jp/IMAKADO/20080724/1216882563

#+BEGIN_SRC emacs-lisp :tangle no :exports yes
  (when (eval-after-autoload-if-found
         '(anything-other-buffer anything-complete anything-M-x
                                 anything-c-moccur-occur-by-moccur)
         "anything-startup" nil t nil
         '((require 'anything-c-moccur nil t)
           ;;  (setq moccur-split-word t)
           ;;  (setq anything-c-locate-options `("locate" "-w"))

           ;; M-x install-elisp-from-emacswiki recentf-ext.el
           ;; http://www.emacswiki.org/cgi-bin/wiki/download/recentf-ext.el
           ;;  (autoload-if-found 'recentf-ext "recentf-ext" nil t)
           ;;              (require 'recentf-ext nil t)

           (when (require 'migemo nil t)
             (setq moccur-use-migemo t))
           ;; M-x anything-grep-by-name
           (setq anything-grep-alist
                 '(("Org-files" ("egrep -Hin %s *.org" "~/Dropbox/org/"))
                   (".emacs.d" ("egrep -Hin %s *.el" "~/.emacs.d/"))
                   ("ChangeLog" ("egrep -Hin %s ChangeLog" "~/"))))))
    ;; ("Spotlight" ("mdfind %s -onlyin ~/Dropbox/Documents/Library/" ""))))

    (defun my:anything ()
      (interactive)
      (anything-other-buffer
       '(anything-c-source-recentf
         anything-c-source-file-name-history
         anything-c-source-buffers
         anything-c-source-emacs-commands
         anything-c-source-locate)
       " *my:anything*"))

    (defun my:anything-buffer ()
      (interactive)
      (anything-other-buffer
       '(anything-c-source-buffers)
       " *my:anthing-buffer*"))

    (when (eq window-system 'ns)
      (defun my:anything-spotlight ()
        "Spotlight search with anything.el"
        (interactive)
        (anything-other-buffer
         '(anything-c-source-mac-spotlight)
         " *anything-spotlight*")))

    (setq anything-candidate-number-limit 50) ; 50
    (setq anything-input-idle-delay 0.1)      ; 0.1
    (setq anything-idle-delay 0.5)            ; 0.5
    (setq anything-quick-update nil))        ; nil
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no :exports no
  (when (autoload-if-found
         '(anything-other-buffer anything-complete
                                 anything-M-x anything-c-moccur-occur-by-moccur)
         "anything-startup" nil t)

    (defun my:anything ()
      (interactive)
      (anything-other-buffer
       '(anything-c-source-recentf
         anything-c-source-file-name-history
         anything-c-source-buffers
         anything-c-source-emacs-commands
         anything-c-source-locate)
       " *my:anything*"))

    (defun my:anything-buffer ()
      (interactive)
      (anything-other-buffer
       '(anything-c-source-buffers)
       " *my:anthing-buffer*"))

    (when (eq window-system 'ns)
      (defun my:anything-spotlight ()
        "Spotlight search with anything.el"
        (interactive)
        (anything-other-buffer
         '(anything-c-source-mac-spotlight)
         " *anything-spotlight*")))

    (eval-after-load "anything-startup"
      '(progn

         (require 'anything-c-moccur nil t)
         ;;  (setq moccur-split-word t)
         ;;  (setq anything-c-locate-options `("locate" "-w"))

         ;; M-x install-elisp-from-emacswiki recentf-ext.el
         ;; http://www.emacswiki.org/cgi-bin/wiki/download/recentf-ext.el
         ;;  (autoload-if-found 'recentf-ext "recentf-ext" nil t)
         ;;            (require 'recentf-ext nil t)

         (when (require 'migemo nil t)
           (setq moccur-use-migemo t))

         ;; M-x anything-grep-by-name
         (setq anything-grep-alist
               '(("Org-files" ("egrep -Hin %s *.org" "~/Dropbox/org/"))
                 (".emacs.d" ("egrep -Hin %s *.el" "~/.emacs.d/"))
                 ("ChangeLog" ("egrep -Hin %s ChangeLog" "~/"))))
         ;; ("Spotlight" ("mdfind %s -onlyin ~/Dropbox/Documents/Library/" ""))))

         (setq anything-candidate-number-limit 50) ; 50
         (setq anything-input-idle-delay 0.1)      ; 0.1
         (setq anything-idle-delay 0.5)            ; 0.5
         (setq anything-quick-update nil))))       ; nil
#+END_SRC

*** キーバインド

普通に anything-startup を呼んでいる場合には，anything-M-xを設定する必要はない．

#+BEGIN_SRC emacs-lisp :tangle no
  ;; Show ibuffer powered by anything
  ;;  (with-eval-after-load "anything-startup"
  (global-set-key (kbd "M-x") 'anything-M-x)
  (global-set-key (kbd "C-c o") 'anything-c-moccur-occur-by-moccur)
  (global-set-key (kbd "C-M-r") 'my:anything)
  (global-set-key (kbd "C-M-s") 'my:anything-spotlight)
  (global-set-key (kbd "C-x C-b") 'my:anything-buffer)
  ;;)
#+END_SRC

