init.html

<div id="outline-container-orgheadline100" class="outline-3">
<h3 id="orgheadline100"><span class="section-number-3">6.16</span> [anything.el] 何でも絞り込みインターフェイス</h3>
<div class="outline-text-3" id="text-6-16">
<p>
<a href="http://svn.coderepos.org/share/lang/elisp/anything-c-moccur/trunk/anything-c-moccur.el">http://svn.coderepos.org/share/lang/elisp/anything-c-moccur/trunk/anything-c-moccur.el</a><br  />
<a href="http://d.hatena.ne.jp/IMAKADO/20080724/1216882563">http://d.hatena.ne.jp/IMAKADO/20080724/1216882563</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">     (<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
            '(anything-other-buffer anything-complete anything-M-x
                                    anything-c-moccur-occur-by-moccur)
            <span style="color: #8b2252;">"anything-startup"</span> nil t nil
            '((<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">anything-c-moccur</span> nil t)
              <span style="color: #b22222;">;;  </span><span style="color: #b22222;">(setq moccur-split-word t)</span>
              <span style="color: #b22222;">;;  </span><span style="color: #b22222;">(setq anything-c-locate-options `("locate" "-w"))</span>

              <span style="color: #b22222;">;; </span><span style="color: #b22222;">M-x install-elisp-from-emacswiki recentf-ext.el</span>
              <span style="color: #b22222;">;; </span><span style="color: #b22222;">http://www.emacswiki.org/cgi-bin/wiki/download/recentf-ext.el</span>
              <span style="color: #b22222;">;;  </span><span style="color: #b22222;">(autoload-if-found 'recentf-ext "recentf-ext" nil t)</span>
<span style="color: #b22222;">;;              </span><span style="color: #b22222;">(require 'recentf-ext nil t)</span>

              (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">migemo</span> nil t)
                (setq moccur-use-migemo t))
              <span style="color: #b22222;">;; </span><span style="color: #b22222;">M-x anything-grep-by-name</span>
              (setq anything-grep-alist
                    '((<span style="color: #8b2252;">"Org-files"</span> (<span style="color: #8b2252;">"egrep -Hin %s *.org"</span> <span style="color: #8b2252;">"~/Dropbox/org/"</span>))
                      (<span style="color: #8b2252;">".emacs.d"</span> (<span style="color: #8b2252;">"egrep -Hin %s *.el"</span> <span style="color: #8b2252;">"~/.emacs.d/"</span>))
                      (<span style="color: #8b2252;">"ChangeLog"</span> (<span style="color: #8b2252;">"egrep -Hin %s ChangeLog"</span> <span style="color: #8b2252;">"~/"</span>))))))
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">("Spotlight" ("mdfind %s -onlyin ~/Dropbox/Documents/Library/" ""))))</span>

       (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:anything</span> ()
         (interactive)
         (anything-other-buffer
          '(anything-c-source-recentf
            anything-c-source-file-name-history
            anything-c-source-buffers
            anything-c-source-emacs-commands
            anything-c-source-locate)
          <span style="color: #8b2252;">" *my:anything*"</span>))

       (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:anything-buffer</span> ()
         (interactive)
         (anything-other-buffer
          '(anything-c-source-buffers)
          <span style="color: #8b2252;">" *my:anthing-buffer*"</span>))
  
       (<span style="color: #a020f0;">when</span> (eq window-system 'ns)
         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:anything-spotlight</span> ()
           <span style="color: #8b2252;">"Spotlight search with anything.el"</span>
           (interactive)
           (anything-other-buffer
            '(anything-c-source-mac-spotlight)
            <span style="color: #8b2252;">" *anything-spotlight*"</span>)))

       (setq anything-candidate-number-limit 50) <span style="color: #b22222;">; </span><span style="color: #b22222;">50</span>
       (setq anything-input-idle-delay 0.1)      <span style="color: #b22222;">; </span><span style="color: #b22222;">0.1</span>
       (setq anything-idle-delay 0.5)            <span style="color: #b22222;">; </span><span style="color: #b22222;">0.5</span>
       (setq anything-quick-update nil))        <span style="color: #b22222;">; </span><span style="color: #b22222;">nil</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">     (<span style="color: #a020f0;">when</span> (autoload-if-found
            '(anything-other-buffer anything-complete
                                    anything-M-x anything-c-moccur-occur-by-moccur)
            <span style="color: #8b2252;">"anything-startup"</span> nil t)

       (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:anything</span> ()
         (interactive)
         (anything-other-buffer
          '(anything-c-source-recentf
            anything-c-source-file-name-history
            anything-c-source-buffers
            anything-c-source-emacs-commands
            anything-c-source-locate)
          <span style="color: #8b2252;">" *my:anything*"</span>))

       (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:anything-buffer</span> ()
         (interactive)
         (anything-other-buffer
          '(anything-c-source-buffers)
          <span style="color: #8b2252;">" *my:anthing-buffer*"</span>))

       (<span style="color: #a020f0;">when</span> (eq window-system 'ns)
         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:anything-spotlight</span> ()
           <span style="color: #8b2252;">"Spotlight search with anything.el"</span>
           (interactive)
           (anything-other-buffer
            '(anything-c-source-mac-spotlight)
            <span style="color: #8b2252;">" *anything-spotlight*"</span>)))

       (eval-after-load <span style="color: #8b2252;">"anything-startup"</span>
         '(<span style="color: #a020f0;">progn</span>

            (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">anything-c-moccur</span> nil t)
            <span style="color: #b22222;">;;  </span><span style="color: #b22222;">(setq moccur-split-word t)</span>
            <span style="color: #b22222;">;;  </span><span style="color: #b22222;">(setq anything-c-locate-options `("locate" "-w"))</span>

            <span style="color: #b22222;">;; </span><span style="color: #b22222;">M-x install-elisp-from-emacswiki recentf-ext.el</span>
            <span style="color: #b22222;">;; </span><span style="color: #b22222;">http://www.emacswiki.org/cgi-bin/wiki/download/recentf-ext.el</span>
            <span style="color: #b22222;">;;  </span><span style="color: #b22222;">(autoload-if-found 'recentf-ext "recentf-ext" nil t)</span>
<span style="color: #b22222;">;;            </span><span style="color: #b22222;">(require 'recentf-ext nil t)</span>

            (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">migemo</span> nil t)
              (setq moccur-use-migemo t))

            <span style="color: #b22222;">;; </span><span style="color: #b22222;">M-x anything-grep-by-name</span>
            (setq anything-grep-alist
                  '((<span style="color: #8b2252;">"Org-files"</span> (<span style="color: #8b2252;">"egrep -Hin %s *.org"</span> <span style="color: #8b2252;">"~/Dropbox/org/"</span>))
                    (<span style="color: #8b2252;">".emacs.d"</span> (<span style="color: #8b2252;">"egrep -Hin %s *.el"</span> <span style="color: #8b2252;">"~/.emacs.d/"</span>))
                    (<span style="color: #8b2252;">"ChangeLog"</span> (<span style="color: #8b2252;">"egrep -Hin %s ChangeLog"</span> <span style="color: #8b2252;">"~/"</span>))))
            <span style="color: #b22222;">;; </span><span style="color: #b22222;">("Spotlight" ("mdfind %s -onlyin ~/Dropbox/Documents/Library/" ""))))</span>

            (setq anything-candidate-number-limit 50) <span style="color: #b22222;">; </span><span style="color: #b22222;">50</span>
            (setq anything-input-idle-delay 0.1)      <span style="color: #b22222;">; </span><span style="color: #b22222;">0.1</span>
            (setq anything-idle-delay 0.5)            <span style="color: #b22222;">; </span><span style="color: #b22222;">0.5</span>
            (setq anything-quick-update nil))))       <span style="color: #b22222;">; </span><span style="color: #b22222;">nil</span>
</pre>
</div>
</div>

<div id="outline-container-orgheadline99" class="outline-4">
<h4 id="orgheadline99"><span class="section-number-4">6.16.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-6-16-1">
<p>
普通に anything-startup を呼んでいる場合には，anything-M-xを設定する必要はない．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Show ibuffer powered by anything</span>
<span style="color: #b22222;">;;  </span><span style="color: #b22222;">(with-eval-after-load "anything-startup"</span>
(global-set-key (kbd <span style="color: #8b2252;">"M-x"</span>) 'anything-M-x)
(global-set-key (kbd <span style="color: #8b2252;">"C-c o"</span>) 'anything-c-moccur-occur-by-moccur)
(global-set-key (kbd <span style="color: #8b2252;">"C-M-r"</span>) 'my:anything)
(global-set-key (kbd <span style="color: #8b2252;">"C-M-s"</span>) 'my:anything-spotlight)
(global-set-key (kbd <span style="color: #8b2252;">"C-x C-b"</span>) 'my:anything-buffer)
<span style="color: #b22222;">;;</span><span style="color: #b22222;">)</span>
</pre>
</div>
</div>
</div>
</div>
