init.org
** [helm.el] 続・何でも絞り込みインターフェイス

#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-autoload-if-found
   '(helm-M-x helm-locate helm-recentf helm-buffers-list
              helm-occur helm-swoop helm-flycheck)
   "helm-config" nil t nil
   '((helm-mode 1)
     (when (require 'diminish nil t)
       (diminish 'helm-mode " H"))
     (when (require 'helm-swoop nil t)
       (set-face-attribute
        'helm-swoop-target-line-face nil :background "#FFEDDC")
       (set-face-attribute
        'helm-swoop-target-word-face nil :background "#FF5443"))
     (when (require 'helm-google nil t)
       (setq helm-google-tld "co.jp"))
     ;;        (require 'recentf-ext nil t)
     ;; helm-find-files を呼ばせない
     (add-to-list 'helm-completing-read-handlers-alist '(find-file . nil))
     ;; helm-mode-ag を呼ばせない
     (add-to-list 'helm-completing-read-handlers-alist '(ag . nil))
     ;; helm-mode-org-set-tags を呼ばせない
     (add-to-list 'helm-completing-read-handlers-alist '(org-set-tags . nil))
     (setq helm-display-source-at-screen-top nil)
              ;;;         (setq helm-display-header-line nil)
     ;; helm-autoresize-mode を有効にしつつ 30% に固定
     (helm-autoresize-mode 1)
     (setq helm-autoresize-max-height 30)
     (setq helm-autoresize-min-height 30)         
     (set-face-attribute 'helm-source-header nil
                         :height 1.0 :family "Verdana" :weight 'normal
                         :foreground "#666666" :background "#DADADA")
     (when (eq window-system 'ns)
       (setq helm-locate-command "mdfind -name %s %s")
       )

     ;; この修正が必要
     (when (require 'helm-migemo nil t)
       (defun helm-compile-source--candidates-in-buffer (source)
         (helm-aif (assoc 'candidates-in-buffer source)
             (append source
                     `((candidates
                        . ,(or (cdr it)
                               (lambda ()
                                 ;; Do not use `source' because other plugins
                                 ;; (such as helm-migemo) may change it
                                 (helm-candidates-in-buffer
                                  (helm-get-current-source)))))
                       (volatile) (match identity)))
           source)))
     ))
#+END_SRC

*** キーバインド

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(helm-M-x helm-locate helm-recentf helm-buffers-list
                    helm-occur helm-swoop helm-flycheck)
         "helm-config")

    (global-set-key (kbd "C-c f f") 'helm-locate)
    (global-set-key (kbd "C-x C-b") 'helm-buffers-list)
    (global-set-key (kbd "M-s") 'helm-swoop)
    (global-set-key (kbd "C-M-r") 'helm-recentf)
    (global-set-key (kbd "C-c o") 'helm-occur)
    (global-set-key (kbd "M-x") 'helm-M-x))

#+END_SRC

** [stripe-buffer.el] テーブルの色をストライプにする

[[https://github.com/sabof/stripe-buffer/blob/master/stripe-buffer.el][stripe-buffer.el]]を使います．重くツリーが多いOrgバッファだと激重になる可能性があります．

#+BEGIN_SRC emacs-lisp :tangle no
  (when (eval-after-autoload-if-found
         'org-mode "org" "Org Mode" t nil
         '((require 'stripe-buffer nil t)))
    (add-hook 'org-mode-hook 'turn-on-stripe-table-mode))
#+END_SRC

** [rainbow-delimiters] 対応するカッコに色を付ける

複数のカッコが重なる言語では，カッコの対応関係がひと目で理解し難い場合があります． =rainbow-delimiters= を使うと，対応するカッコを七色に色付けして見やすくできます．デフォルトだと色がパステル調で薄いので，パラメータを追加して調整します．

=org-block= 内でうまく動かないようなので，本格導入は様子見中です．

#+BEGIN_SRC emacs-lisp :tangle no
  (with-eval-after-load "rainbow-delimiters"
    ;; https://yoo2080.wordpress.com/2013/12/21/small-rainbow-delimiters-tutorial/
    (require 'cl-lib)
    (require 'color)
    (cl-loop
     for index from 1 to rainbow-delimiters-max-face-count
     do
     (let ((face (intern (format "rainbow-delimiters-depth-%d-face" index))))
       (cl-callf color-saturate-name (face-foreground face) 50))))

  (add-hook 'prog-mode-hook
            '(lambda ()
               (unless (equal (buffer-name) "*scratch*")
                 (rainbow-delimiters-mode))))
#+END_SRC

