init.html

<div id="outline-container-orgheadline102" class="outline-3">
<h3 id="orgheadline102"><span class="section-number-3">6.17</span> [helm.el] 続・何でも絞り込みインターフェイス</h3>
<div class="outline-text-3" id="text-6-17">
<div class="org-src-container">

<pre class="src src-emacs-lisp">     (eval-after-autoload-if-found
      '(helm-M-x helm-locate helm-recentf helm-buffers-list helm-occur helm-swoop)
      <span style="color: #8b2252;">"helm-config"</span> nil t nil
      '((helm-mode 1)
        (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">diminish</span> nil t)
          (diminish 'helm-mode <span style="color: #8b2252;">" H"</span>))
        (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">helm-swoop</span> nil t)
          (set-face-attribute
           'helm-swoop-target-line-face nil <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFEDDC;">#FFEDDC</span><span style="color: #8b2252;">"</span>)
          (set-face-attribute
           'helm-swoop-target-word-face nil <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF5443;">#FF5443</span><span style="color: #8b2252;">"</span>))
        (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">helm-google</span> nil t)
          (setq helm-google-tld <span style="color: #8b2252;">"co.jp"</span>))
<span style="color: #b22222;">;;        </span><span style="color: #b22222;">(require 'recentf-ext nil t)</span>
        <span style="color: #b22222;">;; </span><span style="color: #b22222;">helm-find-files &#12434;&#21628;&#12400;&#12379;&#12394;&#12356;</span>
        (add-to-list 'helm-completing-read-handlers-alist '(find-file . nil))
        <span style="color: #b22222;">;; </span><span style="color: #b22222;">helm-mode-ag &#12434;&#21628;&#12400;&#12379;&#12394;&#12356;</span>
        (add-to-list 'helm-completing-read-handlers-alist '(ag . nil))
        <span style="color: #b22222;">;; </span><span style="color: #b22222;">helm-mode-org-set-tags &#12434;&#21628;&#12400;&#12379;&#12394;&#12356;</span>
        (add-to-list 'helm-completing-read-handlers-alist '(org-set-tags . nil))
        (setq helm-display-source-at-screen-top nil)
            <span style="color: #b22222;">;;;         </span><span style="color: #b22222;">(setq helm-display-header-line nil)</span>
        <span style="color: #b22222;">;; </span><span style="color: #b22222;">helm-autoresize-mode &#12434;&#26377;&#21177;&#12395;&#12375;&#12388;&#12388; 30% &#12395;&#22266;&#23450;</span>
        (helm-autoresize-mode 1)
        (setq helm-autoresize-max-height 30)
        (setq helm-autoresize-min-height 30)         
        (set-face-attribute 'helm-source-header nil
                            <span style="color: #483d8b;">:height</span> 1.0 <span style="color: #483d8b;">:family</span> <span style="color: #8b2252;">"Verdana"</span> <span style="color: #483d8b;">:weight</span> 'normal
                            <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #666666;">#666666</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #DADADA;">#DADADA</span><span style="color: #8b2252;">"</span>)
        (<span style="color: #a020f0;">when</span> (eq window-system 'ns)
          (setq helm-locate-command <span style="color: #8b2252;">"mdfind -name %s %s"</span>)
          )

        <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12371;&#12398;&#20462;&#27491;&#12364;&#24517;&#35201;</span>
        (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">helm-migemo</span> nil t)
          (eval-after-load <span style="color: #8b2252;">"helm-migemo"</span>
            '(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">helm-compile-source--candidates-in-buffer</span> (source)
               (<span style="color: #a020f0;">helm-aif</span> (assoc 'candidates-in-buffer source)
                   (append source
                           `((candidates
                              . ,(or (cdr it)
                                     (<span style="color: #a020f0;">lambda</span> ()
                                       <span style="color: #b22222;">;; </span><span style="color: #b22222;">Do not use `</span><span style="color: #b22222;">source</span><span style="color: #b22222;">' because other plugins</span>
                                       <span style="color: #b22222;">;; </span><span style="color: #b22222;">(such as helm-migemo) may change it</span>
                                       (helm-candidates-in-buffer
                                        (helm-get-current-source)))))
                             (volatile) (match identity)))
                 source))))
        ))
</pre>
</div>
</div>

<div id="outline-container-orgheadline101" class="outline-4">
<h4 id="orgheadline101"><span class="section-number-4">6.17.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-6-17-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(helm-M-x helm-locate helm-recentf helm-buffers-list
                  helm-occur helm-swoop)
       <span style="color: #8b2252;">"helm-config"</span> nil t nil
       '())
  (global-set-key (kbd <span style="color: #8b2252;">"C-c f f"</span>) 'helm-locate)
  (global-set-key (kbd <span style="color: #8b2252;">"C-x C-b"</span>) 'helm-buffers-list)
  (global-set-key (kbd <span style="color: #8b2252;">"M-s"</span>) 'helm-swoop)
  (global-set-key (kbd <span style="color: #8b2252;">"C-M-r"</span>) 'helm-recentf)
  (global-set-key (kbd <span style="color: #8b2252;">"C-c o"</span>) 'helm-occur)
  (global-set-key (kbd <span style="color: #8b2252;">"M-x"</span>) 'helm-M-x)
  )
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline103" class="outline-3">
<h3 id="orgheadline103"><span class="section-number-3">6.18</span> [stripe-buffer.el] テーブルの色をストライプにする</h3>
<div class="outline-text-3" id="text-6-18">
<p>
<a href="https://github.com/sabof/stripe-buffer/blob/master/stripe-buffer.el">stripe-buffer.el</a>を使います．重くツリーが多いOrgバッファだと激重になる可能性があります．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-mode <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
 '(
                                        <span style="color: #b22222;">;         </span><span style="color: #b22222;">(require 'org-install)</span>
   (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">stripe-buffer</span> nil t)
   (add-hook 'org-mode-hook 'turn-on-stripe-table-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline104" class="outline-3">
<h3 id="orgheadline104"><span class="section-number-3">6.19</span> [rainbow-delimiters] 対応するカッコに色を付ける</h3>
<div class="outline-text-3" id="text-6-19">
<p>
複数のカッコが重なる言語では，カッコの対応関係がひと目で理解し難い場合があります． <code>rainbow-delimiters</code> を使うと，対応するカッコを七色に色付けして見やすくできます．デフォルトだと色がパステル調で薄いので，パラメータを追加して調整します．<br  />
</p>

<p>
<code>org-block</code> 内でうまく動かないようなので，本格導入は様子見中です．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"rainbow-delimiters"</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">https://yoo2080.wordpress.com/2013/12/21/small-rainbow-delimiters-tutorial/</span>
  (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">cl-lib</span>)
  (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">color</span>)
  (<span style="color: #a020f0;">cl-loop</span>
   for index from 1 to rainbow-delimiters-max-face-count
   do
   (<span style="color: #a020f0;">let</span> ((face (intern (format <span style="color: #8b2252;">"rainbow-delimiters-depth-%d-face"</span> index))))
     (cl-callf color-saturate-name (face-foreground face) 50))))

(add-hook 'prog-mode-hook
          '(<span style="color: #a020f0;">lambda</span> ()
             (<span style="color: #a020f0;">unless</span> (equal (buffer-name) <span style="color: #8b2252;">"*scratch*"</span>)
               (rainbow-delimiters-mode))))
</pre>
</div>
</div>
</div>
