init.org
** [git-gutter-fringe] 編集差分をフレーム端で視覚化

git-gutter-fringe を使えば，フレーム幅の変化を気にしなくて済みます．とりあえず， =org-mode= を初回起動するときに紐づけています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(git-gutter-mode) "git-gutter-fringe" "Org Mode" t nil
         '((setq git-gutter:lighter "")
           ;; "!"
           (fringe-helper-define 'git-gutter-fr:modified nil
             "...XX..."
             "...XX..."
             "...XX..."
             "...XX..."
             "...XX..."
             "........"
             "...XX..."
             "...XX...")
           ;; "+"
           (fringe-helper-define 'git-gutter-fr:added nil
             "........"
             "...XX..."
             "...XX..."
             ".XXXXXX."
             ".XXXXXX."
             "...XX..."
             "...XX..."
             "........")
           ;; "-"
           (fringe-helper-define 'git-gutter-fr:deleted nil
             "........"
             "........"
             "........"
             ".XXXXXX."
             ".XXXXXX."
             "........"
             "........"
             "........")
           (setq git-gutter-fr:side 'left-fringe)
           (set-face-foreground 'git-gutter-fr:added    "#FF2600")
           (set-face-foreground 'git-gutter-fr:modified "orange")
           (set-face-foreground 'git-gutter-fr:deleted  "medium sea green")))

    (add-hook 'emacs-lisp-mode-hook 'git-gutter-mode)
    (add-hook 'lisp-mode-hook 'git-gutter-mode)
    (add-hook 'perl-mode-hook 'git-gutter-mode)
    (add-hook 'python-mode-hook 'git-gutter-mode)
    (add-hook 'c-mode-common-hook 'git-gutter-mode)
    (add-hook 'nxml-mode-hook 'git-gutter-mode)
    (add-hook 'web-mode-hook 'git-gutter-mode))
#+END_SRC

** [zlc.el] find-file バッファを zsh ライクにする

ファイル選択を zsh ライクに変更できます．

#+BEGIN_SRC emacs-lisp :tangle no
  (when (require 'zlc nil t)
    ;; http://d.hatena.ne.jp/mooz/20101003/p1
    (zlc-mode 1)
    (set-face-attribute 'zlc-selected-completion-face nil
                        :foreground "#000000" :background "#9DFFD2" :bold t)
    (setq zlc-select-completion-immediately t)
    (let ((map minibuffer-local-map))
      ;; like menu select
      (define-key map (kbd "<down>") 'zlc-select-next-vertical)
      (define-key map (kbd "<up>") 'zlc-select-previous-vertical)
      (define-key map (kbd "<left>") 'zlc-select-next)
      (define-key map (kbd "<right>") 'zlc-select-previous)
      ;; reset selection
      (define-key map (kbd "C-c") 'zlc-reset)))
#+END_SRC

** [japanese-holidays] カレンダーをカラフルにする

ビルドインの =holidays= と， =japanese-holidays= を使います．土日祝日に色を着けます．土曜日と日曜祝日で異なる配色にできます．

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "calendar"
    (add-hook 'calendar-today-visible-hook 'calendar-mark-today)

    (when (require 'japanese-holidays nil t)
      (setq calendar-holidays
            (append japanese-holidays
                    holiday-local-holidays holiday-other-holidays))
      (setq mark-holidays-in-calendar t)
      (setq japanese-holiday-weekend-marker
            '(holiday nil nil nil nil nil japanese-holiday-saturday))
      (setq japanese-holiday-weekend '(0 6))
      (add-hook 'calendar-today-visible-hook 'japanese-holiday-mark-weekend)
      (add-hook 'calendar-today-invisible-hook 'japanese-holiday-mark-weekend)))
#+END_SRC

** [guide-key] キーバインドの選択肢をポップアップする

自分用の関数にキーバインドを付けたのはいいけど，覚えられない時に使っています．以下の例では， =helm= もしくは =org= が読み込まれた時についでに有効化し， =C-c f= を押して， 0.5秒経つと，その後ろに続くキーの一覧がポップします．すでに覚えたキーバインドならば，0.5秒以内に打てるでしょうから，ポップ表示無しで通常通りにコマンドが発行します．色分けも効くのでわかりやすいです．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(guide-key-mode) "guide-key" nil t nil
         '((setq guide-key/guide-key-sequence '("C-c f"))
           (setq guide-key/popup-window-position 'bottom)
           (setq guide-key/idle-delay 0.5)
           (setq guide-key/highlight-command-regexp
                 '(("my:" . "red")
                   ("takaxp:" . "blue")))
           (guide-key-mode 1)))

    (with-eval-after-load "helm" (require 'guide-key nil t))
    (with-eval-after-load "org" (require 'guide-key nil t)))
#+END_SRC

* メディアサポート
