init.html

<div id="outline-container-orgheadline105" class="outline-3">
<h3 id="orgheadline105"><span class="section-number-3">6.20</span> [git-gutter-fringe] 編集差分をフレーム端で視覚化</h3>
<div class="outline-text-3" id="text-6-20">
<p>
git-gutter-fringe を使えば，フレーム幅の変化を気にしなくて済みます．とりあえず， <code>org-mode</code> を初回起動するときに紐づけています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(git-gutter-mode) <span style="color: #8b2252;">"git-gutter-fringe"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
       '((setq git-gutter:lighter <span style="color: #8b2252;">""</span>)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">"!"</span>
         (fringe-helper-define 'git-gutter-fr:modified nil
           <span style="color: #8b2252;">"...XX..."</span>
           <span style="color: #8b2252;">"...XX..."</span>
           <span style="color: #8b2252;">"...XX..."</span>
           <span style="color: #8b2252;">"...XX..."</span>
           <span style="color: #8b2252;">"...XX..."</span>
           <span style="color: #8b2252;">"........"</span>
           <span style="color: #8b2252;">"...XX..."</span>
           <span style="color: #8b2252;">"...XX..."</span>)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">"+"</span>
         (fringe-helper-define 'git-gutter-fr:added nil
           <span style="color: #8b2252;">"........"</span>
           <span style="color: #8b2252;">"...XX..."</span>
           <span style="color: #8b2252;">"...XX..."</span>
           <span style="color: #8b2252;">".XXXXXX."</span>
           <span style="color: #8b2252;">".XXXXXX."</span>
           <span style="color: #8b2252;">"...XX..."</span>
           <span style="color: #8b2252;">"...XX..."</span>
           <span style="color: #8b2252;">"........"</span>)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">"-"</span>
         (fringe-helper-define 'git-gutter-fr:deleted nil
           <span style="color: #8b2252;">"........"</span>
           <span style="color: #8b2252;">"........"</span>
           <span style="color: #8b2252;">"........"</span>
           <span style="color: #8b2252;">".XXXXXX."</span>
           <span style="color: #8b2252;">".XXXXXX."</span>
           <span style="color: #8b2252;">"........"</span>
           <span style="color: #8b2252;">"........"</span>
           <span style="color: #8b2252;">"........"</span>)
         (setq git-gutter-fr:side 'right-fringe)
         (set-face-foreground 'git-gutter-fr:added    <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF2600;">#FF2600</span><span style="color: #8b2252;">"</span>)
         (set-face-foreground 'git-gutter-fr:modified <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #ffa500;">orange</span><span style="color: #8b2252;">"</span>)
         (set-face-foreground 'git-gutter-fr:deleted  <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #3cb371;">medium sea green</span><span style="color: #8b2252;">"</span>)))

  (add-hook 'emacs-lisp-mode-hook 'git-gutter-mode)
  (add-hook 'lisp-mode-hook 'git-gutter-mode)
  (add-hook 'perl-mode-hook 'git-gutter-mode)
  (add-hook 'c-mode-common-hook 'git-gutter-mode)
  (add-hook 'nxml-mode-hook 'git-gutter-mode)
  (add-hook 'web-mode-hook 'git-gutter-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline106" class="outline-3">
<h3 id="orgheadline106"><span class="section-number-3">6.21</span> [zlc.el] find-file バッファを zsh ライクにする</h3>
<div class="outline-text-3" id="text-6-21">
<p>
ファイル選択を zsh ライクに変更できます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">zlc</span> nil t)
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">http://d.hatena.ne.jp/mooz/20101003/p1</span>
  (zlc-mode 1)
  (set-face-attribute 'zlc-selected-completion-face nil
                      <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #000000;">#000000</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #9DFFD2;">#9DFFD2</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:bold</span> t)
  (setq zlc-select-completion-immediately t)
  (<span style="color: #a020f0;">let</span> ((map minibuffer-local-map))
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">like menu select</span>
    (define-key map (kbd <span style="color: #8b2252;">"&lt;down&gt;"</span>) 'zlc-select-next-vertical)
    (define-key map (kbd <span style="color: #8b2252;">"&lt;up&gt;"</span>) 'zlc-select-previous-vertical)
    (define-key map (kbd <span style="color: #8b2252;">"&lt;left&gt;"</span>) 'zlc-select-next)
    (define-key map (kbd <span style="color: #8b2252;">"&lt;right&gt;"</span>) 'zlc-select-previous)
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">reset selection</span>
    (define-key map (kbd <span style="color: #8b2252;">"C-c"</span>) 'zlc-reset)))
</pre>
</div>
</div>
</div>
</div>
