init.el
       '(git-gutter-mode) "git-gutter-fringe" "Org Mode" t nil
       '((setq git-gutter:lighter "")
         ;; "!"
         (fringe-helper-define 'git-gutter-fr:modified nil
           "...XX..."
           "...XX..."
           "...XX..."
           "...XX..."
           "...XX..."
           "........"
           "...XX..."
           "...XX...")
         ;; "+"
         (fringe-helper-define 'git-gutter-fr:added nil
           "........"
           "...XX..."
           "...XX..."
           ".XXXXXX."
           ".XXXXXX."
           "...XX..."
           "...XX..."
           "........")
         ;; "-"
         (fringe-helper-define 'git-gutter-fr:deleted nil
           "........"
           "........"
           "........"
           ".XXXXXX."
           ".XXXXXX."
           "........"
           "........"
           "........")
         (setq git-gutter-fr:side 'left-fringe)
         (set-face-foreground 'git-gutter-fr:added    "#FF2600")
         (set-face-foreground 'git-gutter-fr:modified "orange")
         (set-face-foreground 'git-gutter-fr:deleted  "medium sea green")))

  (add-hook 'emacs-lisp-mode-hook 'git-gutter-mode)
  (add-hook 'lisp-mode-hook 'git-gutter-mode)
  (add-hook 'perl-mode-hook 'git-gutter-mode)
  (add-hook 'python-mode-hook 'git-gutter-mode)
  (add-hook 'c-mode-common-hook 'git-gutter-mode)
  (add-hook 'nxml-mode-hook 'git-gutter-mode)
  (add-hook 'web-mode-hook 'git-gutter-mode))

(with-eval-after-load "calendar"
  (add-hook 'calendar-today-visible-hook 'calendar-mark-today)

  (when (require 'japanese-holidays nil t)
    (setq calendar-holidays
          (append japanese-holidays
                  holiday-local-holidays holiday-other-holidays))
    (setq mark-holidays-in-calendar t)
    (setq japanese-holiday-weekend-marker
          '(holiday nil nil nil nil nil japanese-holiday-saturday))
    (setq japanese-holiday-weekend '(0 6))
    (add-hook 'calendar-today-visible-hook 'japanese-holiday-mark-weekend)
    (add-hook 'calendar-today-invisible-hook 'japanese-holiday-mark-weekend)))

(when (eval-after-autoload-if-found
       '(guide-key-mode) "guide-key" nil t nil
       '((setq guide-key/guide-key-sequence '("C-c f"))
         (setq guide-key/popup-window-position 'bottom)
         (setq guide-key/idle-delay 0.5)
         (setq guide-key/highlight-command-regexp
               '(("my:" . "red")
                 ("takaxp:" . "blue")))
         (guide-key-mode 1)))

  (with-eval-after-load "helm" (require 'guide-key nil t))
  (with-eval-after-load "org" (require 'guide-key nil t)))

(eval-after-autoload-if-found
