init.org
** [bongo.el] Emacsのバッファで音楽ライブラリを管理する

[[http://pastelwill.jp/wiki/doku.php?id=emacs][iTunes の代わりに Emacs を使う]]

autoload を設定すると， =*.bango-playlist= や =*.bongo-library= から起動できないので，明示的に require している．なお，bongo-mplayer を使う場合，bongo を先にrequireするとうまく動作しない（bongo.el の最後で，bongo-mplayer が provide されているからだと思われる）．

以下の設定では，autoload で使いつつ，=M-x init-bongo= でプレイリストを読み込んでいる．これならば，Emacs起動時は軽量で，かつ，プレイリストの訪問で Bongo を開始できる．

#+BEGIN_SRC emacs-lisp :tangle no :exports no
  ;;  (require 'bongo)
  (when (autoload-if-found 'bongo "bongo-mplayer" nil t)
    (defun init-bongo ()
      (interactive)
      (bongo)
      (find-file "~/Desktop/next/Tidy/hoge.bongo-playlist"))
    (with-eval-after-load "bongo-mplayer"
      ;; Volume control
      ;;         (require volume.el nil t)
      (setq bongo-mplayer-extra-arguments '("-volume" "1"))
      ;; Avoid error when editing bongo buffers
      (setq yank-excluded-properties nil)
      ;; Use mplayer
      (setq bongo-enabled-backends '(mplayer))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
  (eval-after-autoload-if-found
   '(bongo) "bongo-mplayer" nil t nil
   '(;; Volume control
     ;;         (require volume.el nil t)
     (setq bongo-mplayer-extra-arguments '("-volume" "1"))
     ;; Avoid error when editing bongo buffers
     (setq yank-excluded-properties nil)
     ;; Use mplayer
     (setq bongo-enabled-backends '(mplayer))

     (defun init-bongo ()
       (interactive)
       (bongo)
       (find-file "~/Desktop/next/Tidy/hoge.bongo-playlist"))))
#+END_SRC

org-player.el を使えば，org-mode のバッファから Bongo を操作できる．

#+BEGIN_SRC emacs-lisp :tangle no
  (eval-after-autoload-if-found 'org-mode "org-player")
#+END_SRC

   音量コントロールには，[[https://github.com/dbrock/volume-el][volume.el]]が必要です．設定がうまくいかないので保留中

#+BEGIN_SRC emacs-lisp :tangle no
  (autoload 'volume "volume" "Tweak your sound card volume." t)
#+END_SRC

** [GoogleMaps.el] GoogleMaps を Emacs 内で使う

[[http://julien.danjou.info/software/google-maps.el]]

=M-x gogole-maps= で起動します．

#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-autoload-if-found
   '(google-maps) "google-maps" nil t nil
   '((require 'org-location-google-maps nil t)))
#+END_SRC

=+/-= でズーム， =矢印= で移動， =q= で終了します．また， =w= でURLを取得してコピー， =t= で地図の種別を変更できます．

Org-mode を使っている場合には， =C-c M-L= で表示されるプロンプトで検索すると，プロパティにそのキーワードが記録されます．後から =C-c M-l= すれば，いつでも地図を表示できるようになります．

** [org-google-weather.el] org-agenda に天気を表示する

残念ながら Google API が変更になり動かなくなったそうです．

[[http://julien.danjou.info/software/google-weather.el]]

#+BEGIN_SRC  emacs-lisp :tangle no
  (require 'google-weather nil t)
  (when (require 'org-google-weather nil t)
    '(org-google-weather-use-google-icons t))
#+END_SRC

* 履歴／ファイル管理
** Undoバッファを無限に取る

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq undo-outer-limit nil)
#+END_SRC

** [undo-tree] 編集履歴をわかりやすくたどる

Undoのツリーが表示され，履歴をたどれます． =C-x u= と =q= に対して，フレームサイズの変更を紐付けています．また， =auto-save-buffers= が org-files をどんどん保存して記録してしまうので，ツリーを選んでいる時に auto-save-buffers が発動するのを別途抑制しています．加えて， =org-tree-slide= でナローイングしていると，タイムスタンプが記録される時に履歴が辿れなくなるので， =org-tree-slide= が有効の時は，タイムスタンプを押させないように別途制限を加えています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(my:undo-tree-visualize) "undo-tree" nil t nil
         '((global-undo-tree-mode)
           (setq undo-tree-mode-lighter nil) ;; モードライン領域を節約
           (defun my:undo-tree-visualizer-quit ()
             (interactive)
             (undo-tree-visualizer-quit)
             (delete-window)
             (set-frame-width (selected-frame) 80))
           (defun my:undo-tree-visualize ()
             (interactive)
             (set-frame-width (selected-frame) 163)
             (undo-tree-visualize))

           (define-key undo-tree-visualizer-mode-map (kbd "q")
             'my:undo-tree-visualizer-quit)
           ;; undo-tree-map にも必要
           (define-key undo-tree-map (kbd "C-x u")
             'my:undo-tree-visualize)))

    (global-set-key (kbd "C-x u") 'my:undo-tree-visualize))
#+END_SRC

** バッファ保存時にバックアップファイルを生成する

バッファが保存されるとき，必ずバックアップを生成する．
#+BEGIN_SRC emacs-lisp :tangle no
  ;; Backup the buffer whenever the buffer is saved
  (global-set-key (kbd "C-x C-s")
                  '(lambda () (interactive) (save-buffer 16)))
#+END_SRC

** バッファ保存時にバックアップを生成させない

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; *.~
  (setq make-backup-files nil)
  ;; .#*
  (setq auto-save-default nil)
  ;; auto-save-list
  (setq auto-save-list-file-prefix nil)
#+END_SRC

** ミニバッファの履歴を保存しリストアする

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(savehist-mode) "savehist" nil t nil
         '((setq savehist-file "~/Dropbox/emacs.d/.history")))
    (savehist-mode 1))
#+END_SRC

