init.html

<div id="outline-container-orgheadline111" class="outline-2">
<h2 id="orgheadline111"><span class="section-number-2">7</span> メディアサポート</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline108" class="outline-3">
<h3 id="orgheadline108"><span class="section-number-3">7.1</span> [bongo.el] Emacsのバッファで音楽ライブラリを管理する</h3>
<div class="outline-text-3" id="text-7-1">
<p>
<a href="http://pastelwill.jp/wiki/doku.php?id=emacs">iTunes の代わりに Emacs を使う</a><br  />
</p>

<p>
autoload を設定すると， <code>*.bango-playlist</code> や <code>*.bongo-library</code> から起動できないので，明示的に require している．なお，bongo-mplayer を使う場合，bongo を先にrequireするとうまく動作しない（bongo.el の最後で，bongo-mplayer が provide されているからだと思われる）．<br  />
</p>

<p>
以下の設定では，autoload で使いつつ，=M-x init-bongo= でプレイリストを読み込んでいる．これならば，Emacs起動時は軽量で，かつ，プレイリストの訪問で Bongo を開始できる．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;;  </span><span style="color: #b22222;">(require 'bongo)</span>
(<span style="color: #a020f0;">when</span> (autoload-if-found 'bongo <span style="color: #8b2252;">"bongo-mplayer"</span> nil t)
  (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">init-bongo</span> ()
    (interactive)
    (bongo)
    (find-file <span style="color: #8b2252;">"~/Desktop/next/Tidy/hoge.bongo-playlist"</span>))
  (eval-after-load <span style="color: #8b2252;">"bongo-mplayer"</span>
    '(<span style="color: #a020f0;">progn</span>
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">Volume control</span>
                                        <span style="color: #b22222;">;         </span><span style="color: #b22222;">(require volume.el nil t)</span>
       (setq bongo-mplayer-extra-arguments '(<span style="color: #8b2252;">"-volume"</span> <span style="color: #8b2252;">"1"</span>))
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">Avoid error when editing bongo buffers</span>
       (setq yank-excluded-properties nil)
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">Use mplayer</span>
       (setq bongo-enabled-backends '(mplayer)))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(bongo) <span style="color: #8b2252;">"bongo-mplayer"</span> nil t nil
 '(<span style="color: #b22222;">;; </span><span style="color: #b22222;">Volume control</span>
   <span style="color: #b22222;">;;         </span><span style="color: #b22222;">(require volume.el nil t)</span>
   (setq bongo-mplayer-extra-arguments '(<span style="color: #8b2252;">"-volume"</span> <span style="color: #8b2252;">"1"</span>))
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Avoid error when editing bongo buffers</span>
   (setq yank-excluded-properties nil)
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Use mplayer</span>
   (setq bongo-enabled-backends '(mplayer))

   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">init-bongo</span> ()
     (interactive)
     (bongo)
     (find-file <span style="color: #8b2252;">"~/Desktop/next/Tidy/hoge.bongo-playlist"</span>))))
</pre>
</div>

<p>
org-player.el を使えば，org-mode のバッファから Bongo を操作できる．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found 'org-mode <span style="color: #8b2252;">"org-player"</span> nil t)
</pre>
</div>

<p>
音量コントロールには，<a href="https://github.com/dbrock/volume-el">volume.el</a>が必要です．設定がうまくいかないので保留中<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(autoload 'volume <span style="color: #8b2252;">"volume"</span> <span style="color: #8b2252;">"Tweak your sound card volume."</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline109" class="outline-3">
<h3 id="orgheadline109"><span class="section-number-3">7.2</span> [GoogleMaps.el] GoogleMaps を Emacs 内で使う</h3>
<div class="outline-text-3" id="text-7-2">
<p>
<a href="http://julien.danjou.info/software/google-maps.el">http://julien.danjou.info/software/google-maps.el</a><br  />
</p>

<p>
<code>M-x gogole-maps</code> で起動します．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(google-maps) <span style="color: #8b2252;">"google-maps"</span> nil t nil
 '((<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">org-location-google-maps</span> nil t)))
</pre>
</div>

<p>
<code>+/-</code> でズーム， <code>矢印</code> で移動， <code>q</code> で終了します．また， <code>w</code> でURLを取得してコピー， <code>t</code> で地図の種別を変更できます．<br  />
</p>

<p>
Org-mode を使っている場合には， <code>C-c M-L</code> で表示されるプロンプトで検索すると，プロパティにそのキーワードが記録されます．後から <code>C-c M-l</code> すれば，いつでも地図を表示できるようになります．<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline110" class="outline-3">
<h3 id="orgheadline110"><span class="section-number-3">7.3</span> [org-google-weather.el] org-agenda に天気を表示する</h3>
<div class="outline-text-3" id="text-7-3">
<p>
残念ながら Google API が変更になり動かなくなったそうです．<br  />
</p>

<p>
<a href="http://julien.danjou.info/software/google-weather.el">http://julien.danjou.info/software/google-weather.el</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">google-weather</span> nil t)
(<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">org-google-weather</span> nil t)
  '(org-google-weather-use-google-icons t))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline126" class="outline-2">
<h2 id="orgheadline126"><span class="section-number-2">8</span> 履歴／ファイル管理</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgheadline112" class="outline-3">
<h3 id="orgheadline112"><span class="section-number-3">8.1</span> Undoバッファを無限に取る</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq undo-outer-limit nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline113" class="outline-3">
<h3 id="orgheadline113"><span class="section-number-3">8.2</span> [undo-tree] 編集履歴をわかりやすくたどる</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Undoのツリーが表示され，履歴をたどれます． <code>C-x u</code> と <code>q</code> に対して，フレームサイズの変更を紐付けています．また， <code>auto-save-buffers</code> が org-files をどんどん保存して記録してしまうので，ツリーを選んでいる時に auto-save-buffers が発動するのを別途抑制しています．加えて， <code>org-tree-slide</code> でナローイングしていると，タイムスタンプが記録される時に履歴が辿れなくなるので， <code>org-tree-slide</code> が有効の時は，タイムスタンプを押させないように別途制限を加えています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(my:undo-tree-visualize) <span style="color: #8b2252;">"undo-tree"</span> nil t nil
       '((global-undo-tree-mode)
         (setq undo-tree-mode-lighter nil) <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12514;&#12540;&#12489;&#12521;&#12452;&#12531;&#38936;&#22495;&#12434;&#31680;&#32004;</span>
         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:undo-tree-visualizer-quit</span> ()
           (interactive)
           (undo-tree-visualizer-quit)
           (delete-window)
           (set-frame-width (selected-frame) 80))
         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:undo-tree-visualize</span> ()
           (interactive)
           (set-frame-width (selected-frame) 163)
           (undo-tree-visualize))

         (define-key undo-tree-visualizer-mode-map (kbd <span style="color: #8b2252;">"q"</span>)
           'my:undo-tree-visualizer-quit)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">undo-tree-map &#12395;&#12418;&#24517;&#35201;</span>
         (define-key undo-tree-map (kbd <span style="color: #8b2252;">"C-x u"</span>)
           'my:undo-tree-visualize)))
  (global-set-key (kbd <span style="color: #8b2252;">"C-x u"</span>) 'my:undo-tree-visualize))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline114" class="outline-3">
<h3 id="orgheadline114"><span class="section-number-3">8.3</span> バッファ保存時にバックアップファイルを生成する</h3>
<div class="outline-text-3" id="text-8-3">
<p>
バッファが保存されるとき，必ずバックアップを生成する．<br  />
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Backup the buffer whenever the buffer is saved</span>
(global-set-key (kbd <span style="color: #8b2252;">"C-x C-s"</span>)
                '(<span style="color: #a020f0;">lambda</span> () (interactive) (save-buffer 16)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline115" class="outline-3">
<h3 id="orgheadline115"><span class="section-number-3">8.4</span> バッファ保存時にバックアップを生成させない</h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">*.~</span>
(setq make-backup-files nil)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">.#*</span>
(setq auto-save-default nil)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">auto-save-list</span>
(setq auto-save-list-file-prefix nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline116" class="outline-3">
<h3 id="orgheadline116"><span class="section-number-3">8.5</span> ミニバッファの履歴を保存しリストアする</h3>
<div class="outline-text-3" id="text-8-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(savehist-mode) <span style="color: #8b2252;">"savehist"</span> nil t nil
       '((setq savehist-file <span style="color: #8b2252;">"~/Dropbox/emacs.d/.history"</span>)))
  (savehist-mode 1))
</pre>
</div>
</div>
</div>
