init.el
 '(google-maps) "google-maps" nil t nil
 '((require 'org-location-google-maps nil t)))

(setq undo-outer-limit nil)

(when (eval-after-autoload-if-found
       '(my:undo-tree-visualize) "undo-tree" nil t nil
       '((global-undo-tree-mode)
         (setq undo-tree-mode-lighter nil) ;; モードライン領域を節約
         (defun my:undo-tree-visualizer-quit ()
           (interactive)
           (undo-tree-visualizer-quit)
           (delete-window)
           (set-frame-width (selected-frame) 80))
         (defun my:undo-tree-visualize ()
           (interactive)
           (set-frame-width (selected-frame) 163)
           (undo-tree-visualize))

         (define-key undo-tree-visualizer-mode-map (kbd "q")
           'my:undo-tree-visualizer-quit)
         ;; undo-tree-map にも必要
         (define-key undo-tree-map (kbd "C-x u")
           'my:undo-tree-visualize)))

  (global-set-key (kbd "C-x u") 'my:undo-tree-visualize))

;; *.~
(setq make-backup-files nil)
;; .#*
(setq auto-save-default nil)
;; auto-save-list
(setq auto-save-list-file-prefix nil)

(when (eval-after-autoload-if-found
       '(savehist-mode) "savehist" nil t nil
       '((setq savehist-file "~/Dropbox/emacs.d/.history")))
  (savehist-mode 1))
