init.org
** 履歴サイズを大きくする

   tで無限大に指定する．
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq history-length 2000)
#+END_SRC

** Emacs終了時に開いていたバッファを起動時に復元する

Built-in の [[http://www.emacswiki.org/emacs/DeskTop][desktop.el]] を使う．

org バッファを CONTENT view で大量に開いていると，再起動が非常に遅くなるので利用を中止した．代替手段として，session.el と recentf の組み合わせがある．最近利用したファイルとそのカーソル位置が保持されるため，最後に訪問していたファイルを比較的簡単に復元できる．頻繁に復元するバッファには，別途キーバインドを割り当てておけば問題ない．

#+BEGIN_SRC emacs-lisp :tangle no
  (eval-after-autoload-if-found
   '(desktop-save desktop-clear desktop-load-default desktop-remove)
   "desktop" nil t nil
   '((desktop-save-mode 1)
     (setq desktop-files-not-to-save "\\(^/tmp\\|^/var\\|^/ssh:\\)")))
#+END_SRC

** 最近開いたファイルリストを保持

Built-in の [[http://www.emacswiki.org/emacs/RecentFiles][recentf.el]] を使う．

http://d.hatena.ne.jp/tomoya/20110217/1297928222

session.el でも履歴管理できるが，anything のソースとして使っているので併用している．

起動直後から有効にするので，autolad-if-load で括る必要はない．

recentf-auto-cleanup を ='mode= などにすると起動時にファイルのクリーニングが行われるてしまうので，='never= で回避し，アイドルタイマーなどで対応する．これだけで50[ms]ほど起動を高速化できる．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(rencetf-mode recentf-save-list-without-msg) "recentf" nil t nil
         '((defun recentf-save-list-without-msg ()
             (interactive)
             (let ((message-log-max nil))
               (if (require 'shut-up nil t)
                   (shut-up (recentf-save-list))
                 (recentf-save-list)))
             (message ""))
           (defun recentf-cleanup-without-msg ()
             (interactive)
             (let ((message-log-max nil))
               (if (require 'shut-up nil t)
                   (shut-up (recentf-cleanup))
                 (recentf-cleanup)))
             (message ""))
           (add-hook 'focus-out-hook 'recentf-save-list-without-msg)
           (add-hook 'focus-out-hook 'recentf-cleanup-without-msg)

           (setq recentf-max-saved-items 2000)
           (setq recentf-save-file
                 (expand-file-name "~/.emacs.d/recentf"))
           (setq recentf-auto-cleanup 'never)
           (setq recentf-exclude
                 '(".recentf" "^/tmp\\.*"
                   "^/private\\.*" "^/var/folders\\.*" "/TAGS$"))))

    (add-hook 'after-init-hook 'recentf-mode))
#+END_SRC

** 深夜にバッファを自動整理する

http://www.emacswiki.org/emacs-zh/CleanBufferList

#+BEGIN_SRC emacs-lisp :tangle no
  (when (require 'midnight nil t)
    (setq clean-buffer-list-buffer-names
          (append clean-buffer-list-kill-buffer-names
                  '("note.txt")))
    (setq clean-buffer-list-delay-general 1)
    (setq clean-buffer-list-delay-special 10))  
#+END_SRC

** [auto-save-buffers.el] 一定間隔でバッファを保存する

http://0xcc.net/misc/auto-save/

起動直後から有効にするので，autolad-if-load で括る必要はない．同じ機能で比較的新しいパッケージに， =real-auto-save= があります．ただ，私の場合は，以下のようなモードごとの制御がうまくできなかったので移行していません．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (and (require 'auto-save-buffers nil t)
             (require 'shut-up nil t))
    (run-with-idle-timer
     1.6 t
     #'(lambda ()
         (cond ((equal major-mode 'undo-tree-visualizer-mode) nil)
               ((equal major-mode 'diff-mode) nil)
               ((string-match "Org Src" (buffer-name)) nil)
               (t (shut-up (auto-save-buffers)))))))
#+END_SRC

** [backup-dir.el] バックアップファイルを一箇所に集める

=backup-each-save= を使うようになりました．

http://www.emacswiki.org/emacs/BackupDirectory
http://www.northbound-train.com/emacs-hosted/backup-dir.el
http://www.northbound-train.com/emacs.html

起動直後から有効にするので，autolad-if-load で括る必要はない．

#+BEGIN_SRC emacs-lisp :tangle no
  (make-variable-buffer-local 'backup-inhibited)
  (setq backup-files-store-dir "~/.emacs.d/backup")
  (unless (file-directory-p backup-files-store-dir) 
    (message "!!! %s does not exist. !!!" backup-files-store-dir)
    (sleep-for 1))
  (when (require 'backup-dir nil t)
    (when (file-directory-p backup-files-store-dir)
      ;; backup path
      (setq bkup-backup-directory-info '((t "~/.emacs.d/backup" ok-create)))
      ;; for tramp
      (setq tramp-bkup-backup-directory-info bkup-backup-directory-info)
      ;; generation properties
      (setq delete-old-versions t
            kept-old-versions 0
            kept-new-versions 5
            version-control t)))
#+END_SRC

