init.html

<div id="outline-container-orgheadline117" class="outline-3">
<h3 id="orgheadline117"><span class="section-number-3">8.6</span> 履歴サイズを大きくする</h3>
<div class="outline-text-3" id="text-8-6">
<p>
tで無限大に指定する．<br  />
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq history-length 1000)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline118" class="outline-3">
<h3 id="orgheadline118"><span class="section-number-3">8.7</span> Emacs終了時に開いていたバッファを起動時に復元する</h3>
<div class="outline-text-3" id="text-8-7">
<p>
Built-in の <a href="http://www.emacswiki.org/emacs/DeskTop">desktop.el</a> を使う．<br  />
</p>

<p>
org バッファを CONTENT view で大量に開いていると，再起動が非常に遅くなるので利用を中止した．代替手段として，session.el と recentf の組み合わせがある．最近利用したファイルとそのカーソル位置が保持されるため，最後に訪問していたファイルを比較的簡単に復元できる．頻繁に復元するバッファには，別途キーバインドを割り当てておけば問題ない．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(desktop-save desktop-clear desktop-load-default desktop-remove)
 <span style="color: #8b2252;">"desktop"</span> nil t nil
 '((desktop-save-mode 1)
   (setq desktop-files-not-to-save <span style="color: #8b2252;">"</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">(</span><span style="color: #8b2252;">^/tmp</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">|</span><span style="color: #8b2252;">^/var</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">|</span><span style="color: #8b2252;">^/ssh:</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252; font-weight: bold;">)</span><span style="color: #8b2252;">"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline119" class="outline-3">
<h3 id="orgheadline119"><span class="section-number-3">8.8</span> 最近開いたファイルリストを保持</h3>
<div class="outline-text-3" id="text-8-8">
<p>
Built-in の <a href="http://www.emacswiki.org/emacs/RecentFiles">recentf.el</a> を使う．<br  />
</p>

<p>
<a href="http://d.hatena.ne.jp/tomoya/20110217/1297928222">http://d.hatena.ne.jp/tomoya/20110217/1297928222</a><br  />
</p>

<p>
session.el でも履歴管理できるが，anything のソースとして使っているので併用している．<br  />
</p>

<p>
起動直後から有効にするので，autolad-if-load で括る必要はない．<br  />
</p>

<p>
recentf-auto-cleanup を ='mode= などにすると起動時にファイルのクリーニングが行われるてしまうので，='never= で回避し，アイドルタイマーなどで対応する．これだけで50[ms]ほど起動を高速化できる．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">     (<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
            '(rencetf-mode recentf-save-list-without-msg) <span style="color: #8b2252;">"recentf"</span> nil t nil
            '((<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">recentf-save-list-without-msg</span> ()
                (interactive)
                (<span style="color: #a020f0;">let</span> ((message-log-max nil))
                  (<span style="color: #a020f0;">if</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">shut-up</span> nil t)
                      (shut-up (recentf-save-list))
                    (recentf-save-list)))
                (message <span style="color: #8b2252;">""</span>))
              (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">recentf-cleanup-without-msg</span> ()
                (interactive)
                (<span style="color: #a020f0;">let</span> ((message-log-max nil))
                  (<span style="color: #a020f0;">if</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">shut-up</span> nil t)
                      (shut-up (recentf-cleanup))
                    (recentf-cleanup)))
                  (message <span style="color: #8b2252;">""</span>))
              (add-hook 'focus-out-hook 'recentf-save-list-without-msg)
              (add-hook 'focus-out-hook 'recentf-cleanup-without-msg)

              (setq recentf-max-saved-items 2000)
              (setq recentf-save-file
                    (expand-file-name <span style="color: #8b2252;">"~/.emacs.d/recentf"</span>))
              (setq recentf-auto-cleanup 'never)
              (setq recentf-exclude
                    '(<span style="color: #8b2252;">".recentf"</span> <span style="color: #8b2252;">"^/tmp\\.*"</span> <span style="color: #8b2252;">"^/private\\.*"</span> <span style="color: #8b2252;">"^/var/folders\\.*"</span> <span style="color: #8b2252;">"/TAGS$"</span>))))
       (add-hook 'after-init-hook 'recentf-mode)
)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline120" class="outline-3">
<h3 id="orgheadline120"><span class="section-number-3">8.9</span> 深夜にバッファを自動整理する</h3>
<div class="outline-text-3" id="text-8-9">
<p>
<a href="http://www.emacswiki.org/emacs-zh/CleanBufferList">http://www.emacswiki.org/emacs-zh/CleanBufferList</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">midnight</span> nil t)
  (setq clean-buffer-list-buffer-names
        (append clean-buffer-list-kill-buffer-names
                '(<span style="color: #8b2252;">"note.txt"</span>)))
  (setq clean-buffer-list-delay-general 1)
  (setq clean-buffer-list-delay-special 10))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline121" class="outline-3">
<h3 id="orgheadline121"><span class="section-number-3">8.10</span> [auto-save-buffers.el] 一定間隔でバッファを保存する</h3>
<div class="outline-text-3" id="text-8-10">
<p>
<a href="http://0xcc.net/misc/auto-save/">http://0xcc.net/misc/auto-save/</a><br  />
</p>

<p>
起動直後から有効にするので，autolad-if-load で括る必要はない．同じ機能で比較的新しいパッケージに， <code>real-auto-save</code> があります．ただ，私の場合は，以下のようなモードごとの制御がうまくできなかったので移行していません．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (and (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">auto-save-buffers</span> nil t)
           (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">shut-up</span> nil t))
  (run-with-idle-timer 1.6 t
                       '(<span style="color: #a020f0;">lambda</span> ()
                          (<span style="color: #a020f0;">when</span> (and (not (equal major-mode
                                                 'undo-tree-visualizer-mode))
                                     (not (equal major-mode 'diff-mode)))
                            (shut-up (auto-save-buffers))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline122" class="outline-3">
<h3 id="orgheadline122"><span class="section-number-3">8.11</span> [backup-dir.el] バックアップファイルを一箇所に集める</h3>
<div class="outline-text-3" id="text-8-11">
<p>
<code>backup-each-save</code> を使うようになりました．<br  />
</p>

<p>
<a href="http://www.emacswiki.org/emacs/BackupDirectory">http://www.emacswiki.org/emacs/BackupDirectory</a><br  />
<a href="http://www.northbound-train.com/emacs-hosted/backup-dir.el">http://www.northbound-train.com/emacs-hosted/backup-dir.el</a><br  />
<a href="http://www.northbound-train.com/emacs.html">http://www.northbound-train.com/emacs.html</a><br  />
</p>

<p>
起動直後から有効にするので，autolad-if-load で括る必要はない．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(make-variable-buffer-local 'backup-inhibited)
(setq backup-files-store-dir <span style="color: #8b2252;">"~/.emacs.d/backup"</span>)
(<span style="color: #a020f0;">unless</span> (file-directory-p backup-files-store-dir) 
  (message <span style="color: #8b2252;">"!!! %s does not exist. !!!"</span> backup-files-store-dir)
  (sleep-for 1))
(<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">backup-dir</span> nil t)
  (<span style="color: #a020f0;">when</span> (file-directory-p backup-files-store-dir)
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">backup path</span>
    (setq bkup-backup-directory-info '((t <span style="color: #8b2252;">"~/.emacs.d/backup"</span> ok-create)))
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">for tramp</span>
    (setq tramp-bkup-backup-directory-info bkup-backup-directory-info)
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">generation properties</span>
    (setq delete-old-versions t
          kept-old-versions 0
          kept-new-versions 5
          version-control t)))
</pre>
</div>
</div>
</div>
