init.el

(setq history-length 2000)

(when (eval-after-autoload-if-found
       '(rencetf-mode recentf-save-list-without-msg) "recentf" nil t nil
       '((defun recentf-save-list-without-msg ()
           (interactive)
           (let ((message-log-max nil))
             (if (require 'shut-up nil t)
                 (shut-up (recentf-save-list))
               (recentf-save-list)))
           (message ""))
         (defun recentf-cleanup-without-msg ()
           (interactive)
           (let ((message-log-max nil))
             (if (require 'shut-up nil t)
                 (shut-up (recentf-cleanup))
               (recentf-cleanup)))
           (message ""))
         (add-hook 'focus-out-hook 'recentf-save-list-without-msg)
         (add-hook 'focus-out-hook 'recentf-cleanup-without-msg)

         (setq recentf-max-saved-items 2000)
         (setq recentf-save-file
               (expand-file-name "~/.emacs.d/recentf"))
         (setq recentf-auto-cleanup 'never)
         (setq recentf-exclude
               '(".recentf" "^/tmp\\.*"
                 "^/private\\.*" "^/var/folders\\.*" "/TAGS$"))))

  (add-hook 'after-init-hook 'recentf-mode))

(when (and (require 'auto-save-buffers nil t)
           (require 'shut-up nil t))
  (run-with-idle-timer
   1.6 t
   #'(lambda ()
       (cond ((equal major-mode 'undo-tree-visualizer-mode) nil)
             ((equal major-mode 'diff-mode) nil)
             ((string-match "Org Src" (buffer-name)) nil)
             (t (shut-up (auto-save-buffers)))))))
