init.org
** [backup-each-save] クラッシュに備える

直近のファイルを常にバックアップします． =backup-dir.el= でも良いですが，バックアップの目的が，バッファ編集中に =emacs= が落ちる時の保険ならば， =backup-each-save= の方が適切な場合があります．以下の例では，すべてのファイルを保存の度に保存しつつ， =emacs= 終了時に7日前までのバックアップファイルをすべて削除するようにしています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (require 'backup-each-save nil t)
    (setq backup-each-save-mirror-location "~/.emacs.d/backup")
    (setq backup-each-save-time-format "%y-%m-%d_%M:%S")
    (setq backup-each-save-size-limit 1048576)
    (add-hook 'after-save-hook
              '(lambda () (unless (equal (buffer-name) "recentf")
                            (backup-each-save)))))

  (when (eval-after-autoload-if-found
         '(recursive-delete-backup-files delete-backup-files) "utility")

    ;; backup-each-save が作るファイルのうち条件にあうものを終了時に削除
    (add-hook 'kill-emacs-hook
              #'(lambda () (recursive-delete-backup-files 7))))
#+END_SRC

** [session.el] 様々な履歴を保存し復元に利用する
http://emacs-session.sourceforge.net/

  - 入力履歴の保持（検索語，表示したバッファ履歴）
  - 保存時のカーソル位置の保持
  - キルリングの保持
  - 変更が加えられたファイル履歴の保持

=M-x session-save-session=

session-undo-check を指定していると，保存時ではなくバッファを閉じるときの状態を保持する．

Org-mode と併用する場合は，my:org-reveal-session-jump の設定が必須．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         'session-initialize "session" nil t nil
         '((add-to-list 'session-globals-exclude 'org-mark-ring)
           ;; Change save point of session.el
           (setq session-save-file
                 (expand-file-name "~/Dropbox/emacs.d/.session"))
           (setq session-initialize '(de-saveplace session keys menus places)
                 session-globals-include '((kill-ring 100)
                                           (session-file-alist 100 t)
                                           (file-name-history 200)
                                           search-ring regexp-search-ring))
           (setq session-undo-check -1)))

    (add-hook 'after-init-hook 'session-initialize))
  ;; FIXME
  ;;  (setq session-set-file-name-exclude-regexp
  ;;        "^/private/\\.\\*"))
  ;;          "[/\\]\\.overview\\|[/\\]\\.session\\|News[/\\]\\|^/private\\.*\\|^/var/folders\\.*"))  
#+END_SRC

次はテスト中．orgバッファを開いたらカーソル位置をorg-revealしたいが，time-stampなどと組み合わせたり，org-tree-slideと組み合わせていると，うまくいかない．バッファを表示した時に org-reveal (C-c C-r) を打つのをサボりたいだけなのだが．．．

http://www.emacswiki.org/emacs/EmacsSession

#+BEGIN_SRC emacs-lisp :tangle no
  (when (autoload-if-found 'session-initialize "session" nil t)
    (add-hook 'after-init-hook 'session-initialize)
    (eval-after-load "session"
      '(progn
         ;; For Org-mode
         (defun my:maybe-reveal ()
           (interactive)
           (when (and (or (memq major-mode '(org-mode outline-mode))
                          (and (boundp 'outline-minor-mominor-de)
                               outline-minor-mode))
                      (outline-invisible-p))
             (if (eq major-mode 'org-mode)
                 (org-reveal)
               (show-subtree))))
         
         (defun my:org-reveal-session-jump ()
           (message "call!")
           (when (and (eq major-mode 'org-mode)
                      (outline-invisible-p))
             (org-reveal)))
         
         ;; C-x C-/
         (add-hook 'session-after-jump-to-last-change-hook
                   'my:maybe-reveal))))
  
#+END_SRC

** [wakatime-mode.el] WakaTime を利用して作業記録する

1. [[https://www.wakati.me/]]（API発行とログGUI表示）
2. [[https://github.com/wakatime/wakatime]]（ログ記録用スクリプト）
3. [[https://github.com/nyuhuhuu/wakatime-mode]]（Emacs用プラグイン）

利用開始前に，ログ表示サイトでルールをカスタマイズしておくとよい．例えば，拡張子が =.org= なファイルの場合，言語設定を =Text= にする，という具合に．すると，グラフ表示がわかりやすくなる．

#+BEGIN_SRC emacs-lisp :tangle no :exports yes
  (when (require 'wakatime-mode nil t)
    (setq wakatime-api-key "<insert your own api key>")
    (setq wakatime-cli-path "/Users/taka/Dropbox/emacs.d/bin/wakatime-cli.py")
    ;; すべてのバッファで訪問時に記録を開始
;    (global-wakatime-mode)
    )
#+END_SRC

* 開発サポート
** 便利キーバインド

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "C-;") 'comment-dwim) ;; M-; is the defualt
  (global-set-key (kbd "C-c c") 'compile)
#+END_SRC

** [gist.el] Gist インターフェイス

#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-autoload-if-found '(gist) "gist")
#+END_SRC

