init.html

<div id="outline-container-orgheadline123" class="outline-3">
<h3 id="orgheadline123"><span class="section-number-3">8.12</span> [backup-each-save] クラッシュに備える</h3>
<div class="outline-text-3" id="text-8-12">
<p>
直近のファイルを常にバックアップします． <code>backup-dir.el</code> でも良いですが，バックアップの目的が，バッファ編集中に <code>emacs</code> が落ちる時の保険ならば， <code>backup-each-save</code> の方が適切な場合があります．以下の例では，すべてのファイルを保存の度に保存しつつ， <code>emacs</code> 終了時に7日前までのバックアップファイルをすべて削除するようにしています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">backup-each-save</span> nil t)
  (setq backup-each-save-mirror-location <span style="color: #8b2252;">"~/.emacs.d/backup"</span>)
  (setq backup-each-save-time-format <span style="color: #8b2252;">"%y-%m-%d_%M:%S"</span>)
  (setq backup-each-save-size-limit 1048576)
  (add-hook 'after-save-hook
            '(<span style="color: #a020f0;">lambda</span> () (<span style="color: #a020f0;">unless</span> (equal (buffer-name) <span style="color: #8b2252;">"recentf"</span>)
                          (backup-each-save)))))

(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(recursive-delete-backup-files delete-backup-files)
       <span style="color: #8b2252;">"utility"</span> nil t nil
       '())
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">backup-each-save &#12364;&#20316;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#12358;&#12385;&#26465;&#20214;&#12395;&#12354;&#12358;&#12418;&#12398;&#12434;&#32066;&#20102;&#26178;&#12395;&#21066;&#38500;</span>
  (add-hook 'kill-emacs-hook '(<span style="color: #a020f0;">lambda</span> () (recursive-delete-backup-files 7))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline124" class="outline-3">
<h3 id="orgheadline124"><span class="section-number-3">8.13</span> [session.el] 様々な履歴を保存し復元に利用する</h3>
<div class="outline-text-3" id="text-8-13">
<p>
<a href="http://emacs-session.sourceforge.net/">http://emacs-session.sourceforge.net/</a><br  />
</p>

<ul class="org-ul">
<li>入力履歴の保持（検索語，表示したバッファ履歴）<br  /></li>
<li>保存時のカーソル位置の保持<br  /></li>
<li>キルリングの保持<br  /></li>
<li>変更が加えられたファイル履歴の保持<br  /></li>
</ul>

<p>
M-x session-save-session<br  />
</p>

<p>
session-undo-check を指定していると，保存時ではなくバッファを閉じるときの状態を保持する．<br  />
</p>

<p>
Org-mode と併用する場合は，my:org-reveal-session-jump の設定が必須．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       'session-initialize <span style="color: #8b2252;">"session"</span> nil t nil
       '((add-to-list 'session-globals-exclude 'org-mark-ring)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">Change save point of session.el</span>
         (setq session-save-file
               (expand-file-name <span style="color: #8b2252;">"~/Dropbox/emacs.d/.session"</span>))
         (setq session-initialize '(de-saveplace session keys menus places)
               session-globals-include '((kill-ring 100)
                                         (session-file-alist 100 t)
                                         (file-name-history 200)
                                         search-ring regexp-search-ring))
         (setq session-undo-check -1)))

  (add-hook 'after-init-hook 'session-initialize))
<span style="color: #b22222;">;; </span><span style="color: #b22222;">FIXME</span>
<span style="color: #b22222;">;;  </span><span style="color: #b22222;">(setq session-set-file-name-exclude-regexp</span>
<span style="color: #b22222;">;;        </span><span style="color: #b22222;">"^/private/\\.\\*"))</span>
<span style="color: #b22222;">;;          </span><span style="color: #b22222;">"[/\\]\\.overview\\|[/\\]\\.session\\|News[/\\]\\|^/private\\.*\\|^/var/folders\\.*"))</span>
</pre>
</div>

<p>
次はテスト中．orgバッファを開いたらカーソル位置をorg-revealしたいが，time-stampなどと組み合わせたり，org-tree-slideと組み合わせていると，うまくいかない．バッファを表示した時に org-reveal (C-c C-r) を打つのをサボりたいだけなのだが．．．<br  />
</p>

<p>
<a href="http://www.emacswiki.org/emacs/EmacsSession">http://www.emacswiki.org/emacs/EmacsSession</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (autoload-if-found 'session-initialize <span style="color: #8b2252;">"session"</span> nil t)
  (add-hook 'after-init-hook 'session-initialize)
  (eval-after-load <span style="color: #8b2252;">"session"</span>
    '(<span style="color: #a020f0;">progn</span>
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">For Org-mode</span>
       (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:maybe-reveal</span> ()
         (interactive)
         (<span style="color: #a020f0;">when</span> (and (or (memq major-mode '(org-mode outline-mode))
                        (and (boundp 'outline-minor-mominor-de)
                             outline-minor-mode))
                    (outline-invisible-p))
           (<span style="color: #a020f0;">if</span> (eq major-mode 'org-mode)
               (org-reveal)
             (show-subtree))))

       (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:org-reveal-session-jump</span> ()
         (message <span style="color: #8b2252;">"call!"</span>)
         (<span style="color: #a020f0;">when</span> (and (eq major-mode 'org-mode)
                    (outline-invisible-p))
           (org-reveal)))

       <span style="color: #b22222;">;; </span><span style="color: #b22222;">C-x C-/</span>
       (add-hook 'session-after-jump-to-last-change-hook
                 'my:maybe-reveal))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline125" class="outline-3">
<h3 id="orgheadline125"><span class="section-number-3">8.14</span> [wakatime-mode.el] WakaTime を利用して作業記録する</h3>
<div class="outline-text-3" id="text-8-14">
<ol class="org-ol">
<li><a href="https://www.wakati.me/">https://www.wakati.me/</a>（API発行とログGUI表示）<br  /></li>
<li><a href="https://github.com/wakatime/wakatime">https://github.com/wakatime/wakatime</a>（ログ記録用スクリプト）<br  /></li>
<li><a href="https://github.com/nyuhuhuu/wakatime-mode">https://github.com/nyuhuhuu/wakatime-mode</a>（Emacs用プラグイン）<br  /></li>
</ol>

<p>
利用開始前に，ログ表示サイトでルールをカスタマイズしておくとよい．例えば，拡張子が <code>.org</code> なファイルの場合，言語設定を <code>Text</code> にする，という具合に．すると，グラフ表示がわかりやすくなる．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">  (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">wakatime-mode</span> nil t)
    (setq wakatime-api-key <span style="color: #8b2252;">"&lt;insert your own api key&gt;"</span>)
    (setq wakatime-cli-path <span style="color: #8b2252;">"/Users/taka/Dropbox/emacs.d/bin/wakatime-cli.py"</span>)
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12377;&#12409;&#12390;&#12398;&#12496;&#12483;&#12501;&#12449;&#12391;&#35370;&#21839;&#26178;&#12395;&#35352;&#37682;&#12434;&#38283;&#22987;</span>
<span style="color: #b22222;">;    </span><span style="color: #b22222;">(global-wakatime-mode)</span>
    )
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline136" class="outline-2">
<h2 id="orgheadline136"><span class="section-number-2">9</span> 開発サポート</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-orgheadline127" class="outline-3">
<h3 id="orgheadline127"><span class="section-number-3">9.1</span> 便利キーバインド</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #8b2252;">"C-;"</span>) 'comment-dwim) <span style="color: #b22222;">;; </span><span style="color: #b22222;">M-; is the defualt</span>
(global-set-key (kbd <span style="color: #8b2252;">"C-c c"</span>) 'compile)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline128" class="outline-3">
<h3 id="orgheadline128"><span class="section-number-3">9.2</span> [gist.el] Gist インターフェイス</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found '(gist) <span style="color: #8b2252;">"gist"</span> nil t)
</pre>
</div>
</div>
</div>
