init.el

(when (require 'backup-each-save nil t)
  (setq backup-each-save-mirror-location "~/.emacs.d/backup")
  (setq backup-each-save-time-format "%y-%m-%d_%M:%S")
  (setq backup-each-save-size-limit 1048576)
  (add-hook 'after-save-hook
            '(lambda () (unless (equal (buffer-name) "recentf")
                          (backup-each-save)))))

(when (eval-after-autoload-if-found
       '(recursive-delete-backup-files delete-backup-files) "utility")

  ;; backup-each-save が作るファイルのうち条件にあうものを終了時に削除
  (add-hook 'kill-emacs-hook
            #'(lambda () (recursive-delete-backup-files 7))))

(when (eval-after-autoload-if-found
       'session-initialize "session" nil t nil
       '((add-to-list 'session-globals-exclude 'org-mark-ring)
         ;; Change save point of session.el
         (setq session-save-file
               (expand-file-name "~/Dropbox/emacs.d/.session"))
         (setq session-initialize '(de-saveplace session keys menus places)
               session-globals-include '((kill-ring 100)
                                         (session-file-alist 100 t)
                                         (file-name-history 200)
                                         search-ring regexp-search-ring))
         (setq session-undo-check -1)))

  (add-hook 'after-init-hook 'session-initialize))
;; FIXME
;;  (setq session-set-file-name-exclude-regexp
;;        "^/private/\\.\\*"))
;;          "[/\\]\\.overview\\|[/\\]\\.session\\|News[/\\]\\|^/private\\.*\\|^/var/folders\\.*"))

(global-set-key (kbd "C-;") 'comment-dwim) ;; M-; is the defualt
(global-set-key (kbd "C-c c") 'compile)

(eval-after-autoload-if-found '(gist) "gist")

(when (eval-after-autoload-if-found
