init.org
** [doxymacs.el] Doxygen のコメントを簡単に入力する

http://doxymacs.sourceforge.net/

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         'doxymacs-mode "doxymacs" nil t nil
         '((setq doxymacs-doxygen-style "JavaDoc")
           (add-hook 'font-lock-mode-hook
                     '(lambda () (interactive)
                        (when (or (eq major-mode 'c-mode)
                                  (eq major-mode 'c++-mode))
                          (doxymacs-font-lock))))
           (define-key doxymacs-mode-map (kbd "C-c C-s") 'ff-find-other-file)))

    (add-hook 'c-mode-common-hook 'doxymacs-mode))
#+END_SRC

** [matlab.el] Matlab用の設定

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (and (eq window-system 'ns) (> emacs-major-version 23))
    (when (eval-after-autoload-if-found
           '(matlab-mode matlab-shell) "matlab")
      (push '("\\.m$" . matlab-mode) auto-mode-alist)))
#+END_SRC

** [flycheck.el] 構文エラー表示

auto-complete より前に hook設定しておくと余計なエラーが出ないようです．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(flycheck-mode) "flycheck" nil t nil
         '(;;http://qiita.com/senda-akiha/items/cddb02cfdbc0c8c7bc2b
           (require 'helm-flycheck nil t)
           (when (require 'flycheck-pos-tip nil t)
             '(custom-set-variables
               '(flycheck-display-errors-function
                 #'flycheck-pos-tip-error-messages)))))

    (add-hook 'js2-mode-hook 'flycheck-mode)
    (add-hook 'c-mode-common-hook 'flycheck-mode)
    (add-hook 'perl-mode-hook 'flycheck-mode)
    (add-hook 'python-mode-hook 'flycheck-mode))
#+END_SRC

