init.html

<div id="outline-container-orgheadline129" class="outline-3">
<h3 id="orgheadline129"><span class="section-number-3">9.3</span> [doxymacs.el] Doxygen のコメントを簡単に入力する</h3>
<div class="outline-text-3" id="text-9-3">
<p>
<a href="http://doxymacs.sourceforge.net/">http://doxymacs.sourceforge.net/</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       'doxymacs-mode <span style="color: #8b2252;">"doxymacs"</span> nil t nil
       '((setq doxymacs-doxygen-style <span style="color: #8b2252;">"JavaDoc"</span>)
         (add-hook 'font-lock-mode-hook
                   '(<span style="color: #a020f0;">lambda</span> () (interactive)
                      (<span style="color: #a020f0;">when</span> (or (eq major-mode 'c-mode)
                                (eq major-mode 'c++-mode))
                        (doxymacs-font-lock))))
         (define-key doxymacs-mode-map (kbd <span style="color: #8b2252;">"C-c C-s"</span>) 'ff-find-other-file)))
  (add-hook 'c-mode-common-hook 'doxymacs-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline130" class="outline-3">
<h3 id="orgheadline130"><span class="section-number-3">9.4</span> [matlab.el] Matlab用の設定</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (and (eq window-system 'ns) (&gt; emacs-major-version 23))
  (eval-after-autoload-if-found
   '(matlab-mode matlab-shell) <span style="color: #8b2252;">"matlab"</span> <span style="color: #8b2252;">"Enter Matlab mode."</span> t nil
   '())
  (push '(<span style="color: #8b2252;">"\\.m$"</span> . matlab-mode) auto-mode-alist))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline131" class="outline-3">
<h3 id="orgheadline131"><span class="section-number-3">9.5</span> [flycheck.el] 構文エラー表示</h3>
<div class="outline-text-3" id="text-9-5">
<p>
auto-complete より前に hook設定しておくと余計なエラーが出ないようです．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(flychek-mode) <span style="color: #8b2252;">"flycheck"</span> nil t nil
       '(<span style="color: #b22222;">;;</span><span style="color: #b22222;">http://qiita.com/senda-akiha/items/cddb02cfdbc0c8c7bc2b</span>
         (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">flycheck-pos-tip</span> nil t)
           '(custom-set-variables
             '(flycheck-display-errors-function
               #'flycheck-pos-tip-error-messages)))))
  (add-hook 'c-mode-common-hook 'flycheck-mode)
  (add-hook 'perl-mode-hook 'flycheck-mode))
</pre>
</div>
</div>
</div>
