init.el
       'doxymacs-mode "doxymacs" nil t nil
       '((setq doxymacs-doxygen-style "JavaDoc")
         (add-hook 'font-lock-mode-hook
                   '(lambda () (interactive)
                      (when (or (eq major-mode 'c-mode)
                                (eq major-mode 'c++-mode))
                        (doxymacs-font-lock))))
         (define-key doxymacs-mode-map (kbd "C-c C-s") 'ff-find-other-file)))

  (add-hook 'c-mode-common-hook 'doxymacs-mode))

(when (and (eq window-system 'ns) (> emacs-major-version 23))
  (when (eval-after-autoload-if-found
         '(matlab-mode matlab-shell) "matlab")
    (push '("\\.m$" . matlab-mode) auto-mode-alist)))

(when (eval-after-autoload-if-found
       '(flycheck-mode) "flycheck" nil t nil
       '(;;http://qiita.com/senda-akiha/items/cddb02cfdbc0c8c7bc2b
         (require 'helm-flycheck nil t)
         (when (require 'flycheck-pos-tip nil t)
           '(custom-set-variables
             '(flycheck-display-errors-function
               #'flycheck-pos-tip-error-messages)))))

  (add-hook 'js2-mode-hook 'flycheck-mode)
  (add-hook 'c-mode-common-hook 'flycheck-mode)
  (add-hook 'perl-mode-hook 'flycheck-mode)
  (add-hook 'python-mode-hook 'flycheck-mode))

(when (eval-after-autoload-if-found
