init.org
** [auto-complete.el] 自動補完機能

http://cx4a.org/software/auto-complete/manual.ja.html

  - 辞書データを使う（ =ac-dictionary-directories= ）
  - auto-complete.el, auto-complete-config.el, fuzzy.el, popup.el を使う．
  - [[http://cx4a.org/software/auto-complete/manual.ja.html][日本語マニュアル]]
  - ac-auto-start を 4 にしておけば，3文字までは TAB を yasnippet に渡せる．

Org-mode ユーザにとって =TAB= は非常に重要なコマンド．そこに =auto-complete= と =yasnippet= が =TAB= を奪いに来るので，住み分けが重要になる．=ac-auto-start= を=4=にすると，<s=TAB= によるソースブロックの短縮入力を =yasnippet= で実行できる（この目的だけならば=3=を指定してもいい）．<sys などと4文字入力すると，=auto-complete= が動いて <system> などを補完してくれる．もちろん，見出しで =TAB= を押すときには，ツリーの表示／非表示の切り替えになる．

情報源については，[[http://cx4a.org/software/auto-complete/manual.ja.html#.E6.A8.99.E6.BA.96.E6.83.85.E5.A0.B1.E6.BA.90][オンラインマニュアル]]を参照のこと．
 
#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(ac-default-setup ac-org-mode-setup)
         "auto-complete" nil t nil
         '((require 'auto-complete-config nil t)
           (ac-config-default)
           ;; 追加のメジャーモードを設定
           (add-to-list 'ac-modes 'objc-mode)
           (add-to-list 'ac-modes 'org-mode)
           ;; ac-modes にあるメジャーモードで有効にする
           ;;lisp, c, c++, java, perl, cperl, python, makefile, sh, fortran, f90
           (global-auto-complete-mode t)
           ;; 辞書
           (add-to-list 'ac-dictionary-directories "~/.emacs.d/ac-dict")
           ;; history
           (setq ac-comphist-file "~/Dropbox/config/ac-comphist.dat")
           ;; n文字以上で補完表示する（"<s TAB" の場合 yasnippet が呼ばれる）
           (setq ac-auto-start 4)
           ;; n秒後にメニューを表示
           (setq ac-auto-show-menu 1.0)
           ;; ツールチップの表示
           (setq ac-use-quick-help t)
           (setq ac-quick-help-delay 2.0)
           (setq ac-quick-help-height 10)
           ;; C-n/C-p でメニューをたどる
           (setq ac-use-menu-map t)
           ;; TAB で補完（org-mode でも効くようにする）
           (define-key ac-completing-map [tab] 'ac-complete)
           ;; RET での補完を禁止
           (define-key ac-completing-map "\r" nil)
           ;; 補完メニューの表示精度を高める
           (setq popup-use-optimized-column-computation nil)
           ;;(setq ac-candidate-max 10)

           (defun ac-org-mode-setup ()
             ;;            (message " >> ac-org-mode-setup")
             (setq ac-sources '(
                                     ;;; ac-source-abbrev ; Emacs の略語
                                     ;;; ac-source-css-property ; heavy
                                ac-source-dictionary ; 辞書
                                ac-source-features
                                ac-source-filename
                                ac-source-files-in-current-dir
                                ac-source-functions
                                     ;;; ac-source-gtags
                                     ;;; ac-source-imenu 
                                     ;;; ac-source-semantic
                                     ;;; ac-source-symbols 
                                     ;;; ac-source-variables
                                     ;;; ac-source-yasnippet
                                )))

           (defun ac-default-setup ()
             ;;            (message " >> ac-default-setup")
             (setq ac-sources '(ac-source-abbrev
                                ac-source-dictionary
                                ac-source-words-in-same-mode-buffers)))
           ))

    (dolist (hook (list 'python-mode-hook 'perl-mode-hook 'objc-mode-hook))
      (add-hook hook 'ac-default-setup))
    ;; *scratch* バッファでは無効化
    (add-hook 'lisp-mode-hook
              '(lambda () (unless (equal "*scratch*" (buffer-name))
                            (ac-default-setup))))
    (add-hook 'org-mode-hook 'ac-org-mode-setup))
#+END_SRC

