init.html

<div id="outline-container-orgheadline132" class="outline-3">
<h3 id="orgheadline132"><span class="section-number-3">9.6</span> [auto-complete.el] 自動補完機能</h3>
<div class="outline-text-3" id="text-9-6">
<p>
<a href="http://cx4a.org/software/auto-complete/manual.ja.html">http://cx4a.org/software/auto-complete/manual.ja.html</a><br  />
</p>

<ul class="org-ul">
<li>辞書データを使う（ <code>ac-dictionary-directories</code> ）<br  /></li>
<li>auto-complete.el, auto-complete-config.el, fuzzy.el, popup.el を使う．<br  /></li>
<li><a href="http://cx4a.org/software/auto-complete/manual.ja.html">日本語マニュアル</a><br  /></li>
<li>ac-auto-start を 4 にしておけば，3文字までは TAB を yasnippet に渡せる．<br  /></li>
</ul>

<p>
Org-mode ユーザにとって <code>TAB</code> は非常に重要なコマンド．そこに <code>auto-complete</code> と <code>yasnippet</code> が <code>TAB</code> を奪いに来るので，住み分けが重要になる．=ac-auto-start= を=4=にすると，&lt;s=TAB= によるソースブロックの短縮入力を <code>yasnippet</code> で実行できる（この目的だけならば=3=を指定してもいい）．&lt;sys などと4文字入力すると，=auto-complete= が動いて &lt;system&gt; などを補完してくれる．もちろん，見出しで <code>TAB</code> を押すときには，ツリーの表示／非表示の切り替えになる．<br  />
</p>

<p>
情報源については，<a href="http://cx4a.org/software/auto-complete/manual.ja.html#.E6.A8.99.E6.BA.96.E6.83.85.E5.A0.B1.E6.BA.90">オンラインマニュアル</a>を参照のこと．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">  (<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
         '(auto-complete ac-default-setup ac-org-mode-setup ac-cc-mode-setup)
         <span style="color: #8b2252;">"auto-complete"</span> nil t nil
         '((<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">auto-complete-config</span> nil t)
           (ac-config-default)
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#36861;&#21152;&#12398;&#12513;&#12472;&#12515;&#12540;&#12514;&#12540;&#12489;&#12434;&#35373;&#23450;</span>
           (add-to-list 'ac-modes 'objc-mode)
           (add-to-list 'ac-modes 'org-mode)
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">ac-modes &#12395;&#12354;&#12427;&#12513;&#12472;&#12515;&#12540;&#12514;&#12540;&#12489;&#12391;&#26377;&#21177;&#12395;&#12377;&#12427;</span>
           <span style="color: #b22222;">;;</span><span style="color: #b22222;">lisp, c, c++, java, perl, cperl, python, makefile, sh, fortran, f90</span>
           (global-auto-complete-mode t)
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#36766;&#26360;</span>
           (add-to-list 'ac-dictionary-directories <span style="color: #8b2252;">"~/.emacs.d/ac-dict"</span>)
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">history</span>
           (setq ac-comphist-file <span style="color: #8b2252;">"~/Dropbox/config/ac-comphist.dat"</span>)
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">n&#25991;&#23383;&#20197;&#19978;&#12391;&#35036;&#23436;&#34920;&#31034;&#12377;&#12427;&#65288;"&lt;s TAB" &#12398;&#22580;&#21512; yasnippet &#12364;&#21628;&#12400;&#12428;&#12427;&#65289;</span>
           (setq ac-auto-start 4)
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">n&#31186;&#24460;&#12395;&#12513;&#12491;&#12517;&#12540;&#12434;&#34920;&#31034;</span>
           (setq ac-auto-show-menu 1.0)
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12484;&#12540;&#12523;&#12481;&#12483;&#12503;&#12398;&#34920;&#31034;</span>
           (setq ac-use-quick-help t)
           (setq ac-quick-help-delay 2.0)
           (setq ac-quick-help-height 10)
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">C-n/C-p &#12391;&#12513;&#12491;&#12517;&#12540;&#12434;&#12383;&#12393;&#12427;</span>
           (setq ac-use-menu-map t)
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">TAB &#12391;&#35036;&#23436;&#65288;org-mode &#12391;&#12418;&#21177;&#12367;&#12424;&#12358;&#12395;&#12377;&#12427;&#65289;</span>
           (define-key ac-completing-map [tab] 'ac-complete)
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">RET &#12391;&#12398;&#35036;&#23436;&#12434;&#31105;&#27490;</span>
           (define-key ac-completing-map <span style="color: #8b2252;">"\r"</span> nil)
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#35036;&#23436;&#12513;&#12491;&#12517;&#12540;&#12398;&#34920;&#31034;&#31934;&#24230;&#12434;&#39640;&#12417;&#12427;</span>
           (setq popup-use-optimized-column-computation nil)
           <span style="color: #b22222;">;;</span><span style="color: #b22222;">(setq ac-candidate-max 10)</span>

           (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">ac-org-mode-setup</span> ()
             <span style="color: #b22222;">;;            </span><span style="color: #b22222;">(message " &gt;&gt; ac-org-mode-setup")</span>
             (setq ac-sources '(
                                   <span style="color: #b22222;">;;; </span><span style="color: #b22222;">ac-source-abbrev ; Emacs &#12398;&#30053;&#35486;</span>
                                   <span style="color: #b22222;">;;; </span><span style="color: #b22222;">ac-source-css-property ; heavy</span>
                                ac-source-dictionary <span style="color: #b22222;">; </span><span style="color: #b22222;">&#36766;&#26360;</span>
                                ac-source-features
                                ac-source-filename
                                ac-source-files-in-current-dir
                                ac-source-functions
                                   <span style="color: #b22222;">;;; </span><span style="color: #b22222;">ac-source-gtags</span>
                                   <span style="color: #b22222;">;;; </span><span style="color: #b22222;">ac-source-imenu </span>
                                   <span style="color: #b22222;">;;; </span><span style="color: #b22222;">ac-source-semantic</span>
                                   <span style="color: #b22222;">;;; </span><span style="color: #b22222;">ac-source-symbols </span>
                                   <span style="color: #b22222;">;;; </span><span style="color: #b22222;">ac-source-variables</span>
                                   <span style="color: #b22222;">;;; </span><span style="color: #b22222;">ac-source-yasnippet</span>
                                )))

           (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">ac-default-setup</span> ()
             <span style="color: #b22222;">;;            </span><span style="color: #b22222;">(message " &gt;&gt; ac-default-setup")</span>
             (setq ac-sources '(ac-source-abbrev
                                ac-source-dictionary
                                ac-source-words-in-same-mode-buffers)))
           ))

    (<span style="color: #a020f0;">dolist</span> (hook (list 'perl-mode-hook 'objc-mode-hook))
      (add-hook hook 'ac-default-setup))
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">*scratch* &#12496;&#12483;&#12501;&#12449;&#12391;&#12399;&#28961;&#21177;&#21270;</span>
    (add-hook 'lisp-mode-hook
              '(<span style="color: #a020f0;">lambda</span> () (<span style="color: #a020f0;">unless</span> (equal <span style="color: #8b2252;">"*scratch*"</span> (buffer-name))
                            (ac-default-setup))))
    (add-hook 'org-mode-hook 'ac-org-mode-setup)
)
</pre>
</div>
</div>
</div>
