init.el
       '(ac-default-setup ac-org-mode-setup)
       "auto-complete" nil t nil
       '((require 'auto-complete-config nil t)
         (ac-config-default)
         ;; 追加のメジャーモードを設定
         (add-to-list 'ac-modes 'objc-mode)
         (add-to-list 'ac-modes 'org-mode)
         ;; ac-modes にあるメジャーモードで有効にする
         ;;lisp, c, c++, java, perl, cperl, python, makefile, sh, fortran, f90
         (global-auto-complete-mode t)
         ;; 辞書
         (add-to-list 'ac-dictionary-directories "~/.emacs.d/ac-dict")
         ;; history
         (setq ac-comphist-file "~/Dropbox/config/ac-comphist.dat")
         ;; n文字以上で補完表示する（"<s TAB" の場合 yasnippet が呼ばれる）
         (setq ac-auto-start 4)
         ;; n秒後にメニューを表示
         (setq ac-auto-show-menu 1.0)
         ;; ツールチップの表示
         (setq ac-use-quick-help t)
         (setq ac-quick-help-delay 2.0)
         (setq ac-quick-help-height 10)
         ;; C-n/C-p でメニューをたどる
         (setq ac-use-menu-map t)
         ;; TAB で補完（org-mode でも効くようにする）
         (define-key ac-completing-map [tab] 'ac-complete)
         ;; RET での補完を禁止
         (define-key ac-completing-map "\r" nil)
         ;; 補完メニューの表示精度を高める
         (setq popup-use-optimized-column-computation nil)
         ;;(setq ac-candidate-max 10)

         (defun ac-org-mode-setup ()
           ;;            (message " >> ac-org-mode-setup")
           (setq ac-sources '(
                                   ;;; ac-source-abbrev ; Emacs の略語
                                   ;;; ac-source-css-property ; heavy
                              ac-source-dictionary ; 辞書
                              ac-source-features
                              ac-source-filename
                              ac-source-files-in-current-dir
                              ac-source-functions
                                   ;;; ac-source-gtags
                                   ;;; ac-source-imenu 
                                   ;;; ac-source-semantic
                                   ;;; ac-source-symbols 
                                   ;;; ac-source-variables
                                   ;;; ac-source-yasnippet
                              )))

         (defun ac-default-setup ()
           ;;            (message " >> ac-default-setup")
           (setq ac-sources '(ac-source-abbrev
                              ac-source-dictionary
                              ac-source-words-in-same-mode-buffers)))
         ))

  (dolist (hook (list 'python-mode-hook 'perl-mode-hook 'objc-mode-hook))
    (add-hook hook 'ac-default-setup))
  ;; *scratch* バッファでは無効化
  (add-hook 'lisp-mode-hook
            '(lambda () (unless (equal "*scratch*" (buffer-name))
                          (ac-default-setup))))
  (add-hook 'org-mode-hook 'ac-org-mode-setup))

(when (eval-after-autoload-if-found
