init.org
** [auto-complete-clang.el] オムニ補完

C++バッファでメソッドを補完対象とする．try-catch を使っている場合， =-fcxx-exceptions= オプションが必要で，これはプリコンパイルヘッダを生成する時も同じだ．ここ示す設定では， =~/.emacs.d/= 以下に =stdafx.pch= を生成する必要があり，以下のコマンドを用いてプリコンパイルヘッダを生成する．ヘッダファイルのパスを適切に与えれば，Boostや自作のライブラリも補完対象に設定できる．

現状では，補完直後にデフォルトの引数がすべて書き込まれてしまう．なんかうまいことしたいものだ．

#+BEGIN_SRC sh
clang -cc1 -x c++-header -fcxx-exceptions ./stdafx.h -emit-pch -o ./stdafx.pch -I/usr/local/include -I/usr/local/include/netpbm
#+END_SRC

以下の設定は，先に =auto-complete.el= に関する設定を読み込んでいることを前提としている．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(auto-complete ac-cc-mode-setup) "auto-complete" nil t nil
         '((require 'auto-complete-clang nil t)
           ;; ac-cc-mode-setup のオーバーライド
           (defun ac-cc-mode-setup ()
             (setq ac-clang-prefix-header "~/.emacs.d/stdafx.pch")
             (setq ac-clang-flags '("-w" "-ferror-limit" "1"
                                    "-fcxx-exceptions"))
             (setq ac-sources '(ac-source-clang
                                ac-source-yasnippet
                                ac-source-gtags)))))

    (add-hook 'c-mode-common-hook 'ac-cc-mode-setup))
#+END_SRC 

次のコードを hoge.cpp として保存し， =v= と =t= について補完できれば， =STL= と =Boost= のプリコンパイルヘッダが有効になっていることを確認できる．

#+BEGIN_SRC cpp
  #include <iostream>
  #include <vector>
  #include <boost/timer.hpp>
  
  int main(){
    std::vector<int> v;
    v; // ここ
    boost::timer t;
    cout << t; // ここ
    return 1;
  }
#+END_SRC

*** 参考サイト

  - http://d.hatena.ne.jp/kenbell1988/20120428/1335609313
  - http://d.hatena.ne.jp/whitypig/20110306/1299416655
  - http://d.hatena.ne.jp/yano-htn/?of=30
  - http://www.nomtats.com/2010/11/auto-completeelemacs.html
  - http://www.plugmasters.com.br/plugfeed/post/73768/awesome-cc-autocompletion-in-emacs

** [hideshowvis.el] 関数の表示／非表示

  - http://www.emacswiki.org/emacs/hideshowvis.el
  - org.el（約2万行）を開くために約2分必要なため，最近は使っていません．

#+BEGIN_SRC emacs-lisp :tangle no
  (when (and (eq window-system 'ns) (> emacs-major-version 23))
    (when (eval-after-autoload-if-found
           '(hideshowvis-enable hideshowvis-minor-mode) "hideshowvis" nil t nil
           '((define-key hideshowvis-mode-map (kbd "C-(") 'hs-hide-block)
             (define-key hideshowvis-mode-map (kbd "C-)") 'hs-show-block)))

      (add-hook 'emacs-lisp-mode-hook
                '(lambda () (unless (equal "*scratch*" (buffer-name))
                              (hideshowvis-enable))))
      (dolist (hook (list 'perl-mode-hook 'c-mode-common-hook))
        (add-hook hook 'hideshowvis-enable))))
#+END_SRC

** [quickrun.el] お手軽ビルド

カレントバッファで編集中のソースコードをビルド・実行して，別バッファに結果を得ます．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(quickrun) "quickrun")

    (add-hook 'c-mode-common-hook
              '(lambda () (define-key c++-mode-map (kbd "<f5>") 'quickrun)))
    (add-hook 'python-mode-hook
              '(lambda () (define-key python-mode-map (kbd "<f5>") 'quickrun)))
    (add-hook 'perl-mode-hook
              '(lambda () (define-key perl-mode-map (kbd "<f5>") 'quickrun))))
#+END_SRC

* Org Mode
