init.html

<div id="outline-container-orgheadline134" class="outline-3">
<h3 id="orgheadline134"><span class="section-number-3">9.7</span> [auto-complete-clang.el] オムニ補完</h3>
<div class="outline-text-3" id="text-9-7">
<p>
C++バッファでメソッドを補完対象とする．try-catch を使っている場合， <code>-fcxx-exceptions</code> オプションが必要で，これはプリコンパイルヘッダを生成する時も同じだ．この設定では， <code>~/Dropbox/config/</code> 以下に <code>stdafx.pch</code> を生成する必要があるため，以下のコマンドを用いてプリコンパイルヘッダを生成する．ヘッダファイルのパスを適切に与えれば，Boostや自作のライブラリも補完対象に設定できる．<br  />
</p>

<p>
現状では，補完直後にデフォルトの引数がすべて書き込まれてしまう．なんかうまいことしたいものだ．<br  />
</p>

<div class="org-src-container">

<pre class="src src-sh">clang -cc1 -x c++-header -fcxx-exceptions ./stdafx.h -emit-pch -o ./stdafx.pch -I/opt/local/include -I/opt/local/include/netpbm
</pre>
</div>

<p>
以下の設定は，先に <code>auto-complete.el</code> に関する設定を読み込んでいることを前提としている．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(auto-complete ac-cc-mode-setup) <span style="color: #8b2252;">"auto-complete"</span> nil t nil
       '((<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">auto-complete-clang</span> nil t)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">ac-cc-mode-setup &#12398;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;</span>
         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">ac-cc-mode-setup</span> ()
           (setq ac-clang-prefix-header <span style="color: #8b2252;">"~/.emacs.d/stdafx.pch"</span>)
           (setq ac-clang-flags '(<span style="color: #8b2252;">"-w"</span> <span style="color: #8b2252;">"-ferror-limit"</span> <span style="color: #8b2252;">"1"</span>
                                  <span style="color: #8b2252;">"-fcxx-exceptions"</span>))
           (setq ac-sources '(ac-source-clang
                              ac-source-yasnippet
                              ac-source-gtags)))
         ))
  (add-hook 'c-mode-common-hook 'ac-cc-mode-setup))
</pre>
</div>

<p>
次のコードを hoge.cpp として保存し， <code>v</code> と <code>t</code> について補完できれば， <code>STL</code> と <code>Boost</code> のプリコンパイルヘッダが有効になっていることを確認できる．<br  />
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;iostream&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;vector&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;boost/timer.hpp&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(){
  <span style="color: #008b8b;">std</span>::<span style="color: #228b22;">vector</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">v</span>;
  v; <span style="color: #b22222;">// </span><span style="color: #b22222;">&#12371;&#12371;</span>
  <span style="color: #008b8b;">boost</span>::<span style="color: #228b22;">timer</span> <span style="color: #a0522d;">t</span>;
  cout &lt;&lt; t; <span style="color: #b22222;">// </span><span style="color: #b22222;">&#12371;&#12371;</span>
  <span style="color: #a020f0;">return</span> 1;
}
</pre>
</div>
</div>
<div id="outline-container-orgheadline133" class="outline-4">
<h4 id="orgheadline133"><span class="section-number-4">9.7.1</span> 参考サイト</h4>
<div class="outline-text-4" id="text-9-7-1">
<ul class="org-ul">
<li><a href="http://d.hatena.ne.jp/kenbell1988/20120428/1335609313">http://d.hatena.ne.jp/kenbell1988/20120428/1335609313</a><br  /></li>
<li><a href="http://d.hatena.ne.jp/whitypig/20110306/1299416655">http://d.hatena.ne.jp/whitypig/20110306/1299416655</a><br  /></li>
<li><a href="http://d.hatena.ne.jp/yano-htn/?of=30">http://d.hatena.ne.jp/yano-htn/?of=30</a><br  /></li>
<li><a href="http://www.nomtats.com/2010/11/auto-completeelemacs.html">http://www.nomtats.com/2010/11/auto-completeelemacs.html</a><br  /></li>
<li><a href="http://www.plugmasters.com.br/plugfeed/post/73768/awesome-cc-autocompletion-in-emacs">http://www.plugmasters.com.br/plugfeed/post/73768/awesome-cc-autocompletion-in-emacs</a><br  /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline135" class="outline-3">
<h3 id="orgheadline135"><span class="section-number-3">9.8</span> [hideshowvis.el] 関数の表示／非表示</h3>
<div class="outline-text-3" id="text-9-8">
<ul class="org-ul">
<li><a href="http://www.emacswiki.org/emacs/hideshowvis.el">http://www.emacswiki.org/emacs/hideshowvis.el</a><br  /></li>
<li>org.el（約2万行）を開くために約2分必要なため，最近は使っていません．<br  /></li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (and (eq window-system 'ns) (&gt; emacs-major-version 23))
  (<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
         '(hideshowvis-enable hideshowvis-minor-mode) <span style="color: #8b2252;">"hideshowvis"</span> nil t nil
         '((define-key hideshowvis-mode-map (kbd <span style="color: #8b2252;">"C-("</span>) 'hs-hide-block)
           (define-key hideshowvis-mode-map (kbd <span style="color: #8b2252;">"C-)"</span>) 'hs-show-block)))

    (add-hook 'emacs-lisp-mode-hook
              '(<span style="color: #a020f0;">lambda</span> () (<span style="color: #a020f0;">unless</span> (equal <span style="color: #8b2252;">"*scratch*"</span> (buffer-name))
                            (hideshowvis-enable))))
    (<span style="color: #a020f0;">dolist</span> (hook (list 'perl-mode-hook 'c-mode-common-hook))
      (add-hook hook 'hideshowvis-enable))))
</pre>
</div>
</div>
</div>
</div>
