init.el
       '(auto-complete ac-cc-mode-setup) "auto-complete" nil t nil
       '((require 'auto-complete-clang nil t)
         ;; ac-cc-mode-setup のオーバーライド
         (defun ac-cc-mode-setup ()
           (setq ac-clang-prefix-header "~/.emacs.d/stdafx.pch")
           (setq ac-clang-flags '("-w" "-ferror-limit" "1"
                                  "-fcxx-exceptions"))
           (setq ac-sources '(ac-source-clang
                              ac-source-yasnippet
                              ac-source-gtags)))))

  (add-hook 'c-mode-common-hook 'ac-cc-mode-setup))

(when (eval-after-autoload-if-found
       '(quickrun) "quickrun")

  (add-hook 'c-mode-common-hook
            '(lambda () (define-key c++-mode-map (kbd "<f5>") 'quickrun)))
  (add-hook 'python-mode-hook
            '(lambda () (define-key python-mode-map (kbd "<f5>") 'quickrun)))
  (add-hook 'perl-mode-hook
            '(lambda () (define-key perl-mode-map (kbd "<f5>") 'quickrun))))

(when (eval-after-autoload-if-found
       'org-mode "org" "Org Mode" t nil
