init.org
** 基本設定
#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         'org-mode "org" "Org Mode" t nil
         '((require 'org-extension nil t)
           (require 'org-habit)
           (require 'org-mobile)

           ;;     (when (require 'pomodoro nil t)
           ;;       (pomodoro:start nil))

           ;; C-c & が yasnippet にオーバーライドされているのを張り替える
           (define-key org-mode-map (kbd "C-c 4") 'org-mark-ring-goto)

           ;; Set checksum program path for windows
           (when (eq window-system 'w32)
             (setq org-mobile-checksum-binary "~/Dropbox/do/cksum.exe"))

           ;; org ファイルの集中管理
           (setq org-directory "~/Dropbox/org/")

           ;; Set default table export format
           (setq org-table-export-default-format "orgtbl-to-csv")

           ;; Toggle inline images display at startup
           (setq org-startup-with-inline-images t)

           ;; dvipng
           (setq org-export-with-LaTeX-fragments t)

           ;; orgバッファ内の全ての動的ブロックを保存直前に変更する
           ;; (add-hook 'before-save-hook 'org-update-all-dblocks)

           ;; アーカイブファイルの名称を指定
           (setq org-archive-location "%s_archive::")

           ;; タイムスタンプによるログ収集設定
           (setq org-log-done t) ; t ではなく，'(done), '(state) を指定できる

           ;; ログをドロアーに入れる
           (setq org-log-into-drawer t)

           ;; アンダースコアをエクスポートしない（_{}で明示的に表現できる）
           (setq org-export-with-sub-superscripts nil)

           ;; #+OPTIONS: \n:t と同じ
           (setq org-export-preserve-breaks t)

           ;; タイマーの音
           ;; (lsetq org-clock-sound "");

           ;; helm を立ち上げる
           (require 'helm-config nil t)

           ;; - を優先．親のブリッツ表示を継承させない
           (setq org-list-demote-modify-bullet
                 '(("+" . "-")
                   ("*" . "-")
                   ("1." . "-")
                   ("1)" . "-")
                   ("A)" . "-")
                   ("B)" . "-")
                   ("a)" . "-")
                   ("b)" . "-")
                   ("A." . "-")
                   ("B." . "-")
                   ("a." . "-")
                   ("b." . "-")))
           ))

    (push '("\\.txt$" . org-mode) auto-mode-alist))
#+END_SRC

** contribution を使う
#+BEGIN_SRC emacs-lisp :tangle no
(setq load-path (append '("~/devel/git/org-mode/contrib/lisp") load-path))
#+END_SRC

