init.html

<div id="outline-container-orgheadline168" class="outline-2">
<h2 id="orgheadline168"><span class="section-number-2">10</span> Org Mode</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-orgheadline137" class="outline-3">
<h3 id="orgheadline137"><span class="section-number-3">10.1</span> 基本設定</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">  (eval-after-autoload-if-found
   'org-mode <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
   '((<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">org-extension</span> nil t)
     (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">org-habit</span>)
     (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">org-mobile</span>)

<span style="color: #b22222;">;;     </span><span style="color: #b22222;">(when (require 'pomodoro nil t)</span>
<span style="color: #b22222;">;;       </span><span style="color: #b22222;">(pomodoro:start nil))</span>

     (push '(<span style="color: #8b2252;">"\\.org$"</span> . org-mode) auto-mode-alist)
     (push '(<span style="color: #8b2252;">"\\.txt$"</span> . org-mode) auto-mode-alist)

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">C-c &amp; &#12364; yasnippet &#12395;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12434;&#24373;&#12426;&#26367;&#12360;&#12427;</span>
     (define-key org-mode-map (kbd <span style="color: #8b2252;">"C-c 4"</span>) 'org-mark-ring-goto)

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">Set checksum program path for windows</span>
     (<span style="color: #a020f0;">when</span> (eq window-system 'w32)
       (setq org-mobile-checksum-binary <span style="color: #8b2252;">"~/Dropbox/do/cksum.exe"</span>))

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">org &#12501;&#12449;&#12452;&#12523;&#12398;&#38598;&#20013;&#31649;&#29702;</span>
     (setq org-directory <span style="color: #8b2252;">"~/Dropbox/org/"</span>)

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">Set default table export format</span>
     (setq org-table-export-default-format <span style="color: #8b2252;">"orgtbl-to-csv"</span>)

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">Toggle inline images display at startup</span>
     (setq org-startup-with-inline-images t)

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">dvipng</span>
     (setq org-export-with-LaTeX-fragments t)

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">org&#12496;&#12483;&#12501;&#12449;&#20869;&#12398;&#20840;&#12390;&#12398;&#21205;&#30340;&#12502;&#12525;&#12483;&#12463;&#12434;&#20445;&#23384;&#30452;&#21069;&#12395;&#22793;&#26356;&#12377;&#12427;</span>
     <span style="color: #b22222;">;; </span><span style="color: #b22222;">(add-hook 'before-save-hook 'org-update-all-dblocks)</span>

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12450;&#12540;&#12459;&#12452;&#12502;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#31216;&#12434;&#25351;&#23450;</span>
     (setq org-archive-location <span style="color: #8b2252;">"%s_archive::"</span>)

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12479;&#12452;&#12512;&#12473;&#12479;&#12531;&#12503;&#12395;&#12424;&#12427;&#12525;&#12464;&#21454;&#38598;&#35373;&#23450;</span>
     (setq org-log-done t) <span style="color: #b22222;">; </span><span style="color: #b22222;">t &#12391;&#12399;&#12394;&#12367;&#65292;'(done), '(state) &#12434;&#25351;&#23450;&#12391;&#12365;&#12427;</span>

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12525;&#12464;&#12434;&#12489;&#12525;&#12450;&#12540;&#12395;&#20837;&#12428;&#12427;</span>
     (setq org-log-into-drawer t)

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12434;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12375;&#12394;&#12356;&#65288;_{}&#12391;&#26126;&#31034;&#30340;&#12395;&#34920;&#29694;&#12391;&#12365;&#12427;&#65289;</span>
     (setq org-export-with-sub-superscripts nil)

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">#+OPTIONS: \n:t &#12392;&#21516;&#12376;</span>
     (setq org-export-preserve-breaks t)

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12479;&#12452;&#12510;&#12540;&#12398;&#38899;</span>
     <span style="color: #b22222;">;; </span><span style="color: #b22222;">(lsetq org-clock-sound "");</span>

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">helm &#12434;&#31435;&#12385;&#19978;&#12370;&#12427;</span>
     (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">helm-config</span> nil t)

     <span style="color: #b22222;">;; </span><span style="color: #b22222;">- &#12434;&#20778;&#20808;&#65294;&#35242;&#12398;&#12502;&#12522;&#12483;&#12484;&#34920;&#31034;&#12434;&#32153;&#25215;&#12373;&#12379;&#12394;&#12356;</span>
     (setq org-list-demote-modify-bullet
           '((<span style="color: #8b2252;">"+"</span> . <span style="color: #8b2252;">"-"</span>)
             (<span style="color: #8b2252;">"*"</span> . <span style="color: #8b2252;">"-"</span>)
             (<span style="color: #8b2252;">"1."</span> . <span style="color: #8b2252;">"-"</span>)
             (<span style="color: #8b2252;">"1)"</span> . <span style="color: #8b2252;">"-"</span>)
             (<span style="color: #8b2252;">"A)"</span> . <span style="color: #8b2252;">"-"</span>)
             (<span style="color: #8b2252;">"B)"</span> . <span style="color: #8b2252;">"-"</span>)
             (<span style="color: #8b2252;">"a)"</span> . <span style="color: #8b2252;">"-"</span>)
             (<span style="color: #8b2252;">"b)"</span> . <span style="color: #8b2252;">"-"</span>)
             (<span style="color: #8b2252;">"A."</span> . <span style="color: #8b2252;">"-"</span>)
             (<span style="color: #8b2252;">"B."</span> . <span style="color: #8b2252;">"-"</span>)
             (<span style="color: #8b2252;">"a."</span> . <span style="color: #8b2252;">"-"</span>)
             (<span style="color: #8b2252;">"b."</span> . <span style="color: #8b2252;">"-"</span>)))
     ))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline138" class="outline-3">
<h3 id="orgheadline138"><span class="section-number-3">10.2</span> contribution を使う</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq load-path (append '(<span style="color: #8b2252;">"~/devel/git/org-mode/contrib/lisp"</span>) load-path))
</pre>
</div>
</div>
</div>
