init.org
** iCal との連携
#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org"
    ;; ~/Dropbox/Public は第三者に探索される可能性があるので要注意
    ;; default = ~/org.ics
    ;; C-c C-e i org-export-icalendar-this-file
    ;; C-c C-e I org-export-icalendar-all-agenda-files
    ;; C-c C-e c org-export-icalendar-all-combine-agenda-files
    ;; (setq org-combined-agenda-icalendar-file "~/Dropbox/Public/orgAgenda.ics")
  
    (setq org-icalendar-combined-agenda-file "~/Desktop/org-ical.ics")
  
    ;; iCal の説明文
    (setq org-icalendar-combined-description "OrgModeのスケジュール出力")
    ;; カレンダーに適切なタイムゾーンを設定する（google 用には nil が必要）
    (setq org-icalendar-timezone "Asia/Tokyo")
  
    ;; DONE になった TODO はアジェンダから除外する
    (setq org-icalendar-include-todo t)
    ;; （通常は，<>--<> で区間付き予定をつくる．非改行入力で日付がNoteに入らない）
    (setq org-icalendar-use-scheduled '(event-if-todo))
           ;;; DL 付きで終日予定にする：締め切り日（スタンプで時間を指定しないこと）
    ;; (setq org-icalendar-use-deadline '(event-if-todo event-if-not-todo))
    (setq org-icalendar-use-deadline '(event-if-todo))
  
    (when (require 'ox-icalendar nil t)
      (defun my:ox-icalendar ()
        (interactive)
        (let ((temp-agenda-files org-agenda-files))
          (setq org-agenda-files '("~/Dropbox/org/org-ical.org"))
          ;; org-icalendar-export-to-ics を使うとクリップボードが荒れる
          (org-icalendar-combine-agenda-files)
          (setq org-agenda-files temp-agenda-files)
          ;; Dropbox/Public のフォルダに公開する
          ;;           (shell-command
          ;;            (concat "cp " org-icalendar-combined-agenda-file " "
          ;;                    org-icalendar-dropbox-agenda-file))
          (if (eq 0 (shell-command
                     (concat "scp -o ConnectTimeout=5 "
                             org-icalendar-combined-agenda-file " "
                             org-ical-file-in-orz-server)))
              (message "Uploading... [DONE]")
            (message "Uploading... [MISS]"))
          (my:ox-icalendar-cleanup)
          ))

      (defun my:ox-icalendar-cleanup ()
        (interactive)
        (when (file-exists-p
               (expand-file-name org-icalendar-combined-agenda-file))
          (shell-command-to-string
           (concat "rm -rf " org-icalendar-combined-agenda-file))))
      ;;     (add-hook 'focus-out-hook 'my:ox-icalendar-cleanup)
      ))
#+END_SRC

** スピードコマンド

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org"
    (setq org-use-speed-commands t)
    (add-to-list 'org-speed-commands-user '("d" org-todo "DONE"))
    (add-to-list 'org-speed-commands-user '("P" my:proportional-font-toggle))
    (add-to-list 'org-speed-commands-user 
                 '("$" call-interactively 'org-archive-subtree)))
#+END_SRC

