init.org
** Pomodoro

http://orgmode.org/worg/org-gtd-etc.html

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org"
    (add-to-list 'org-modules 'org-timer)
    (setq org-timer-default-timer "25")
    ;; (add-hook 'org-clock-in-hook
    ;;        '(lamda ()
    ;;                (if (not org-timer-current-timer)
    ;;                    (org-timer-set-timer '(16)))))

    (setq growl-pomodoro-default-task-name "doing the task")
    (setq growl-pomodoro-task-name 'growl-pomodoro-default-task-name)

    (defun set-growl-pomodoro-task-name ()
      (interactive "P")
      (setq growl-pomodoro-task-name
            (read-from-minibuffer "Task Name: " growl-pomodoro-default-task-name)))
    (add-hook 'org-timer-set-hook 'set-growl-pomodoro-task-name)

    (defun growl-pomodoro-timer ()
      (interactive)
      (shell-command-to-string
       (concat "growlnotify -s -a Emacs -t \"++ Pomodoro ++\" -m \""
               "The end of " growl-pomodoro-task-name "!\""))
      (shell-command-to-string
                                          ;   (concat "say The end of " growl-pomodoro-task-name)
       (concat "say -v Kyoko " growl-pomodoro-task-name)
       ))
    (add-hook 'org-timer-done-hook 'growl-pomodoro-timer))
#+END_SRC

