init.html

<div id="outline-container-orgheadline141" class="outline-3">
<h3 id="orgheadline141"><span class="section-number-3">10.5</span> Pomodoro</h3>
<div class="outline-text-3" id="text-10-5">
<p>
<a href="http://orgmode.org/worg/org-gtd-etc.html">http://orgmode.org/worg/org-gtd-etc.html</a><br  />
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
'org-mode <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
'(  
       (add-to-list 'org-modules 'org-timer)
       (setq org-timer-default-timer 25)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(add-hook 'org-clock-in-hook</span>
<span style="color: #b22222;">;;        </span><span style="color: #b22222;">'(lamda ()</span>
<span style="color: #b22222;">;;                </span><span style="color: #b22222;">(if (not org-timer-current-timer)</span>
<span style="color: #b22222;">;;                    </span><span style="color: #b22222;">(org-timer-set-timer '(16)))))</span>

       (setq growl-pomodoro-default-task-name <span style="color: #8b2252;">"doing the task"</span>)
       (setq growl-pomodoro-task-name 'growl-pomodoro-default-task-name)

       (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">set-growl-pomodoro-task-name</span> ()
         (interactive <span style="color: #8b2252;">"P"</span>)
         (setq growl-pomodoro-task-name
               (read-from-minibuffer <span style="color: #8b2252;">"Task Name: "</span> growl-pomodoro-default-task-name)))
       (add-hook 'org-timer-set-hook 'set-growl-pomodoro-task-name)

       (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">growl-pomodoro-timer</span> ()
         (interactive)
         (shell-command-to-string
          (concat <span style="color: #8b2252;">"growlnotify -s -a Emacs -t \"++ Pomodoro ++\" -m \""</span>
                  <span style="color: #8b2252;">"The end of "</span> growl-pomodoro-task-name <span style="color: #8b2252;">"!\""</span>))
         (shell-command-to-string
          <span style="color: #b22222;">;   </span><span style="color: #b22222;">(concat "say The end of " growl-pomodoro-task-name)</span>
          (concat <span style="color: #8b2252;">"say -v Kyoko "</span> growl-pomodoro-task-name)
          ))
       (add-hook 'org-timer-done-hook 'growl-pomodoro-timer)
))
</pre>
</div>
</div>
</div>
