init.org
** face 関連
#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org"
    ;; Font lock を使う
    (global-font-lock-mode 1)
    (add-hook 'org-mode-hook 'turn-on-font-lock)
    ;; ウィンドウの端で折り返す（想定と逆の振る舞い．どこかにバグがある）
    (setq org-startup-truncated nil)
    ;; サブツリー以下の * を略式表示する
    (setq org-hide-leading-stars t)
    ;; Color setting for TODO keywords
    ;; Color for priorities
    ;; (setq org-priority-faces
    ;;  '(("?A" :foreground "#E01B4C" :background "#FFFFFF" :weight bold)
    ;;    ("?B" :foreground "#1739BF" :background "#FFFFFF" :weight bold)
    ;;    ("?C" :foreground "#575757" :background "#FFFFFF" :weight bold)))
    ;; Color setting for Tags

    ;; #CC3333     
    (setq org-todo-keyword-faces
          '(("FOCUS"   :foreground "#FF0000" :background "#FFCC66")
            ("BUG"     :foreground "#FF0000" :background "#FFCC66")
            ("OTW"     :foreground "#EE3300" :background "#FFEE99")
            ("CHECK"   :foreground "#FF9900" :background "#FFF0F0" :underline t)
            ("ICAL"    :foreground "#33CC66")
            ("WAIT"    :foreground "#CCCCCC" :background "#666666")
            ("EDIT"    :foreground "#FF33CC")
            ("READ"    :foreground "#9933CC")
            ("MAIL"    :foreground "#CC3300")
            ("PLAN"    :foreground "#FF6600")
            ("REV1"    :foreground "#3366FF")
            ("REV2"    :foreground "#3366FF" :background "#99CCFF")
            ("REV3"    :foreground "#FFFFFF" :background "#3366FF")
            ("SLEEP"    :foreground "#9999CC")))

    ;; (:foreground "#0000FF" :bold t)     ; default. do NOT put this bottom    
    (setq org-tag-faces
          '(("Achievement" :foreground "#66CC66")
            ("Report"      :foreground "#66CC66")
            ("Background"  :foreground "#66CC99")
            ("Chore"       :foreground "#6699CC")
            ("Domestic"    :foreground "#6666CC")
            ("Doing"       :foreground "#FF0000")   
            ("Ongoing"     :foreground "#CC6666") ; for non scheduled/reminder
            ("Repeat"      :foreground "#CC9999") ; for interval tasks
            ("Mag"         :foreground "#9966CC")
            ("buy"         :foreground "#9966CC")
            ("pay"         :foreground "#CC6699")
            ("secret"      :foreground "#FF0000")
            ("note"        :foreground "#6633CC")
            ("print"       :foreground "#6633CC")
            ("Study"       :foreground "#6666CC")
            ("Implements"  :foreground "#CC9999" :weight bold)
            ("Coding"      :foreground "#CC9999")
            ("Editing"     :foreground "#CC9999" :weight bold)
            ("work"        :foreground "#CC9999" :weight bold)
            ("Survey"      :foreground "#CC9999" :weight bold)
            ("Home"        :foreground "#CC9999" :weight bold)
            ("Open"        :foreground "#CC9999" :weight bold)
            ("Blog"        :foreground "#FF33CC" :background "#9966CC")
            ("Test"        :foreground "#FF0000" :weight bold)
            ("drill"       :foreground "#66BB66" :underline t)
            ("DEBUG"       :foreground "#FFFFFF" :background "#9966CC")
            ("EVENT"       :foreground "#FFFFFF" :background "#9966CC")
            ("Thinking"    :foreground "#FFFFFF" :background "#96A9FF")
            ("Schedule"    :foreground "#FFFFFF" :background "#FF7D7D")
            ("INPUT"       :foreground "#FFFFFF" :background "#CC6666")
            ("OUTPUT"      :foreground "#FFFFFF" :background "#66CC99")
            ("CYCLE"       :foreground "#FFFFFF" :background "#6699CC")
            ("weekend"     :foreground "#FFFFFF" :background "#CC6666")
            ("Log"         :foreground "#008500"))))
  ;;#5BDF8D
#+END_SRC

