init.html

<div id="outline-container-orgheadline142" class="outline-3">
<h3 id="orgheadline142"><span class="section-number-3">10.6</span> face 関連</h3>
<div class="outline-text-3" id="text-10-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-mode <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
 '( 
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Font lock &#12434;&#20351;&#12358;</span>
   (global-font-lock-mode 1)
   (add-hook 'org-mode-hook 'turn-on-font-lock)
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12454;&#12451;&#12531;&#12489;&#12454;&#12398;&#31471;&#12391;&#25240;&#12426;&#36820;&#12377;&#65288;&#24819;&#23450;&#12392;&#36870;&#12398;&#25391;&#12427;&#33310;&#12356;&#65294;&#12393;&#12371;&#12363;&#12395;&#12496;&#12464;&#12364;&#12354;&#12427;&#65289;</span>
   (setq org-startup-truncated nil)
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12469;&#12502;&#12484;&#12522;&#12540;&#20197;&#19979;&#12398; * &#12434;&#30053;&#24335;&#34920;&#31034;&#12377;&#12427;</span>
   (setq org-hide-leading-stars t)
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Color setting for TODO keywords</span>
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Color for priorities</span>
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq org-priority-faces</span>
   <span style="color: #b22222;">;;  </span><span style="color: #b22222;">'(("?A" :foreground "</span><span style="color: #ffffff; background-color: #E01B4C;">#E01B4C</span><span style="color: #b22222;">" :background "</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #b22222;">" :weight bold)</span>
   <span style="color: #b22222;">;;    </span><span style="color: #b22222;">("?B" :foreground "</span><span style="color: #ffffff; background-color: #1739BF;">#1739BF</span><span style="color: #b22222;">" :background "</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #b22222;">" :weight bold)</span>
   <span style="color: #b22222;">;;    </span><span style="color: #b22222;">("?C" :foreground "</span><span style="color: #ffffff; background-color: #575757;">#575757</span><span style="color: #b22222;">" :background "</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #b22222;">" :weight bold)))</span>
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Color setting for Tags</span>

   <span style="color: #b22222;">;; </span><span style="color: #ffffff; background-color: #CC3333;">#CC3333</span><span style="color: #b22222;">     </span>
   (setq org-todo-keyword-faces
         '((<span style="color: #8b2252;">"FOCUS"</span>   <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF0000;">#FF0000</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFCC66;">#FFCC66</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"BUG"</span>     <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF0000;">#FF0000</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFCC66;">#FFCC66</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"OTW"</span>     <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #EE3300;">#EE3300</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFEE99;">#FFEE99</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"CHECK"</span>   <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FF9900;">#FF9900</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFF0F0;">#FFF0F0</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:underline</span> t)
           (<span style="color: #8b2252;">"ICAL"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #33CC66;">#33CC66</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"WAIT"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #CCCCCC;">#CCCCCC</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #666666;">#666666</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"EDIT"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF33CC;">#FF33CC</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"READ"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #9933CC;">#9933CC</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"MAIL"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #CC3300;">#CC3300</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"PLAN"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF6600;">#FF6600</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"REV1"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #3366FF;">#3366FF</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"REV2"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #3366FF;">#3366FF</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #99CCFF;">#99CCFF</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"REV3"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #3366FF;">#3366FF</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"SLEEP"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #9999CC;">#9999CC</span><span style="color: #8b2252;">"</span>)))

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">(:foreground "</span><span style="color: #ffffff; background-color: #0000FF;">#0000FF</span><span style="color: #b22222;">" :bold t)     ; default. do NOT put this bottom    </span>
   (setq org-tag-faces
         '((<span style="color: #8b2252;">"Achievement"</span> <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #66CC66;">#66CC66</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"Report"</span>      <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #66CC66;">#66CC66</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"Background"</span>  <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #66CC99;">#66CC99</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"Chore"</span>       <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #6699CC;">#6699CC</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"Domestic"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #6666CC;">#6666CC</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"Doing"</span>       <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF0000;">#FF0000</span><span style="color: #8b2252;">"</span>)   
           (<span style="color: #8b2252;">"Ongoing"</span>     <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #CC6666;">#CC6666</span><span style="color: #8b2252;">"</span>) <span style="color: #b22222;">; </span><span style="color: #b22222;">for non scheduled/reminder</span>
           (<span style="color: #8b2252;">"Repeat"</span>      <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #CC9999;">#CC9999</span><span style="color: #8b2252;">"</span>) <span style="color: #b22222;">; </span><span style="color: #b22222;">for interval tasks</span>
           (<span style="color: #8b2252;">"Mag"</span>         <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #9966CC;">#9966CC</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"buy"</span>         <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #9966CC;">#9966CC</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"pay"</span>         <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #CC6699;">#CC6699</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"secret"</span>      <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF0000;">#FF0000</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"note"</span>        <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #6633CC;">#6633CC</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"print"</span>       <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #6633CC;">#6633CC</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"Implements"</span>  <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #CC9999;">#CC9999</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:weight</span> bold)
           (<span style="color: #8b2252;">"Coding"</span>      <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #CC9999;">#CC9999</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"Editing"</span>     <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #CC9999;">#CC9999</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:weight</span> bold)
           (<span style="color: #8b2252;">"work"</span>        <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #CC9999;">#CC9999</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:weight</span> bold)
           (<span style="color: #8b2252;">"Survey"</span>      <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #CC9999;">#CC9999</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:weight</span> bold)
           (<span style="color: #8b2252;">"Home"</span>        <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #CC9999;">#CC9999</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:weight</span> bold)
           (<span style="color: #8b2252;">"Open"</span>        <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #CC9999;">#CC9999</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:weight</span> bold)
           (<span style="color: #8b2252;">"Blog"</span>        <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF33CC;">#FF33CC</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #9966CC;">#9966CC</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"Test"</span>        <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF0000;">#FF0000</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:weight</span> bold)
           (<span style="color: #8b2252;">"drill"</span>       <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #66BB66;">#66BB66</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:underline</span> t)
           (<span style="color: #8b2252;">"DEBUG"</span>       <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #9966CC;">#9966CC</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"EVENT"</span>       <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #9966CC;">#9966CC</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"Thinking"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #96A9FF;">#96A9FF</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"Schedule"</span>    <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FF7D7D;">#FF7D7D</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"INPUT"</span>       <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #CC6666;">#CC6666</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"OUTPUT"</span>      <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #66CC99;">#66CC99</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"CYCLE"</span>       <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #6699CC;">#6699CC</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"weekend"</span>     <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFFFFF;">#FFFFFF</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #CC6666;">#CC6666</span><span style="color: #8b2252;">"</span>)
           (<span style="color: #8b2252;">"Log"</span>         <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #008500;">#008500</span><span style="color: #8b2252;">"</span>)))))
<span style="color: #b22222;">;;</span><span style="color: #000000; background-color: #5BDF8D;">#5BDF8D</span>
</pre>
</div>
</div>
</div>
