init.org
** TODOキーワードのカスタマイズ

キーワードには日本語も使えます．

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org"
    (setq org-todo-keywords
          '((sequence "TODO(t)" "FOCUS(f)" "ICAL(c)" "|" "DONE(d)")
            (sequence "BUG(b)" "READ(r)" "EDIT(e)" "MAIL(m)" "PLAN(p)" "|")
            (sequence "CHECK(C)" "OTW(o)" "WAIT(w)" "SLEEP(s)" "|")
            (sequence "REV1(1)" "REV2(2)" "REV3(3)" "|")))

    ;; Global counting of TODO items
    (setq org-hierarchical-todo-statistics nil)
    ;; Global counting of checked TODO items
    (setq org-hierarchical-checkbox-statistics nil)

    ;; block-update-time
    (defun org-dblock-write:block-update-time (params)
      (let ((fmt (or (plist-get params :format) "%Y-%m-%d")))
        (insert "" (format-time-string fmt (current-time)))))

    ;; すべてのチェックボックスの cookies を更新する
    (defun do-org-update-statistics-cookies ()
      (interactive)
      (org-update-statistics-cookies 'all)))

#+END_SRC

** ImageMagick を使って様々な画像をインライン表示する

システムに OpenJPEG と ImageMagick がインストールされていれば，JPEG 2000 などの画像形式もバッファに表示できます．

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org"
    (setq org-image-actual-width '(256))
    (add-to-list 'image-file-name-extensions "jp2")
    ;; (add-to-list 'image-file-name-extensions "j2c")
    (add-to-list 'image-file-name-extensions "bmp")
    (add-to-list 'image-file-name-extensions "psd"))
#+END_SRC

次の例では，同じ画像を2度インライン表示しようと指定ますが，前者は横幅が128ピクセルで表示され，後者は =org-image-actual-width= で指定した256ピクセルで表示されます．

#+BEGIN_SRC emacs-lisp :tangle no
#+ATTR_HTML: :width 128
[[~/Desktop/lena_std.jp2]]

[[~/Desktop/lena_std.jp2]]
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (org-toggle-inline-images)
#+END_SRC

