init.html

<div id="outline-container-orgheadline143" class="outline-3">
<h3 id="orgheadline143"><span class="section-number-3">10.7</span> <span class="todo TODO">TODO</span> キーワードのカスタマイズ</h3>
<div class="outline-text-3" id="text-10-7">
<p>
キーワードには日本語も使えます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-mode <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
 '((setq org-todo-keywords
         '((sequence <span style="color: #8b2252;">"TODO(t)"</span> <span style="color: #8b2252;">"FOCUS(f)"</span> <span style="color: #8b2252;">"ICAL(c)"</span> <span style="color: #8b2252;">"|"</span> <span style="color: #8b2252;">"DONE(d)"</span>)
           (sequence <span style="color: #8b2252;">"BUG(b)"</span> <span style="color: #8b2252;">"READ(r)"</span> <span style="color: #8b2252;">"EDIT(e)"</span> <span style="color: #8b2252;">"MAIL(m)"</span> <span style="color: #8b2252;">"PLAN(p)"</span> <span style="color: #8b2252;">"|"</span>)
           (sequence <span style="color: #8b2252;">"CHECK(C)"</span> <span style="color: #8b2252;">"OTW(o)"</span> <span style="color: #8b2252;">"WAIT(w)"</span> <span style="color: #8b2252;">"SLEEP(s)"</span> <span style="color: #8b2252;">"|"</span>)
           (sequence <span style="color: #8b2252;">"REV1(1)"</span> <span style="color: #8b2252;">"REV2(2)"</span> <span style="color: #8b2252;">"REV3(3)"</span> <span style="color: #8b2252;">"|"</span>)))

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Global counting of TODO items</span>
   (setq org-hierarchical-todo-statistics nil)
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Global counting of checked TODO items</span>
   (setq org-hierarchical-checkbox-statistics nil)

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">block-update-time</span>
   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">org-dblock-write:block-update-time</span> (params)
     (<span style="color: #a020f0;">let</span> ((fmt (or (plist-get params <span style="color: #483d8b;">:format</span>) <span style="color: #8b2252;">"%Y-%m-%d"</span>)))
       (insert <span style="color: #8b2252;">""</span> (format-time-string fmt (current-time)))))

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12377;&#12409;&#12390;&#12398;&#12481;&#12455;&#12483;&#12463;&#12508;&#12483;&#12463;&#12473;&#12398; cookies &#12434;&#26356;&#26032;&#12377;&#12427;</span>
   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">do-org-update-statistics-cookies</span> ()
     (interactive)
     (org-update-statistics-cookies 'all))
   ))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline144" class="outline-3">
<h3 id="orgheadline144"><span class="section-number-3">10.8</span> ImageMagick を使って様々な画像をインライン表示する</h3>
<div class="outline-text-3" id="text-10-8">
<p>
システムに OpenJPEG と ImageMagick がインストールされていれば，JPEG 2000 などの画像形式もバッファに表示できます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-agenda <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
 '((setq org-image-actual-width '(256))
   (add-to-list 'image-file-name-extensions <span style="color: #8b2252;">"jp2"</span>)
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">(add-to-list 'image-file-name-extensions "j2c")</span>
   (add-to-list 'image-file-name-extensions <span style="color: #8b2252;">"bmp"</span>)
   (add-to-list 'image-file-name-extensions <span style="color: #8b2252;">"psd"</span>)))
</pre>
</div>

<p>
次の例では，同じ画像を2度インライン表示しようと指定ますが，前者は横幅が128ピクセルで表示され，後者は <code>org-image-actual-width</code> で指定した256ピクセルで表示されます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">#+ATTR_HTML: <span style="color: #483d8b;">:width</span> 128
[[~/Desktop/lena_std.jp2]]

[[~/Desktop/lena_std.jp2]]
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-toggle-inline-images)
</pre>
</div>
</div>
</div>
