init.html

<div id="outline-container-orgheadline145" class="outline-3">
<h3 id="orgheadline145"><span class="section-number-3">10.9</span> [org-agenda]</h3>
<div class="outline-text-3" id="text-10-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-agenda <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
 '(<span style="color: #b22222;">;; </span><span style="color: #b22222;">Set the view span as day in an agenda view, the default is week</span>
   (setq org-agenda-span 'day)
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12450;&#12472;&#12455;&#12531;&#12480;&#12395;&#35686;&#21578;&#12434;&#34920;&#31034;&#12377;&#12427;&#26399;&#38291;</span>
   (setq org-deadline-warning-days 2)
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12450;&#12472;&#12455;&#12531;&#12480;&#12499;&#12517;&#12540;&#12391;FOLLOW&#12434;&#35373;&#23450;</span>
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq org-agenda-start-with-follow-mode t)</span>
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Customized Time Grid</span>
   (setq org-agenda-time-grid
         '((daily today require-timed)
           <span style="color: #8b2252;">"----------------"</span>
           (800 1000 1200 1400 1600 1800 2000 2200 2400 2600)))
   (setq org-agenda-current-time-string <span style="color: #8b2252;">"&lt; d('- ' ) now!"</span>)
   (setq org-agenda-timegrid-use-ampm t)

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12450;&#12472;&#12455;&#12531;&#12480;&#20316;&#25104;&#23550;&#35937;&#65288;&#25351;&#23450;&#12375;&#12394;&#12356;&#12392;agenda&#12364;&#29983;&#25104;&#12373;&#12428;&#12394;&#12356;&#65289;</span>
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12371;&#12371;&#12434;&#38291;&#36949;&#12358;&#12392;&#65292;MobileOrg, iCal export &#12418;&#12358;&#12414;&#12367;&#12356;&#12363;&#12394;&#12356;</span>
   (setq org-agenda-files
         '(<span style="color: #8b2252;">"~/Dropbox/org/org-ical.org"</span> <span style="color: #8b2252;">"~/Dropbox/org/next.org"</span>
           <span style="color: #8b2252;">"~/Dropbox/org/today.org"</span> <span style="color: #8b2252;">"~/Dropbox/org/buffer.org"</span>
           <span style="color: #8b2252;">"~/Dropbox/org/stock.org"</span>
           <span style="color: #8b2252;">"~/Dropbox/org/work.org"</span> <span style="color: #8b2252;">"~/Dropbox/org/research.org"</span>))

   (add-hook 'org-finalize-agenda-hook
             '(<span style="color: #a020f0;">lambda</span> () (org-agenda-to-appt t '((headline <span style="color: #8b2252;">"TODO"</span>)))))

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#31227;&#21205;&#30452;&#24460;&#12395;agenda&#12496;&#12483;&#12501;&#12449;&#12434;&#38281;&#12376;&#12427;&#65288;&#12484;&#12522;&#12540;&#12398;&#20869;&#23481;&#12399;SPACE&#12391;&#30906;&#35469;&#21487;&#65289;</span>
   (org-defkey org-agenda-mode-map [(tab)]
               '(<span style="color: #a020f0;">lambda</span> () (interactive)
                  (org-agenda-goto)
                  (<span style="color: #a020f0;">with-current-buffer</span> <span style="color: #8b2252;">"*Org Agenda*"</span>
                    (org-agenda-quit))))

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#29305;&#23450;&#12479;&#12464;&#12434;&#25345;&#12388;&#12484;&#12522;&#12540;&#12522;&#12473;&#12488;&#12434;&#19968;&#30330;&#31227;&#21205;&#65288;org-tags-view, org-tree-slide&#65289;</span>
   (<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">my:doing-tag</span> <span style="color: #8b2252;">"Doing"</span>)
   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:sparse-doing-tree</span> ()
     (interactive)
     (org-tags-view nil my:doing-tag))
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Doing&#12479;&#12464;&#12434;&#12488;&#12464;&#12523;&#12377;&#12427;</span>
   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:toggle-doing-tag</span> ()
     (interactive)
     (<span style="color: #a020f0;">when</span> (eq major-mode 'org-mode)
       (<span style="color: #a020f0;">save-excursion</span>
         (<span style="color: #a020f0;">save-restriction</span>
           (<span style="color: #a020f0;">unless</span> (org-at-heading-p)
             (outline-previous-heading))
           (<span style="color: #a020f0;">if</span> (string-match
                (concat <span style="color: #8b2252;">":"</span> my:doing-tag <span style="color: #8b2252;">":"</span>) (org-get-tags-string))
               (org-toggle-tag my:doing-tag 'off)
             (org-toggle-tag my:doing-tag 'on))
           (org-reveal)))))

   (custom-set-faces
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">'(org-agenda-clocking ((t (:background "</span><span style="color: #ffffff; background-color: #300020;">#300020</span><span style="color: #b22222;">"))))</span>
    '(org-agenda-structure ((t (<span style="color: #483d8b;">:underline</span> t <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #6873ff;">#6873ff</span><span style="color: #8b2252;">"</span>))))
    '(org-agenda-date-today ((t (<span style="color: #483d8b;">:weight</span> bold <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #4a6aff;">#4a6aff</span><span style="color: #8b2252;">"</span>))))
    '(org-agenda-date ((t (<span style="color: #483d8b;">:weight</span> bold <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #6ac214;">#6ac214</span><span style="color: #8b2252;">"</span>))))
    '(org-agenda-date-weekend ((t (<span style="color: #483d8b;">:weight</span> bold <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #ff8d1e;">#ff8d1e</span><span style="color: #8b2252;">"</span>))))
    '(org-time-grid ((t (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #0a4796;">#0a4796</span><span style="color: #8b2252;">"</span>))))
    '(org-warning ((t (<span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #ff431a;">#ff431a</span><span style="color: #8b2252;">"</span>))))
    '(org-upcoming-deadline ((t (<span style="color: #483d8b;">:inherit</span> font-lock-keyword-face))))
    )

   (define-key org-mode-map (kbd <span style="color: #8b2252;">"&lt;f11&gt;"</span>) 'my:toggle-doing-tag)
   (define-key org-mode-map (kbd <span style="color: #8b2252;">"C-&lt;f11&gt;"</span>) 'my:sparse-doing-tree)))
</pre>
</div>
</div>
</div>
