init.el

(with-eval-after-load "org-agenda"
  ;; sorting strategy
  (setq org-agenda-sorting-strategy
        '((agenda habit-down time-up timestamp-up priority-down category-keep)
          (todo priority-down category-keep)
          (tags priority-down category-keep)
          (search category-keep)))
  ;; Set the view span as day in an agenda view, the default is week
  (setq org-agenda-span 'day)
  ;; アジェンダに警告を表示する期間
  (setq org-deadline-warning-days 2)
  ;; アジェンダビューでFOLLOWを設定
  ;; (setq org-agenda-start-with-follow-mode t)
  ;; Customized Time Grid
  (setq org-agenda-time-grid
        '((daily today require-timed)
          "----------------"
          (800 1000 1200 1400 1600 1800 2000 2200 2400 2600)))
  (setq org-agenda-current-time-string "< d('- ' ) now!")
  (setq org-agenda-timegrid-use-ampm t)

  ;; アジェンダ作成対象（指定しないとagendaが生成されない）
  ;; ここを間違うと，MobileOrg, iCal export もうまくいかない
  (setq org-agenda-files
        '("~/Dropbox/org/org-ical.org" "~/Dropbox/org/next.org"
          "~/Dropbox/org/today.org" "~/Dropbox/org/buffer.org"
          "~/Dropbox/org/stock.org"
          "~/Dropbox/org/work.org" "~/Dropbox/org/research.org"))

  (add-hook 'org-finalize-agenda-hook
            '(lambda () (org-agenda-to-appt t '((headline "TODO")))))

  ;; 移動直後にagendaバッファを閉じる（ツリーの内容はSPACEで確認可）
  (org-defkey org-agenda-mode-map [(tab)]
              '(lambda () (interactive)
                 (org-agenda-goto)
                 (with-current-buffer "*Org Agenda*"
                   (org-agenda-quit))))

  ;; 特定タグを持つツリーリストを一発移動（org-tags-view, org-tree-slide）
  (defvar my:doing-tag "Doing")
  (defun my:sparse-doing-tree ()
    (interactive)
    (org-tags-view nil my:doing-tag))
  ;; Doingタグをトグルする
  (defun my:toggle-doing-tag ()
    (interactive)
    (when (eq major-mode 'org-mode)
      (save-excursion
        (save-restriction
          (unless (org-at-heading-p)
            (outline-previous-heading))
          (if (string-match
               (concat ":" my:doing-tag ":") (org-get-tags-string))
              (org-toggle-tag my:doing-tag 'off)
            (org-toggle-tag my:doing-tag 'on))
          (org-reveal)))))

  (custom-set-faces
   ;; '(org-agenda-clocking ((t (:background "#300020"))))
   '(org-agenda-structure ((t (:underline t :foreground "#6873ff"))))
   '(org-agenda-date-today ((t (:weight bold :foreground "#4a6aff"))))
   '(org-agenda-date ((t (:weight bold :foreground "#6ac214"))))
   '(org-agenda-date-weekend ((t (:weight bold :foreground "#ff8d1e"))))
   '(org-time-grid ((t (:foreground "#0a4796"))))
   '(org-warning ((t (:foreground "#ff431a"))))
   '(org-upcoming-deadline ((t (:inherit font-lock-keyword-face))))
   )

  (define-key org-mode-map (kbd "<f11>") 'my:toggle-doing-tag)
  (define-key org-mode-map (kbd "C-<f11>") 'my:sparse-doing-tree))

(with-eval-after-load "org"
  ;; アラーム表示を有効にする
  (appt-activate 1)
