init.el
  ;; window を フレーム内に表示する
  (setq appt-display-format 'window)
  ;; window を継続表示する時間[s]
  (setq appt-display-duration 5)
  ;; ビープ音の有無
  (setq appt-audible nil)
  ;; 何分前から警告表示を開始するか[m]
  (setq appt-message-warning-time 30)
  ;; 警告表示開始から何分ごとにリマインドするか[m]
  (setq appt-display-interval 5)
  ;; モードラインにアラームを表示する
  (setq appt-display-mode-line t)
  ;; org-agenda の内容をアラームに登録する（重い）
  ;; (add-hook 'org-mode-hook
  ;;           '(lambda ()
  ;;              (org-agenda-to-appt t '((headline "TODO")))))
  ;; 定期的に更新する
  (defvar org-agenda-to-appt-activate t)
  (defun my:org-agenda-to-appt ()
    (interactive)
    (org-agenda-to-appt t '((headline "TODO"))))
  (add-hook 'focus-out-hook
            #'(lambda ()
                (when org-agenda-to-appt-activate
                  (my:org-agenda-to-appt)
                  (setq org-agenda-to-appt-activate nil))))
  (run-with-idle-timer
   10 t #'(lambda ()
            (setq org-agenda-to-appt-activate t)))

  (define-key org-mode-map (kbd "C-c f 3") 'my:org-agenda-to-appt))

(when
    (eval-after-autoload-if-found
