init.org
** [org-capture] 高速にメモを取る

#+BEGIN_SRC emacs-lisp :tangle yes
  (when
      (eval-after-autoload-if-found
       '(org-capture) "org-capture" nil t nil
       '(;; 2010-06-13 の形式では，タグとして認識されない
         (defun get-current-date-tags () (format-time-string "%Y%m%d"))
         (setq org-default-notes-file (concat org-directory "next.org"))
         (defvar org-capture-words-notes-file (concat org-directory "words.org"))
         (defvar org-capture-notes-file (concat org-directory "note.org"))
         (defvar org-capture-research-file (concat org-directory "research.org"))
         (defvar org-capture-buffer-file (concat org-directory "buffer.org"))
         (defvar org-capture-today-file (concat org-directory "today.org"))
         (defvar org-capture-ical-file (concat org-directory "org-ical.org"))

         ;; see org.pdf:p73
         (setq org-capture-templates
               `(("t" "TODO 項目を INBOX に貼り付ける" entry
                  (file+headline nil "INBOX") "** TODO %?\n\t")
                 ("c" "同期カレンダーにエントリー" entry
                  (file+headline ,org-capture-ical-file "Schedule")
                  "** TODO %?\n\t") 
                 ("d" "Doingタグ付きのタスクをInboxに投げる" entry
                  (file+headline nil "INBOX")
                  "** TODO %? :Doing:\n  - \n")
                 ("l" "本日のチェックリスト" entry
                  (file+headline ,org-capture-today-file "Today")
                  "** FOCUS 本日のチェックリスト %T\n（起床時間の記録）[[http://www.hayaoki-seikatsu.com/users/takaxp/][早起き日記]] \n（朝食）\n  - [ ] %?\n（昼食）\n（帰宅／夕食）\n----\n（研究速報）\n  - [ ] \n")
                 ("i" "アイディアを書き込む" entry (file+headline nil "INBOX")
                  "** %?\n  - \n\t%U")
                 ("b" "Bug タグ付きの TODO 項目を貼り付ける" entry
                  (file+headline nil "INBOX")
                  "** TODO %? :bug:\n %i\n %a %t")
                 ("w" ,(concat "英単語を " org-capture-words-notes-file
                               " に書き込む") entry
                               (file+headline ,org-capture-words-notes-file "WORDS")
                               "** %? :%(get-current-date-tags):\n「」\n  - ")
                 ("g" ,(concat "英語ノートを " org-capture-words-notes-file
                               " に書き込む")
                  entry (file+headline ,org-capture-words-notes-file "GRAMMER")
                  "** %? :%(get-current-date-tags):\n\n%U")
                 ("T" "時間付きエントリー" entry (file+headline nil "INBOX")
                  "** %? %T--\n")
                 ("n" "ノートとしてINBOXに貼り付ける" entry
                  (file+headline nil "INBOX")
                  "** %? :note:\n\t%U")
                 ("D" "「ドラッカー365の金言」をノートする" entry
                  (file+headline ,org-capture-notes-file "The Daily Drucker")
                  "** 「%?」\nDrucker) \n  - \n  - \nACTION POINT:\n  - \nQUESTION:\n  - \n")
                 ("r" ,(concat "研究ノートを " org-capture-research-file
                               " に書き込む")
                  entry (file+headline ,org-capture-research-file "Survey")
                  "** %? :note:\n# \n  - \n\t%U")
                 ("`" ,(concat "ノートをバッファ " org-capture-buffer-file
                               " に書き込む")
                  entry (file+headline ,org-capture-buffer-file "Buffers")
                  "** %(get-random-string 16) %U\n\n%?\n\n----"))))))
#+END_SRC

** [org-refile]

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org"
    (setq org-refile-targets
          (quote (("org-ical.org" :level . 1)
                  ("research.org" :level . 1)
                  ("work.org" :level . 1)
                  ("next.org" :level . 1)
                  ("sleep.org" :level . 1)))))
#+END_SRC

