init.html

<div id="outline-container-orgheadline147" class="outline-3">
<h3 id="orgheadline147"><span class="section-number-3">10.11</span> [org-capture] 高速にメモを取る</h3>
<div class="outline-text-3" id="text-10-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-capture <span style="color: #8b2252;">"org-capture"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
 '(  
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">2010-06-13 &#12398;&#24418;&#24335;&#12391;&#12399;&#65292;&#12479;&#12464;&#12392;&#12375;&#12390;&#35469;&#35672;&#12373;&#12428;&#12394;&#12356;</span>
   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">get-current-date-tags</span> () (format-time-string <span style="color: #8b2252;">"%Y%m%d"</span>))
   (setq org-default-notes-file (concat org-directory <span style="color: #8b2252;">"next.org"</span>))
   (<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">org-capture-words-notes-file</span> (concat org-directory <span style="color: #8b2252;">"words.org"</span>))
   (<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">org-capture-notes-file</span> (concat org-directory <span style="color: #8b2252;">"note.org"</span>))
   (<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">org-capture-research-file</span> (concat org-directory <span style="color: #8b2252;">"research.org"</span>))
   (<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">org-capture-buffer-file</span> (concat org-directory <span style="color: #8b2252;">"buffer.org"</span>))
   (<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">org-capture-today-file</span> (concat org-directory <span style="color: #8b2252;">"today.org"</span>))
   (<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">org-capture-ical-file</span> (concat org-directory <span style="color: #8b2252;">"org-ical.org"</span>))

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">see org.pdf:p73</span>
   (setq org-capture-templates
         `((<span style="color: #8b2252;">"t"</span> <span style="color: #8b2252;">"TODO &#38917;&#30446;&#12434; INBOX &#12395;&#36028;&#12426;&#20184;&#12369;&#12427;"</span> entry
            (file+headline nil <span style="color: #8b2252;">"INBOX"</span>) <span style="color: #8b2252;">"** TODO %?\n\t"</span>)
           (<span style="color: #8b2252;">"c"</span> <span style="color: #8b2252;">"&#21516;&#26399;&#12459;&#12524;&#12531;&#12480;&#12540;&#12395;&#12456;&#12531;&#12488;&#12522;&#12540;"</span> entry
            (file+headline ,org-capture-ical-file <span style="color: #8b2252;">"Schedule"</span>)
            <span style="color: #8b2252;">"** TODO %?\n\t"</span>) 
           (<span style="color: #8b2252;">"d"</span> <span style="color: #8b2252;">"Doing&#12479;&#12464;&#20184;&#12365;&#12398;&#12479;&#12473;&#12463;&#12434;Inbox&#12395;&#25237;&#12370;&#12427;"</span> entry
            (file+headline nil <span style="color: #8b2252;">"INBOX"</span>)
            <span style="color: #8b2252;">"** TODO %? :Doing:\n  - \n"</span>)
           (<span style="color: #8b2252;">"l"</span> <span style="color: #8b2252;">"&#26412;&#26085;&#12398;&#12481;&#12455;&#12483;&#12463;&#12522;&#12473;&#12488;"</span> entry
            (file+headline ,org-capture-today-file <span style="color: #8b2252;">"Today"</span>)
            <span style="color: #8b2252;">"** FOCUS &#26412;&#26085;&#12398;&#12481;&#12455;&#12483;&#12463;&#12522;&#12473;&#12488; %T\n&#65288;&#36215;&#24202;&#26178;&#38291;&#12398;&#35352;&#37682;&#65289;[[http://www.hayaoki-seikatsu.com/users/takaxp/][&#26089;&#36215;&#12365;&#26085;&#35352;]] \n&#65288;&#26397;&#39135;&#65289;\n  - [ ] %?\n&#65288;&#26172;&#39135;&#65289;\n&#65288;&#24112;&#23429;&#65295;&#22805;&#39135;&#65289;\n----\n&#65288;&#30740;&#31350;&#36895;&#22577;&#65289;\n  - [ ] \n"</span>)
           (<span style="color: #8b2252;">"i"</span> <span style="color: #8b2252;">"&#12450;&#12452;&#12487;&#12451;&#12450;&#12434;&#26360;&#12365;&#36796;&#12416;"</span> entry (file+headline nil <span style="color: #8b2252;">"INBOX"</span>)
            <span style="color: #8b2252;">"** %?\n  - \n\t%U"</span>)
           (<span style="color: #8b2252;">"b"</span> <span style="color: #8b2252;">"Bug &#12479;&#12464;&#20184;&#12365;&#12398; TODO &#38917;&#30446;&#12434;&#36028;&#12426;&#20184;&#12369;&#12427;"</span> entry
            (file+headline nil <span style="color: #8b2252;">"INBOX"</span>)
            <span style="color: #8b2252;">"** TODO %? :bug:\n %i\n %a %t"</span>)
           (<span style="color: #8b2252;">"w"</span> ,(concat <span style="color: #8b2252;">"&#33521;&#21336;&#35486;&#12434; "</span> org-capture-words-notes-file
                         <span style="color: #8b2252;">" &#12395;&#26360;&#12365;&#36796;&#12416;"</span>) entry
                         (file+headline ,org-capture-words-notes-file <span style="color: #8b2252;">"WORDS"</span>)
                         <span style="color: #8b2252;">"** %? :%(get-current-date-tags):\n&#12300;&#12301;\n  - "</span>)
           (<span style="color: #8b2252;">"g"</span> ,(concat <span style="color: #8b2252;">"&#33521;&#35486;&#12494;&#12540;&#12488;&#12434; "</span> org-capture-words-notes-file
                         <span style="color: #8b2252;">" &#12395;&#26360;&#12365;&#36796;&#12416;"</span>)
            entry (file+headline ,org-capture-words-notes-file <span style="color: #8b2252;">"GRAMMER"</span>)
            <span style="color: #8b2252;">"** %? :%(get-current-date-tags):\n\n%U"</span>)
           (<span style="color: #8b2252;">"T"</span> <span style="color: #8b2252;">"&#26178;&#38291;&#20184;&#12365;&#12456;&#12531;&#12488;&#12522;&#12540;"</span> entry (file+headline nil <span style="color: #8b2252;">"INBOX"</span>)
            <span style="color: #8b2252;">"** %? %T--\n"</span>)
           (<span style="color: #8b2252;">"n"</span> <span style="color: #8b2252;">"&#12494;&#12540;&#12488;&#12392;&#12375;&#12390;INBOX&#12395;&#36028;&#12426;&#20184;&#12369;&#12427;"</span> entry
            (file+headline nil <span style="color: #8b2252;">"INBOX"</span>)
            <span style="color: #8b2252;">"** %? :note:\n\t%U"</span>)
           (<span style="color: #8b2252;">"D"</span> <span style="color: #8b2252;">"&#12300;&#12489;&#12521;&#12483;&#12459;&#12540;365&#12398;&#37329;&#35328;&#12301;&#12434;&#12494;&#12540;&#12488;&#12377;&#12427;"</span> entry
            (file+headline ,org-capture-notes-file <span style="color: #8b2252;">"The Daily Drucker"</span>)
            <span style="color: #8b2252;">"** &#12300;%?&#12301;\nDrucker) \n  - \n  - \nACTION POINT:\n  - \nQUESTION:\n  - \n"</span>)
           (<span style="color: #8b2252;">"r"</span> ,(concat <span style="color: #8b2252;">"&#30740;&#31350;&#12494;&#12540;&#12488;&#12434; "</span> org-capture-research-file
                         <span style="color: #8b2252;">" &#12395;&#26360;&#12365;&#36796;&#12416;"</span>)
            entry (file+headline ,org-capture-research-file <span style="color: #8b2252;">"Survey"</span>)
            <span style="color: #8b2252;">"** %? :note:\n# \n  - \n\t%U"</span>)
           (<span style="color: #8b2252;">"`"</span> ,(concat <span style="color: #8b2252;">"&#12494;&#12540;&#12488;&#12434;&#12496;&#12483;&#12501;&#12449; "</span> org-capture-buffer-file
                         <span style="color: #8b2252;">" &#12395;&#26360;&#12365;&#36796;&#12416;"</span>)
            entry (file+headline ,org-capture-buffer-file <span style="color: #8b2252;">"Buffers"</span>)
            <span style="color: #8b2252;">"** %(get-random-string 16) %U\n\n%?\n\n----"</span>)))
   ))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline148" class="outline-3">
<h3 id="orgheadline148"><span class="section-number-3">10.12</span> [org-refile]</h3>
<div class="outline-text-3" id="text-10-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-refile <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
 '((setq org-refile-targets
         (quote ((<span style="color: #8b2252;">"org-ical.org"</span> <span style="color: #483d8b;">:level</span> . 1)
                 (<span style="color: #8b2252;">"work.org"</span> <span style="color: #483d8b;">:level</span> . 1)
                 (<span style="color: #8b2252;">"next.org"</span> <span style="color: #483d8b;">:level</span> . 1)
                 (<span style="color: #8b2252;">"sleep.org"</span> <span style="color: #483d8b;">:level</span> . 1))))
       ))
</pre>
</div>
</div>
</div>
