init.org
** [org-babel] 基本設定

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org"
    (setq org-confirm-babel-evaluate nil)
    (setq org-src-fontify-natively t)
    (setq org-src-tab-acts-natively t)
    ;; org-src-window-setup (current-window, other-window, other-frame)
    (setq org-src-window-setup 'current-window)
    (require 'ob-http nil t)
    ;; Add ":results output" after program name
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((dot . t)
       (C . t)
       (perl . t)
       (sh . t)
       (latex . t)
       (R . t)
       (python . t)))
    ;; (require 'ob-C nil t)
    ;; (require 'ob-perl nil t)
    ;; (require 'ob-sh nil t)
    ;; (require 'ob-python nil t)

    ;; 実装済みの言語に好きな名前を紐付ける
    (add-to-list 'org-src-lang-modes '("cs" . csharp))
    (add-to-list 'org-src-lang-modes '("zsh" . sh)))
#+END_SRC

** [org-babel] ソースブロックの入力キーをカスタマイズ

ソースブロックを入力するときは， <+ =TAB= でテンプレートを高速に入力できます．しかし，利用する言語までは指定できないので，特定の内容について対応するコマンドを割り当てて起きます．以下の例を設定として追加すると， <S+ =TAB= で =emacs-lisp= を， <C+ =TAB= でコメントブロックを指定できます．

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org"
    (add-to-list 'org-structure-template-alist
                 '("C" "#+BEGIN_COMMENT\n?\n#+END_COMMENT" ""))
    (add-to-list 'org-structure-template-alist
                 '("S" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC" "<src lang=\"emacs-lisp\">\n\n</src>")))
#+END_SRC

** [MobileOrg] iOS との連携
http://orgmode.org/manual/Setting-up-the-staging-area.html

#+BEGIN_SRC emacs-lisp :tangle no
  (with-eval-after-load "org"
    ;;(setq org-mobile-files '("~/Dropbox/org/next.org" "1.org" "2.org"))
    (setq org-mobile-files '("~/Dropbox/org/next.org"))
    ;;(setq org-mobile-force-id-on-agenda-items nil)

    ;; Set a file to capture data from iOS devices
    (setq org-mobile-inbox-for-pull (concat org-directory "captured.org"))

    ;; Upload location stored org files (index.org will be created)
    (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg/")

  ;;; Menu to push or pull org files using MobileOrg
    (defun org-mobile-sync ()
      (interactive)
      (let
          (org-mobile-sync-type
           (read-from-minibuffer "How do you sync the org files? (pull or push) "))
        (message "%s" org-mobile-sync-type)
        (cond
         ((string= "pull" org-mobile-sync-type) (org-mobile-pull))
         ((string= "push" org-mobile-sync-type) (org-mobile-push))))))
#+END_SRC

** [org-tree-slide] Org でプレゼンテーション

http://pastelwill.jp/wiki/doku.php?id=emacs:org-tree-slide

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Org-tree-slide
  (when (eval-after-autoload-if-found
         'org-tree-slide-mode "org-tree-slide" nil t nil
         '(;; <f8>/<f9>/<f10>/<f11> are assigned to control org-tree-slide
           (define-key org-tree-slide-mode-map (kbd "<f9>")
             'org-tree-slide-move-previous-tree)
           (define-key org-tree-slide-mode-map (kbd "<f10>")
             'org-tree-slide-move-next-tree)
           (org-tree-slide-narrowing-control-profile)
           (setq org-tree-slide-modeline-display 'outside)
           (setq org-tree-slide-skip-outline-level 5)
           (setq org-tree-slide-skip-done nil)))

    (global-set-key (kbd "<f8>") 'org-tree-slide-mode)
    (global-set-key (kbd "S-<f8>") 'org-tree-slide-skip-done-toggle))
#+END_SRC

Doing タグのトグルに =f11= を割り当てたので，コンテンツモードへの切り替えは，異なるキーバインドに変更．

