init.html
<div id="outline-container-orgheadline149" class="outline-3">
<h3 id="orgheadline149"><span class="section-number-3">10.13</span> [org-babel] 基本設定</h3>
<div class="outline-text-3" id="text-10-13">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-mode <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
 '((setq org-confirm-babel-evaluate nil)
   (setq org-src-fontify-natively t)
   (setq org-src-tab-acts-natively t)
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">org-src-window-setup (current-window, other-window, other-frame)</span>
   (setq org-src-window-setup 'current-window)
   (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">ob-http</span> nil t)
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Add ":results output" after program name</span>
   (org-babel-do-load-languages
    'org-babel-load-languages
    '((dot . t)
      (C . t)
      (perl . t)
      (sh . t)
      (latex . t)
      (R . t)
      (python . t)))
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">(require 'ob-C nil t)</span>
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">(require 'ob-perl nil t)</span>
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">(require 'ob-sh nil t)</span>
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">(require 'ob-python nil t)</span>

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#23455;&#35013;&#28168;&#12415;&#12398;&#35328;&#35486;&#12395;&#22909;&#12365;&#12394;&#21517;&#21069;&#12434;&#32016;&#20184;&#12369;&#12427;</span>
   (add-to-list 'org-src-lang-modes '(<span style="color: #8b2252;">"cs"</span> . csharp))
   (add-to-list 'org-src-lang-modes '(<span style="color: #8b2252;">"zsh"</span> . sh))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline150" class="outline-3">
<h3 id="orgheadline150"><span class="section-number-3">10.14</span> [org-babel] ソースブロックの入力キーをカスタマイズ</h3>
<div class="outline-text-3" id="text-10-14">
<p>
ソースブロックを入力するときは， &lt;+ <code>TAB</code> でテンプレートを高速に入力できます．しかし，利用する言語までは指定できないので，特定の内容について対応するコマンドを割り当てて起きます．以下の例を設定として追加すると， &lt;S+ <code>TAB</code> で <code>emacs-lisp</code> を， &lt;C+ <code>TAB</code> でコメントブロックを指定できます．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-mode <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
 '((add-to-list 'org-structure-template-alist
                '(<span style="color: #8b2252;">"C"</span> <span style="color: #8b2252;">"#+BEGIN_COMMENT\n?\n#+END_COMMENT"</span> <span style="color: #8b2252;">""</span>))
   (add-to-list 'org-structure-template-alist
                '(<span style="color: #8b2252;">"S"</span> <span style="color: #8b2252;">"#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"</span> <span style="color: #8b2252;">"&lt;src lang=\"emacs-lisp\"&gt;\n\n&lt;/src&gt;"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline151" class="outline-3">
<h3 id="orgheadline151"><span class="section-number-3">10.15</span> [MobileOrg] iOS との連携</h3>
<div class="outline-text-3" id="text-10-15">
<p>
<a href="http://orgmode.org/manual/Setting-up-the-staging-area.html">http://orgmode.org/manual/Setting-up-the-staging-area.html</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-mode <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
 '(
   <span style="color: #b22222;">;;</span><span style="color: #b22222;">(setq org-mobile-files '("~/Dropbox/org/next.org" "1.org" "2.org"))</span>
   (setq org-mobile-files '(<span style="color: #8b2252;">"~/Dropbox/org/next.org"</span>))
   <span style="color: #b22222;">;;</span><span style="color: #b22222;">(setq org-mobile-force-id-on-agenda-items nil)</span>

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Set a file to capture data from iOS devices</span>
   (setq org-mobile-inbox-for-pull (concat org-directory <span style="color: #8b2252;">"captured.org"</span>))

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Upload location stored org files (index.org will be created)</span>
   (setq org-mobile-directory <span style="color: #8b2252;">"~/Dropbox/Apps/MobileOrg/"</span>)

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Menu to push or pull org files using MobileOrg</span>
   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">org-mobile-sync</span> ()
     (interactive)
     (<span style="color: #a020f0;">let</span>
         (org-mobile-sync-type
          (read-from-minibuffer <span style="color: #8b2252;">"How do you sync the org files? (pull or push) "</span>))
       (message <span style="color: #8b2252;">"%s"</span> org-mobile-sync-type)
       (<span style="color: #a020f0;">cond</span>
        ((string= <span style="color: #8b2252;">"pull"</span> org-mobile-sync-type) (org-mobile-pull))
        ((string= <span style="color: #8b2252;">"push"</span> org-mobile-sync-type) (org-mobile-push)))))
   ))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline152" class="outline-3">
<h3 id="orgheadline152"><span class="section-number-3">10.16</span> [org-tree-slide] Org でプレゼンテーション</h3>
<div class="outline-text-3" id="text-10-16">
<p>
<a href="http://pastelwill.jp/wiki/doku.php?id=emacs:org-tree-slide">http://pastelwill.jp/wiki/doku.php?id=emacs:org-tree-slide</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Org-tree-slide</span>
(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       'org-tree-slide-mode <span style="color: #8b2252;">"org-tree-slide"</span> nil t nil
       '(<span style="color: #b22222;">;; </span><span style="color: #b22222;">&lt;f8&gt;/&lt;f9&gt;/&lt;f10&gt;/&lt;f11&gt; are assigned to control org-tree-slide</span>
         (define-key org-tree-slide-mode-map (kbd <span style="color: #8b2252;">"&lt;f9&gt;"</span>)
           'org-tree-slide-move-previous-tree)
         (define-key org-tree-slide-mode-map (kbd <span style="color: #8b2252;">"&lt;f10&gt;"</span>)
           'org-tree-slide-move-next-tree)
         (org-tree-slide-narrowing-control-profile)
         (setq org-tree-slide-modeline-display 'outside)
         (setq org-tree-slide-skip-outline-level 5)
         (setq org-tree-slide-skip-done nil)))
  (global-set-key (kbd <span style="color: #8b2252;">"&lt;f8&gt;"</span>) 'org-tree-slide-mode)
  (global-set-key (kbd <span style="color: #8b2252;">"S-&lt;f8&gt;"</span>) 'org-tree-slide-skip-done-toggle))
</pre>
</div>

<p>
Doing タグのトグルに <code>f11</code> を割り当てたので，コンテンツモードへの切り替えは，異なるキーバインドに変更．<br  />
</p>
</div>
</div>
