init.org
** [org-tree-slide] クロックインとアウトを自動化する

特定のファイルを編集している時， =org-tree-slide= でフォーカスしたら =org-clock-in= で時間計測を始めて，ナローイングを解く時や次のツリーに移る時に =org-clock-out= で計測を停止するように設定しています．基本的に =org-tree-slide= にあるhookに色々とぶら下げるだけです．

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org-tree-slide"
    (defun my:org-clock-in ()
      (setq vc-display-status nil) ;; モードライン節約
      (org-clock-in))

    (defun my:org-clock-out ()
      (setq vc-display-status t) ;; モードライン節約解除
      (require 'org-clock nil t)
      (when (org-clocking-p) (org-clock-out)))

    (add-hook 'org-tree-slide-before-move-previous-hook
              'my:org-clock-out)
    (add-hook 'org-tree-slide-before-move-next-hook
              'my:org-clock-out)
    (add-hook 'org-tree-slide-stop-hook 'my:org-clock-out)

    (add-hook 'org-tree-slide-before-narrow-hook
              '(lambda ()
                 (when
                     (and (or (equal (buffer-name) "work.org")
                              (equal (buffer-name) "effort.org"))
                          (and (or (eq (org-outline-level) 2)
                                   (eq (org-outline-level) 3))
                               (looking-at (concat "^\\*+ "
                                                   org-not-done-regexp))))
                   (my:org-clock-in)))))
#+END_SRC

** [org-tree-slide] 特定のツリーをプロポーショナルフォントで表示する

ツリーのプロパティに，プロポーショナルで表示するか否かの制御フラグを加えます．ツリーにフォーカス時にPROPORTIONAL指定がプロパティにあると，そのツリーを動的にプロポーショナルフォントでレンダリングします．変更は下位ツリーの全てに継承しています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(org-tree-slide) "org-tree-slide" nil t nil
         '((defcustom use-proportional-font nil
             "The status of FONT property"
             :type 'boolean
             :group 'org-mode)

           (set-face-attribute 'variable-pitch nil
                               :family "Verdana"
                               :height 125)

           (defun my:proportional-font-toggle ()
             (interactive)
             (setq use-proportional-font (not use-proportional-font))
             (if use-proportional-font
                 (org-entry-put nil "FONT" "PROPORTIONAL")
               (org-delete-property "FONT")))

           (add-hook 'org-tree-slide-before-narrow-hook
                     '(lambda ()
                        (if (equal "PROPORTIONAL"
                                   (org-entry-get-with-inheritance "FONT"))
                            (buffer-face-set 'variable-pitch)
                          (buffer-face-mode 0))))
           (add-hook 'org-tree-slide-stop-hook
                     '(lambda ()
                        (buffer-face-mode 0))))))
#+END_SRC

*** キーバインド

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org"
    (define-key org-mode-map (kbd "C-c f p") 'my:proportional-font-toggle))
#+END_SRC

** [org-fstree] ディレクトリ構造を読み取る
#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-autoload-if-found
   'org-mode "org" nil t nil
   '((require 'org-fstree nil t)))
#+END_SRC

