init.html

<div id="outline-container-orgheadline153" class="outline-3">
<h3 id="orgheadline153"><span class="section-number-3">10.17</span> [org-tree-slide] クロックインとアウトを自動化する</h3>
<div class="outline-text-3" id="text-10-17">
<p>
特定のファイルを編集している時， <code>org-tree-slide</code> でフォーカスしたら <code>org-clock-in</code> で時間計測を始めて，ナローイングを解く時や次のツリーに移る時に <code>org-clock-out</code> で計測を停止するように設定しています．基本的に <code>org-tree-slide</code> にあるhookに色々とぶら下げるだけです．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-tree-slide-mode <span style="color: #8b2252;">"org-tree-slide"</span> nil t nil
 '((<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:org-clock-in</span> ()
     (setq vc-display-status nil) <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12514;&#12540;&#12489;&#12521;&#12452;&#12531;&#31680;&#32004;</span>
     (org-clock-in))

   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:org-clock-out</span> ()
     (setq vc-display-status t) <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12514;&#12540;&#12489;&#12521;&#12452;&#12531;&#31680;&#32004;&#35299;&#38500;</span>
     (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">org-clock</span> nil t)
     (<span style="color: #a020f0;">when</span> (org-clocking-p) (org-clock-out)))

   (add-hook 'org-tree-slide-before-move-previous-hook
             'my:org-clock-out)
   (add-hook 'org-tree-slide-before-move-next-hook
             'my:org-clock-out)
   (add-hook 'org-tree-slide-stop-hook 'my:org-clock-out)

   (add-hook 'org-tree-slide-before-narrow-hook
             '(<span style="color: #a020f0;">lambda</span> ()
                (<span style="color: #a020f0;">when</span>
                    (and (equal (buffer-name) <span style="color: #8b2252;">"work.org"</span>)
                         (and (or (eq (org-outline-level) 2)
                                  (eq (org-outline-level) 3))
                              (looking-at (concat <span style="color: #8b2252;">"^\\*+ "</span>
                                                  org-not-done-regexp))))
                  (my:org-clock-in))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline155" class="outline-3">
<h3 id="orgheadline155"><span class="section-number-3">10.18</span> [org-tree-slide] 特定のツリーをプロポーショナルフォントで表示する</h3>
<div class="outline-text-3" id="text-10-18">
<p>
ツリーのプロパティに，プロポーショナルで表示するか否かの制御フラグを加えます．ツリーにフォーカス時にPROPORTIONAL指定がプロパティにあると，そのツリーを動的にプロポーショナルフォントでレンダリングします．変更は下位ツリーの全てに継承しています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-tree-slide-mode <span style="color: #8b2252;">"org-tree-slide"</span> nil t nil
 '((<span style="color: #a020f0;">defcustom</span> <span style="color: #a0522d;">use-proportional-font</span> nil
     <span style="color: #8b2252;">"The status of FONT property"</span>
     <span style="color: #483d8b;">:type</span> 'boolean
     <span style="color: #483d8b;">:group</span> 'org-mode)

   (set-face-attribute 'variable-pitch nil
                       <span style="color: #483d8b;">:family</span> <span style="color: #8b2252;">"Verdana"</span>
                       <span style="color: #483d8b;">:height</span> 125)

   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:proportional-font-toggle</span> ()
     (interactive)
     (setq use-proportional-font (not use-proportional-font))
     (<span style="color: #a020f0;">if</span> use-proportional-font
         (org-entry-put nil <span style="color: #8b2252;">"FONT"</span> <span style="color: #8b2252;">"PROPORTIONAL"</span>)
       (org-delete-property <span style="color: #8b2252;">"FONT"</span>)))

   (add-hook 'org-tree-slide-before-narrow-hook
             '(<span style="color: #a020f0;">lambda</span> ()
                (<span style="color: #a020f0;">if</span> (equal <span style="color: #8b2252;">"PROPORTIONAL"</span>
                           (org-entry-get-with-inheritance <span style="color: #8b2252;">"FONT"</span>))
                    (buffer-face-set 'variable-pitch)
                  (buffer-face-mode 0))))
   (add-hook 'org-tree-slide-stop-hook
             '(<span style="color: #a020f0;">lambda</span> ()
                (buffer-face-mode 0)))))
</pre>
</div>
</div>

<div id="outline-container-orgheadline154" class="outline-4">
<h4 id="orgheadline154"><span class="section-number-4">10.18.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-10-18-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"org"</span>
  (define-key org-mode-map (kbd <span style="color: #8b2252;">"C-c f p"</span>) 'my:proportional-font-toggle))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline156" class="outline-3">
<h3 id="orgheadline156"><span class="section-number-3">10.19</span> [org-fstree] ディレクトリ構造を読み取る</h3>
<div class="outline-text-3" id="text-10-19">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-mode <span style="color: #8b2252;">"org"</span> nil t nil
 '((<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">org-fstree</span> nil t)))
</pre>
</div>
</div>
</div>
