init.el

(with-eval-after-load "org-tree-slide"
  (defun my:org-clock-in ()
    (setq vc-display-status nil) ;; モードライン節約
    (org-clock-in))

  (defun my:org-clock-out ()
    (setq vc-display-status t) ;; モードライン節約解除
    (require 'org-clock nil t)
    (when (org-clocking-p) (org-clock-out)))

  (add-hook 'org-tree-slide-before-move-previous-hook
            'my:org-clock-out)
  (add-hook 'org-tree-slide-before-move-next-hook
            'my:org-clock-out)
  (add-hook 'org-tree-slide-stop-hook 'my:org-clock-out)

  (add-hook 'org-tree-slide-before-narrow-hook
            '(lambda ()
               (when
                   (and (or (equal (buffer-name) "work.org")
                            (equal (buffer-name) "effort.org"))
                        (and (or (eq (org-outline-level) 2)
                                 (eq (org-outline-level) 3))
                             (looking-at (concat "^\\*+ "
                                                 org-not-done-regexp))))
                 (my:org-clock-in)))))

(when (eval-after-autoload-if-found
       '(org-tree-slide) "org-tree-slide" nil t nil
       '((defcustom use-proportional-font nil
           "The status of FONT property"
           :type 'boolean
           :group 'org-mode)

         (set-face-attribute 'variable-pitch nil
                             :family "Verdana"
                             :height 125)

         (defun my:proportional-font-toggle ()
           (interactive)
           (setq use-proportional-font (not use-proportional-font))
           (if use-proportional-font
               (org-entry-put nil "FONT" "PROPORTIONAL")
             (org-delete-property "FONT")))

         (add-hook 'org-tree-slide-before-narrow-hook
                   '(lambda ()
                      (if (equal "PROPORTIONAL"
                                 (org-entry-get-with-inheritance "FONT"))
                          (buffer-face-set 'variable-pitch)
                        (buffer-face-mode 0))))
         (add-hook 'org-tree-slide-stop-hook
                   '(lambda ()
                      (buffer-face-mode 0))))))

(with-eval-after-load "org"
  (define-key org-mode-map (kbd "C-c f p") 'my:proportional-font-toggle))

(eval-after-autoload-if-found
 'org-mode "org" nil t nil
 '((require 'org-fstree nil t)))

(when (eval-after-autoload-if-found
