init.html

<div id="outline-container-orgheadline157" class="outline-3">
<h3 id="orgheadline157"><span class="section-number-3">10.20</span> [calfw-org] calfw に org の予定を表示する</h3>
<div class="outline-text-3" id="text-10-20">
<p>
org-mode の表のようにフェイスを統一しています． <code>calfw</code> を起動する時に，自動的にフレームサイズを拡大するような独自関数をぶら下げています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(my:cfw-open-org-calendar cfw:open-org-calendar)
       <span style="color: #8b2252;">"calfw-org"</span> <span style="color: #8b2252;">"Rich calendar for org-mode"</span> t nil
       '(
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">icalendar &#12392;&#12398;&#36899;&#32080;</span>
         (setq cfw:org-icalendars '(<span style="color: #8b2252;">"~/Dropbox/org/org-ical.org"</span>))

         <span style="color: #b22222;">;; </span><span style="color: #b22222;">org &#12391;&#20351;&#12358;&#34920;&#12395;&#12501;&#12455;&#12452;&#12473;&#12434;&#32113;&#19968;</span>
         (setq cfw:fchar-junction ?+
               cfw:fchar-vertical-line ?|
               cfw:fchar-horizontal-line ?-
               cfw:fchar-left-junction ?|
               cfw:fchar-right-junction ?|
               cfw:fchar-top-junction ?+
               cfw:fchar-top-left-corner ?|
               cfw:fchar-top-right-corner ?| )

         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:org-mark-ring-goto-calfw</span> ()
           (interactive)
           (org-mark-ring-goto))

         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:cfw-open-org-calendar</span> ()
           (interactive)
           (change-frame-width-double)
           (cfw:open-org-calendar))

         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:cfw-burry-buffer</span> ()
           (interactive)
           (bury-buffer)
           (change-frame-width-single))

         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">cfw:org-goto-date</span> ()
           <span style="color: #8b2252;">"Move the cursor to the specified date."</span>
           (interactive)
           (cfw:navi-goto-date
            (cfw:emacs-to-calendar (org-read-date nil 'to-time))))

         (define-key cfw:calendar-mode-map (kbd <span style="color: #8b2252;">"j"</span>) 'cfw:org-goto-date)
         (define-key cfw:org-schedule-map (kbd <span style="color: #8b2252;">"q"</span>) 'my:cfw-burry-buffer)))
  (global-set-key (kbd <span style="color: #8b2252;">"C-c f c"</span>) 'my:cfw-open-org-calendar))

<span style="color: #b22222;">;;         </span><span style="color: #b22222;">(add-hook 'window-configuration-change-hook 'cfw:resize-calendar)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(defun cfw:resize-calendar ()</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(interactive)</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(when (eq major-mode 'cfw:calendar-mode)</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">(cfw:refresh-calendar-buffer nil)</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">(message "Calendar resized.")))</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">(defun open-calfw-agenda-org ()</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(interactive)</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(cfw:open-org-calendar))</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq org-agenda-custom-commands</span>
<span style="color: #b22222;">;;       </span><span style="color: #b22222;">'(("w" todo "FOCUS")</span>
<span style="color: #b22222;">;;         </span><span style="color: #b22222;">("G" open-calfw-agenda-org "Graphical display in calfw"))))))</span>
</pre>
</div>
</div>
</div>
