init.el
       '(my:cfw-open-org-calendar cfw:open-org-calendar)
       "calfw-org" "Rich calendar for org-mode" t nil
       '(
         ;; icalendar との連結
         (setq cfw:org-icalendars '("~/Dropbox/org/org-ical.org"))

         ;; org で使う表にフェイスを統一
         (setq cfw:fchar-junction ?+
               cfw:fchar-vertical-line ?|
               cfw:fchar-horizontal-line ?-
               cfw:fchar-left-junction ?|
               cfw:fchar-right-junction ?|
               cfw:fchar-top-junction ?+
               cfw:fchar-top-left-corner ?|
               cfw:fchar-top-right-corner ?| )

         (defun my:org-mark-ring-goto-calfw ()
           (interactive)
           (org-mark-ring-goto))

         (defun my:cfw-open-org-calendar ()
           (interactive)
           (change-frame-width-double)
           (cfw:open-org-calendar))

         (defun my:cfw-burry-buffer ()
           (interactive)
           (bury-buffer)
           (change-frame-width-single))

         (defun cfw:org-goto-date ()
           "Move the cursor to the specified date."
           (interactive)
           (cfw:navi-goto-date
            (cfw:emacs-to-calendar (org-read-date nil 'to-time))))

         (define-key cfw:calendar-mode-map (kbd "j") 'cfw:org-goto-date)
         (define-key cfw:org-schedule-map (kbd "q") 'my:cfw-burry-buffer)))

  (global-set-key (kbd "C-c f c") 'my:cfw-open-org-calendar))

;;         (add-hook 'window-configuration-change-hook 'cfw:resize-calendar)
;; (defun cfw:resize-calendar ()
;;   (interactive)
;;   (when (eq major-mode 'cfw:calendar-mode)
;;     (cfw:refresh-calendar-buffer nil)
;;     (message "Calendar resized.")))

;; (defun open-calfw-agenda-org ()
;;   (interactive)
;;   (cfw:open-org-calendar))

;; (setq org-agenda-custom-commands
;;       '(("w" todo "FOCUS")
;;         ("G" open-calfw-agenda-org "Graphical display in calfw"))))))

(eval-after-autoload-if-found
