init.org
** [org-export-generic] エクスポート機能を拡張する

=org-set-generic-type= を使うことで，エクスポート機能を好みに拡張できる．contrib の中の =org-export-generic.el= が必要なので注意する．

（注意）次の設定は古い内容．動かないかもしれません．

#+BEGIN_SRC emacs-lisp :tangle no
  (with-eval-after-load "org"
    (org-set-generic-type
     "textile"
     '(:file-suffix
       ".textile"
       :key-binding ?T
       :title-format    "Title: %s\n\n"
       ;;   :date-format     "Date: %s\n"
       :date-export nil
       :toc-export      nil
       :author-export   nil
       :tags-export     nil
       :drawers-export  nil
       :date-export     t
       :timestamps-export  t
       :priorities-export  nil
       :todo-keywords-export t
       :body-line-fixed-format "\t%s\n"
                                          ;:body-list-prefix "\n"
       :body-list-format "* %s"
       :body-list-suffix "\n"
       :body-bullet-list-prefix ("* " "** " "*** " "**** " "***** ")
       :body-number-list-format "# %s"
       :body-number-list-suffix "\n"
       :header-prefix ("" "" "### " "#### " "##### " "###### ")
       :body-section-header-prefix ("h1. " "h2. " "h3. " "h4. " "h5. " "h6. ")
       :body-section-header-format "%s"
       :body-section-header-suffix ("\n\n")
       :body-header-section-numbers nil
       :body-header-section-number-format "%s) "
       :body-line-format "%s\n"
       :body-newline-paragraph "\n"
       :bold-format "*%s*"
       :italic-format "_%s_"
       :underline-format "+%s+"
       :strikethrough-format "-%s-"
       :verbatim-format "`%s`"
       :code-format "@%s@"
       :body-line-wrap   75
       :blockquote-start "\n<pre>\n"
       :blockquote-end "\n</pre>\n"
       ))

    (org-set-generic-type
     "markdown" 
     '(:file-suffix
       ".markdown"
       :key-binding     ?M
       :title-format    "Title: %s\n"
       :date-format     "Date: %s\n"
       :toc-export      nil
       :author-export   t
       :tags-export     nil
       :drawers-export  nil
       :date-export     t
       :timestamps-export  t
       :priorities-export  nil
       :todo-keywords-export t
       :body-line-fixed-format "\t%s\n"
       ;;:body-list-prefix "\n"
       :body-list-format "- %s"
       :body-list-suffix "\n"
       :header-prefix ("" "" "### " "#### " "##### " "###### ")
       :body-section-header-prefix ("" "" "### " "#### " "##### " "###### ")
       :body-section-header-format "%s\n"
       :body-section-header-suffix (?= ?- "")
       :body-header-section-numbers nil
       :body-header-section-number-format "%s) "
       :body-line-format "%s\n"
       :body-newline-paragraph "\n"
       :bold-format "**%s**"
       :italic-format "_%s_"
       :verbatim-format "`%s`"
       :code-format "`%s`"
       :body-line-wrap   75
       )))
#+END_SRC

=org-set-generic-type= を =.emacs= に追記した後， =C-c C-e g <key-binding>= とすればよい． =<key-binding>= は =org-set-generic-type= で設定する値である．2つ目は，Markdown へのエクスポーターである．

** [org-odt] ODT形式に出力

#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-autoload-if-found
   '(ox-odt) "ox-odt" nil t nil
   '((setq org-odt-styles-file
           (concat (getenv "HOME") "/Dropbox/emacs.d/config/style.odt"))
     ;; (setq org-odt-content-template-file
     ;;       (concat (getenv "HOME") "/Dropbox/emacs.d/config/style.ott"))
     (setq org-odt-preferred-output-format "pdf") ;; docx
     ;; ox-odt.el の 自作パッチの変数（DOCSTRINGが記述されていない）
     (setq org-odt-apply-custom-punctuation t)
     (setq org-odt-convert-processes
           '(("LibreOffice"
              "/Applications/LibreOffice.app/Contents/MacOS/soffice --headless --convert-to %f%x --outdir %d %i")
             ("unoconv" "unoconv -f %f -o %d %i")))))
#+END_SRC

