init.html

<div id="outline-container-orgheadline158" class="outline-3">
<h3 id="orgheadline158"><span class="section-number-3">10.21</span> [org-export-generic] エクスポート機能を拡張する</h3>
<div class="outline-text-3" id="text-10-21">
<p>
<code>org-set-generic-type</code> を使うことで，エクスポート機能を好みに拡張できる．contrib の中の <code>org-export-generic.el</code> が必要なので注意する．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-export-generic <span style="color: #8b2252;">"org-mode"</span> nil t nil
 '((org-set-generic-type
    <span style="color: #8b2252;">"textile"</span>
    '(<span style="color: #483d8b;">:file-suffix</span>
      <span style="color: #8b2252;">".textile"</span>
      <span style="color: #483d8b;">:key-binding</span> ?T
      <span style="color: #483d8b;">:title-format</span>    <span style="color: #8b2252;">"Title: %s\n\n"</span>
      <span style="color: #b22222;">;;   </span><span style="color: #b22222;">:date-format     "Date: %s\n"</span>
      <span style="color: #483d8b;">:date-export</span> nil
      <span style="color: #483d8b;">:toc-export</span>      nil
      <span style="color: #483d8b;">:author-export</span>   nil
      <span style="color: #483d8b;">:tags-export</span>     nil
      <span style="color: #483d8b;">:drawers-export</span>  nil
      <span style="color: #483d8b;">:date-export</span>     t
      <span style="color: #483d8b;">:timestamps-export</span>  t
      <span style="color: #483d8b;">:priorities-export</span>  nil
      <span style="color: #483d8b;">:todo-keywords-export</span> t
      <span style="color: #483d8b;">:body-line-fixed-format</span> <span style="color: #8b2252;">"\t%s\n"</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">:body-list-prefix "\n"</span>
      <span style="color: #483d8b;">:body-list-format</span> <span style="color: #8b2252;">"* %s"</span>
      <span style="color: #483d8b;">:body-list-suffix</span> <span style="color: #8b2252;">"\n"</span>
      <span style="color: #483d8b;">:body-bullet-list-prefix</span> (<span style="color: #8b2252;">"* "</span> <span style="color: #8b2252;">"** "</span> <span style="color: #8b2252;">"*** "</span> <span style="color: #8b2252;">"**** "</span> <span style="color: #8b2252;">"***** "</span>)
      <span style="color: #483d8b;">:body-number-list-format</span> <span style="color: #8b2252;">"# %s"</span>
      <span style="color: #483d8b;">:body-number-list-suffix</span> <span style="color: #8b2252;">"\n"</span>
      <span style="color: #483d8b;">:header-prefix</span> (<span style="color: #8b2252;">""</span> <span style="color: #8b2252;">""</span> <span style="color: #8b2252;">"### "</span> <span style="color: #8b2252;">"#### "</span> <span style="color: #8b2252;">"##### "</span> <span style="color: #8b2252;">"###### "</span>)
      <span style="color: #483d8b;">:body-section-header-prefix</span> (<span style="color: #8b2252;">"h1. "</span> <span style="color: #8b2252;">"h2. "</span> <span style="color: #8b2252;">"h3. "</span> <span style="color: #8b2252;">"h4. "</span> <span style="color: #8b2252;">"h5. "</span> <span style="color: #8b2252;">"h6. "</span>)
      <span style="color: #483d8b;">:body-section-header-format</span> <span style="color: #8b2252;">"%s"</span>
      <span style="color: #483d8b;">:body-section-header-suffix</span> (<span style="color: #8b2252;">"\n\n"</span>)
      <span style="color: #483d8b;">:body-header-section-numbers</span> nil
      <span style="color: #483d8b;">:body-header-section-number-format</span> <span style="color: #8b2252;">"%s) "</span>
      <span style="color: #483d8b;">:body-line-format</span> <span style="color: #8b2252;">"%s\n"</span>
      <span style="color: #483d8b;">:body-newline-paragraph</span> <span style="color: #8b2252;">"\n"</span>
      <span style="color: #483d8b;">:bold-format</span> <span style="color: #8b2252;">"*%s*"</span>
      <span style="color: #483d8b;">:italic-format</span> <span style="color: #8b2252;">"_%s_"</span>
      <span style="color: #483d8b;">:underline-format</span> <span style="color: #8b2252;">"+%s+"</span>
      <span style="color: #483d8b;">:strikethrough-format</span> <span style="color: #8b2252;">"-%s-"</span>
      <span style="color: #483d8b;">:verbatim-format</span> <span style="color: #8b2252;">"`%s`"</span>
      <span style="color: #483d8b;">:code-format</span> <span style="color: #8b2252;">"@%s@"</span>
      <span style="color: #483d8b;">:body-line-wrap</span>   75
      <span style="color: #483d8b;">:blockquote-start</span> <span style="color: #8b2252;">"\n&lt;pre&gt;\n"</span>
      <span style="color: #483d8b;">:blockquote-end</span> <span style="color: #8b2252;">"\n&lt;/pre&gt;\n"</span>
      ))

   (org-set-generic-type
   <span style="color: #8b2252;">"markdown"</span> 
   '(<span style="color: #483d8b;">:file-suffix</span>
     <span style="color: #8b2252;">".markdown"</span>
     <span style="color: #483d8b;">:key-binding</span>     ?M
     <span style="color: #483d8b;">:title-format</span>    <span style="color: #8b2252;">"Title: %s\n"</span>
     <span style="color: #483d8b;">:date-format</span>     <span style="color: #8b2252;">"Date: %s\n"</span>
     <span style="color: #483d8b;">:toc-export</span>      nil
     <span style="color: #483d8b;">:author-export</span>   t
     <span style="color: #483d8b;">:tags-export</span>     nil
     <span style="color: #483d8b;">:drawers-export</span>  nil
     <span style="color: #483d8b;">:date-export</span>     t
     <span style="color: #483d8b;">:timestamps-export</span>  t
     <span style="color: #483d8b;">:priorities-export</span>  nil
     <span style="color: #483d8b;">:todo-keywords-export</span> t
     <span style="color: #483d8b;">:body-line-fixed-format</span> <span style="color: #8b2252;">"\t%s\n"</span>
     <span style="color: #b22222;">;;</span><span style="color: #b22222;">:body-list-prefix "\n"</span>
     <span style="color: #483d8b;">:body-list-format</span> <span style="color: #8b2252;">"- %s"</span>
     <span style="color: #483d8b;">:body-list-suffix</span> <span style="color: #8b2252;">"\n"</span>
     <span style="color: #483d8b;">:header-prefix</span> (<span style="color: #8b2252;">""</span> <span style="color: #8b2252;">""</span> <span style="color: #8b2252;">"### "</span> <span style="color: #8b2252;">"#### "</span> <span style="color: #8b2252;">"##### "</span> <span style="color: #8b2252;">"###### "</span>)
     <span style="color: #483d8b;">:body-section-header-prefix</span> (<span style="color: #8b2252;">""</span> <span style="color: #8b2252;">""</span> <span style="color: #8b2252;">"### "</span> <span style="color: #8b2252;">"#### "</span> <span style="color: #8b2252;">"##### "</span> <span style="color: #8b2252;">"###### "</span>)
     <span style="color: #483d8b;">:body-section-header-format</span> <span style="color: #8b2252;">"%s\n"</span>
     <span style="color: #483d8b;">:body-section-header-suffix</span> (?= ?- <span style="color: #8b2252;">""</span>)
     <span style="color: #483d8b;">:body-header-section-numbers</span> nil
     <span style="color: #483d8b;">:body-header-section-number-format</span> <span style="color: #8b2252;">"%s) "</span>
     <span style="color: #483d8b;">:body-line-format</span> <span style="color: #8b2252;">"%s\n"</span>
     <span style="color: #483d8b;">:body-newline-paragraph</span> <span style="color: #8b2252;">"\n"</span>
     <span style="color: #483d8b;">:bold-format</span> <span style="color: #8b2252;">"**%s**"</span>
     <span style="color: #483d8b;">:italic-format</span> <span style="color: #8b2252;">"_%s_"</span>
     <span style="color: #483d8b;">:verbatim-format</span> <span style="color: #8b2252;">"`%s`"</span>
     <span style="color: #483d8b;">:code-format</span> <span style="color: #8b2252;">"`%s`"</span>
     <span style="color: #483d8b;">:body-line-wrap</span>   75
     ))
   ))
</pre>
</div>

<p>
<code>org-set-generic-type</code> を <code>.emacs</code> に追記した後， <code>C-c C-e g &lt;key-binding&gt;</code> とすればよい． <code>&lt;key-binding&gt;</code> は <code>org-set-generic-type</code> で設定する値である．2つ目は，Markdown へのエクスポーターである．<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline159" class="outline-3">
<h3 id="orgheadline159"><span class="section-number-3">10.22</span> [org-odt] ODT形式に出力</h3>
<div class="outline-text-3" id="text-10-22">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(ox-odt) <span style="color: #8b2252;">"ox-odt"</span> nil t nil
 '((setq org-odt-styles-file
         (concat (getenv <span style="color: #8b2252;">"HOME"</span>) <span style="color: #8b2252;">"/Dropbox/emacs.d/config/style.odt"</span>))
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq org-odt-content-template-file</span>
   <span style="color: #b22222;">;;       </span><span style="color: #b22222;">(concat (getenv "HOME") "/Dropbox/emacs.d/config/style.ott"))</span>
   (setq org-odt-preferred-output-format <span style="color: #8b2252;">"pdf"</span>) <span style="color: #b22222;">;; </span><span style="color: #b22222;">docx</span>
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">ox-odt.el &#12398; &#33258;&#20316;&#12497;&#12483;&#12481;&#12398;&#22793;&#25968;&#65288;DOCSTRING&#12364;&#35352;&#36848;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#65289;</span>
   (setq org-odt-apply-custom-punctuation t)
   (setq org-odt-convert-processes
         '((<span style="color: #8b2252;">"LibreOffice"</span>
            <span style="color: #8b2252;">"/Applications/LibreOffice.app/Contents/MacOS/soffice --headless --convert-to %f%x --outdir %d %i"</span>)
           (<span style="color: #8b2252;">"unoconv"</span> <span style="color: #8b2252;">"unoconv -f %f -o %d %i"</span>)))))
</pre>
</div>
</div>
</div>
