init.org
** [org-crypt] ツリーを暗号化する

=M-x org-encrypt-entry= でカーソル位置のツリーを暗号化できます．復号は， =M-x org-decrypt-entry= にて．ただし，バッファのバックアップファイルが生成されていることに気をつけてください．自分の場合は，バックアップファイルは外部ホストに同期されない設定にしてあるので，とりあえず問題なしと考えています．

=M-x org-encrypt-entries= で，特定のタグが付けられたツリーを一括処理することもできますが，私は安全性を考慮して使っていません．

なお，実戦投入には十分なテストをしてからの方がよいでしょう．org バッファを外部ホストと同期している場合，転送先のホストでも暗号化／復号ができるかを確認するべきです．他方のホストでツリーにドロワーが付くと，復号できなくなったりします．その時は慌てずにプロパティのドロワーを削除すればOKです．

#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-autoload-if-found
   '(org-crypt org-encrypt-entry org-decrypt-entry) "org-crypt" "Org Mode" t nil
   '((setq org-crypt-key "<insert your key>")
     ;; org-encrypt-entries の影響を受けるタグを指定
     (setq org-tags-exclude-from-inheritance (quote ("secret")))
     ;; 自動保存の確認を無効に
     (setq org-crypt-disable-auto-save 'nil)))
#+END_SRC

** [org-mac-link] 外部アプリから情報を取る

=org-mac-link= を使うと，外部アプリの表示状態をリンクとして取得して，orgバッファに流し込めます．Mac環境用です．簡単な例ではURLで，取得したリンクを =C-c C-o= で開けばブラウザが起動してリンク先が表示できます．同じ話を，ファインダーで表示しているディレクトリ，メーラーで表示していた特定のメール，PDFビューアで表示していた特定のファイルの特定のページなどで実施できます．対応している外部アプリは，Finder, Mail.app, Outlook, Addressbook, Safari, Firefox, Chrome, そして Skimです．

次のように設定すると，org-modeの時に =C-c c= すればミニバッファにどのアプリからリンク情報を取るか選べます．Chrome には =c= が当たっているので，ブラウジング中に記になる記事があったらEmacsに切り替えて， =C-c c c= とすると，URLが自動でバッファに入ります．単なるURLではなく，タイトルで表示されるのでわかりやすいです．

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org"
    (add-to-list 'org-modules 'org-mac-iCal)
    (add-to-list 'org-modules 'org-mac-link) ;; includes org-mac-message
    (define-key org-mode-map (kbd "C-c c") 'org-mac-grab-link))
#+END_SRC

** [terminal-notifier] イベント通知

Mac の通知機能を使って，Emacsで発生するイベントをユーザに通知します． =appt-disp-window= をカスタマイズして =org-notify= を呼ぶことで， =org-agenda= のアイテムも通知されます．

=org-show-notification-handler= に =terminal-notifier.app= を呼ぶ関数をぶら下げることで， =org-notify= で簡単に通知機能を使えるようになります．

=terminal-notifier-sound= に =terminal-notifier.app= で指定可能な音声ファイル名を指定すると，通知音を制御できます．

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "org"
    (defvar terminal-notifier-command
      (executable-find
       "terminal-notifier.app/Contents/MacOS/terminal-notifier")
      "Path to terminal-notifier.
        Download from https://github.com/julienXX/terminal-notifier/releases")

    (defvar terminal-notifier-sound nil)
    (with-eval-after-load "org-clock"
      (when (not org-clock-sound)
        ;; Select from Preferences: { Funk | Glass | ... | Purr | Pop ... }
        (setq terminal-notifier-sound "Pop"))) 

    (defun terminal-notifier-notify (title message &optional sound)
      "Show a message with `terminal-notifier-command`."
      (if (and sound (not (string= sound "")))
          (start-process "terminal-notifier" "*terminal-notifier*"
                         terminal-notifier-command
                         "-title" title "-message" message
                         "-activate" "org.gnu.Emacs" "-sound" sound) ;; FIXME
        (start-process "terminal-notifier" "*terminal-notifier*"
                       terminal-notifier-command
                       "-title" title "-message" message
                       "-activate" "org.gnu.Emacs")))

    (defvar use-terminal-notifier t)
    (defun terminal-notifier-toggle ()
      (interactive)
      (setq use-terminal-notifier (not use-terminal-notifier))
      (my:org-agenda-to-appt)
      (message "terminal-notifier: %s" use-terminal-notifier))
    (define-key org-mode-map (kbd "C-c f n") 'terminal-notifier-toggle)

    ;; eval (org-notify "hoge") to test this setting
    (setq org-show-notification-handler
          #'(lambda (message)
              (when use-terminal-notifier
                (terminal-notifier-notify
                 "Message from org-mode" message terminal-notifier-sound))))

    (defun advice:appt-disp-window (min-to-app new-time appt-msg)
      "Extension to support org-notify."
      (let ((time-msg (concat "in " min-to-app " min.")))
        (when (string= min-to-app "0")
          (setq time-msg "<= Do Now!!"))
        (org-notify (concat "\\\"" appt-msg "\" " time-msg))))
    (advice-add 'appt-disp-window :before #'advice:appt-disp-window))
#+END_SRC

*** References

  - http://blog.devnode.pl/blog/2012/01/04/get-notified/
  - https://github.com/p-m/org-notify/blob/master/org-notify.el
  - http://sheephead.homelinux.org/2015/01/10/7220/

** [org-grep] org ファイルを grep する

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(org-grep) "org-grep" nil t nil
         '((setq org-grep-extensions nil)
           (add-to-list 'org-grep-directories "~/.emacs.d")
           (add-to-list 'org-grep-directories "~/.emacs.d/.cask/package")))

    (global-set-key (kbd "C-M-g") 'org-grep))
#+END_SRC

** README を常に org-mode で開く

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         'org-mode "org")
    (push '("[rR][eE][aA][dD][mM][eE]" . org-mode) auto-mode-alist))
#+END_SRC

