init.html

<div id="outline-container-orgheadline160" class="outline-3">
<h3 id="orgheadline160"><span class="section-number-3">10.23</span> [org-crypt] ツリーを暗号化する</h3>
<div class="outline-text-3" id="text-10-23">
<p>
<code>M-x org-encrypt-entry</code> でカーソル位置のツリーを暗号化できます．復号は， <code>M-x org-decrypt-entry</code> にて．ただし，バッファのバックアップファイルが生成されていることに気をつけてください．自分の場合は，バックアップファイルは外部ホストに同期されない設定にしてあるので，とりあえず問題なしと考えています．<br  />
</p>

<p>
<code>M-x org-encrypt-entries</code> で，特定のタグが付けられたツリーを一括処理することもできますが，私は安全性を考慮して使っていません．<br  />
</p>

<p>
なお，実戦投入には十分なテストをしてからの方がよいでしょう．org バッファを外部ホストと同期している場合，転送先のホストでも暗号化／復号ができるかを確認するべきです．他方のホストでツリーにドロワーが付くと，復号できなくなったりします．その時は慌てずにプロパティのドロワーを削除すればOKです．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-crypt <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
 '((setq org-crypt-key <span style="color: #8b2252;">"&lt;insert your key&gt;"</span>)
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">org-encrypt-entries &#12398;&#24433;&#38911;&#12434;&#21463;&#12369;&#12427;&#12479;&#12464;&#12434;&#25351;&#23450;</span>
   (setq org-tags-exclude-from-inheritance (quote (<span style="color: #8b2252;">"secret"</span>)))
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#33258;&#21205;&#20445;&#23384;&#12398;&#30906;&#35469;&#12434;&#28961;&#21177;&#12395;</span>
   (setq org-crypt-disable-auto-save 'nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline161" class="outline-3">
<h3 id="orgheadline161"><span class="section-number-3">10.24</span> [org-mac-link] 外部アプリから情報を取る</h3>
<div class="outline-text-3" id="text-10-24">
<p>
<code>org-mac-link</code> を使うと，外部アプリの表示状態をリンクとして取得して，orgバッファに流し込めます．Mac環境用です．簡単な例ではURLで，取得したリンクを <code>C-c C-o</code> で開けばブラウザが起動してリンク先が表示できます．同じ話を，ファインダーで表示しているディレクトリ，メーラーで表示していた特定のメール，PDFビューアで表示していた特定のファイルの特定のページなどで実施できます．対応している外部アプリは，Finder, Mail.app, Outlook, Addressbook, Safari, Firefox, Chrome, そして Skimです．<br  />
</p>

<p>
次のように設定すると，org-modeの時に <code>C-c c</code> すればミニバッファにどのアプリからリンク情報を取るか選べます．Chrome には <code>c</code> が当たっているので，ブラウジング中に記になる記事があったらEmacsに切り替えて， <code>C-c c c</code> とすると，URLが自動でバッファに入ります．単なるURLではなく，タイトルで表示されるのでわかりやすいです．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"org"</span>
  (add-to-list 'org-modules 'org-mac-iCal)
  (add-to-list 'org-modules 'org-mac-link) <span style="color: #b22222;">;; </span><span style="color: #b22222;">includes org-mac-message</span>
  (define-key org-mode-map (kbd <span style="color: #8b2252;">"C-c c"</span>) 'org-mac-grab-link))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline162" class="outline-3">
<h3 id="orgheadline162"><span class="section-number-3">10.25</span> [org-notify] 通知</h3>
<div class="outline-text-3" id="text-10-25">
<p>
org-mode の通知に独自関数をぶら下げています．<br  />
</p>

<ul class="org-ul">
<li><a href="http://blog.devnode.pl/blog/2012/01/04/get-notified/">http://blog.devnode.pl/blog/2012/01/04/get-notified/</a><br  /></li>
<li><a href="https://github.com/p-m/org-notify/blob/master/org-notify.el">https://github.com/p-m/org-notify/blob/master/org-notify.el</a><br  /></li>
<li><a href="http://sheephead.homelinux.org/2015/01/10/7220/">http://sheephead.homelinux.org/2015/01/10/7220/</a><br  /></li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'org-mode <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
 '((setq org-show-notification-handler
        '(<span style="color: #a020f0;">lambda</span> (notification)
           (my:desktop-notify <span style="color: #8b2252;">"osx-native"</span> <span style="color: #8b2252;">"org-mode notification"</span>
                              01 01 notification nil)
           (message notification)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline163" class="outline-3">
<h3 id="orgheadline163"><span class="section-number-3">10.26</span> [org-grep] org ファイルを grep する</h3>
<div class="outline-text-3" id="text-10-26">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(org-grep) <span style="color: #8b2252;">"org-grep"</span> nil t nil
       '((setq org-grep-extensions nil)
         (add-to-list 'org-grep-directories <span style="color: #8b2252;">"~/.emacs.d"</span>)
         (add-to-list 'org-grep-directories <span style="color: #8b2252;">"~/.emacs.d/.cask/package"</span>)))
  (global-set-key (kbd <span style="color: #8b2252;">"C-M-g"</span>) 'org-grep))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline164" class="outline-3">
<h3 id="orgheadline164"><span class="section-number-3">10.27</span> <span class="todo READ">READ</span> ME を常に org-mode で開く</h3>
<div class="outline-text-3" id="text-10-27">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
'org-mode <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
'((push '(<span style="color: #8b2252;">"[rR][eE][aA][dD][mM][eE]"</span> . org-mode) auto-mode-alist)))
</pre>
</div>
</div>
</div>
