init.el
 '(org-crypt org-encrypt-entry org-decrypt-entry) "org-crypt" "Org Mode" t nil
 '((setq org-crypt-key "<insert your key>")
   ;; org-encrypt-entries の影響を受けるタグを指定
   (setq org-tags-exclude-from-inheritance (quote ("secret")))
   ;; 自動保存の確認を無効に
   (setq org-crypt-disable-auto-save 'nil)))

(with-eval-after-load "org"
  (add-to-list 'org-modules 'org-mac-iCal)
  (add-to-list 'org-modules 'org-mac-link) ;; includes org-mac-message
  (define-key org-mode-map (kbd "C-c c") 'org-mac-grab-link))

(with-eval-after-load "org"
  (defvar terminal-notifier-command
    (executable-find
     "terminal-notifier.app/Contents/MacOS/terminal-notifier")
    "Path to terminal-notifier.
      Download from https://github.com/julienXX/terminal-notifier/releases")

  (defvar terminal-notifier-sound nil)
  (with-eval-after-load "org-clock"
    (when (not org-clock-sound)
      ;; Select from Preferences: { Funk | Glass | ... | Purr | Pop ... }
      (setq terminal-notifier-sound "Pop"))) 

  (defun terminal-notifier-notify (title message &optional sound)
    "Show a message with `terminal-notifier-command`."
    (if (and sound (not (string= sound "")))
        (start-process "terminal-notifier" "*terminal-notifier*"
                       terminal-notifier-command
                       "-title" title "-message" message
                       "-activate" "org.gnu.Emacs" "-sound" sound) ;; FIXME
      (start-process "terminal-notifier" "*terminal-notifier*"
                     terminal-notifier-command
                     "-title" title "-message" message
                     "-activate" "org.gnu.Emacs")))

  (defvar use-terminal-notifier t)
  (defun terminal-notifier-toggle ()
    (interactive)
    (setq use-terminal-notifier (not use-terminal-notifier))
    (my:org-agenda-to-appt)
    (message "terminal-notifier: %s" use-terminal-notifier))
  (define-key org-mode-map (kbd "C-c f n") 'terminal-notifier-toggle)

  ;; eval (org-notify "hoge") to test this setting
  (setq org-show-notification-handler
        #'(lambda (message)
            (when use-terminal-notifier
              (terminal-notifier-notify
               "Message from org-mode" message terminal-notifier-sound))))

  (defun advice:appt-disp-window (min-to-app new-time appt-msg)
    "Extension to support org-notify."
    (let ((time-msg (concat "in " min-to-app " min.")))
      (when (string= min-to-app "0")
        (setq time-msg "<= Do Now!!"))
      (org-notify (concat "\\\"" appt-msg "\" " time-msg))))
  (advice-add 'appt-disp-window :before #'advice:appt-disp-window))

(when (eval-after-autoload-if-found
       '(org-grep) "org-grep" nil t nil
       '((setq org-grep-extensions nil)
         (add-to-list 'org-grep-directories "~/.emacs.d")
         (add-to-list 'org-grep-directories "~/.emacs.d/.cask/package")))

  (global-set-key (kbd "C-M-g") 'org-grep))

(when (eval-after-autoload-if-found
       'org-mode "org")
  (push '("[rR][eE][aA][dD][mM][eE]" . org-mode) auto-mode-alist))
