init.org
** Growlnotify と org-mode でアラーム管理

（注）Growlnotify の代わりに =terminal-notifier= を使うこともできます．

growlnotify と org-mode のバッファを組み合わせてアラームリストを管理しています．アラームをorgバッファに書き込むだけなので，とても楽です．機能としては，特定のorgバッファに，時刻とアラームの内容を表の形式として保存しておくだけで，Emacs が起動している限りにおいて growl がそのアラームを表示してくれます．つまり，アラームリストは org-mode の表で一覧化されているので，管理も楽ですし，見た目もわかりやすいです．

アラームとして解釈される表は，オプション，時刻（HH:MM形式），アラーム内容の3列で構成していればOKです．オプションの列にXを入れておくと，growl がStickyモードで動作するので，アラームを見逃しません．

アラームは複数登録することができます．不要になったアラームを削除するのは，単純に表から当該の行を削除するだけで済みます．実際のところは，バッファが保存される時にアラームリストの変更が自動的にシステムに反映されるので，余計な作業は不要です．

=set-alarms-from-file= は，[[http://pastelwill.jp/wiki/doku.php?id=emacs:utility.el][utility.el]]に記述した関数です．

#+BEGIN_SRC emacs-lisp :tangle yes
  (with-eval-after-load "utility"
    (set-alarms-from-file "~/Dropbox/org/today.org")
    (defun my:update-alarms-from-file ()
      (when (string= "today.org" (buffer-name))
        (set-alarms-from-file "~/Dropbox/org/today.org"))))

  (when (library-p "utility")
    (add-hook 'after-save-hook 'my:update-alarms-from-file))
#+END_SRC

*** キーバインド
#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         'org-mode "org" "Org Mode" t nil
         '(;; (org-transpose-element) が割り当てられているので取り返す．
           (org-defkey org-mode-map "\C-\M-t" 'beginning-of-buffer)

           ;;(define-key org-mode-map (kbd "C-c 1")
           ;;  'org-export-icalendar-combine-agenda-files)
           (define-key org-mode-map (kbd "C-c f 1") 'my:ox-icalendar)
           (defun my:do-org-update-staistics-cookies ()
             (interactive)
             (message "Update statistics ...")
             (do-org-update-statistics-cookies))
           (define-key org-mode-map (kbd "C-c f 2")
             'my:do-org-update-staistics-cookies)
           (define-key org-mode-map (kbd "C-c m") 'org-mobile-sync)
           (define-key org-mode-map (kbd "<f5>") 'org-narrow-to-subtree)
           (define-key org-mode-map (kbd "S-<f5>") 'widen)))

    (global-set-key (kbd "S-<f12>")
                    '(lambda () (interactive) (show-org-buffer "work.org")))
    (global-set-key (kbd "C-M-o")
                    '(lambda () (interactive) (show-org-buffer "next.org")))
    (global-set-key (kbd "C-M-c") 
                    '(lambda () (interactive) (show-org-buffer "org-ical.org")))
    (global-set-key (kbd "C-M-9") 
                    '(lambda () (interactive) (show-org-buffer "buffer.org")))
    (global-set-key (kbd "C-M-0") 
                    '(lambda () (interactive) (show-org-buffer "today.org")))
    (global-set-key (kbd "C-c l") 'org-store-link)
    (global-set-key (kbd "C-c a") 'org-agenda)
    (global-set-key (kbd "C-c r") 'org-capture))
#+END_SRC

