init.html

<div id="outline-container-orgheadline166" class="outline-3">
<h3 id="orgheadline166"><span class="section-number-3">10.28</span> Growlnotify と org-mode でアラーム管理</h3>
<div class="outline-text-3" id="text-10-28">
<p>
growlnotify と org-mode のバッファを組み合わせてアラームリストを管理しています．アラームをorgバッファに書き込むだけなので，とても楽です．機能としては，特定のorgバッファに，時刻とアラームの内容を表の形式として保存しておくだけで，Emacs が起動している限りにおいて growl がそのアラームを表示してくれます．つまり，アラームリストは org-mode の表で一覧化されているので，管理も楽ですし，見た目もわかりやすいです．<br  />
</p>

<p>
アラームとして解釈される表は，オプション，時刻（HH:MM形式），アラーム内容の3列で構成していればOKです．オプションの列にXを入れておくと，growl がStickyモードで動作するので，アラームを見逃しません．<br  />
</p>

<p>
アラームは複数登録することができます．不要になったアラームを削除するのは，単純に表から当該の行を削除するだけで済みます．実際のところは，バッファが保存される時にアラームリストの変更が自動的にシステムに反映されるので，余計な作業は不要です．<br  />
</p>

<p>
<code>set-alarms-from-file</code> は，<a href="http://pastelwill.jp/wiki/doku.php?id=emacs:utility.el">utility.el</a>に記述した関数です．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(set-alarms-from-file my:update-alarms-from-file) <span style="color: #8b2252;">"utility"</span> nil t nil
       '((set-alarms-from-file <span style="color: #8b2252;">"~/Dropbox/org/today.org"</span>)
         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:update-alarms-from-file</span> ()
           (interactive)
           (<span style="color: #a020f0;">when</span> (string-match (file-name-base <span style="color: #8b2252;">"today.org"</span>) (buffer-name))
             (message <span style="color: #8b2252;">"The alarm list has been updated."</span>)
             (set-alarms-from-file <span style="color: #8b2252;">"~/Dropbox/org/today.org"</span>)))))
  (add-hook 'after-save-hook 'my:update-alarms-from-file))
</pre>
</div>
</div>

<div id="outline-container-orgheadline165" class="outline-4">
<h4 id="orgheadline165"><span class="section-number-4">10.28.1</span> キーバインド</h4>
<div class="outline-text-4" id="text-10-28-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       'org-mode <span style="color: #8b2252;">"org"</span> <span style="color: #8b2252;">"Org Mode"</span> t nil
       '(<span style="color: #b22222;">;; </span><span style="color: #b22222;">(org-transpose-element) &#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12390;&#12356;&#12427;&#12398;&#12391;&#21462;&#12426;&#36820;&#12377;&#65294;</span>
         (org-defkey org-mode-map <span style="color: #8b2252;">"\C-\M-t"</span> 'beginning-of-buffer)

         <span style="color: #b22222;">;;</span><span style="color: #b22222;">(define-key org-mode-map (kbd "C-c 1")</span>
         <span style="color: #b22222;">;;  </span><span style="color: #b22222;">'org-export-icalendar-combine-agenda-files)</span>
         (define-key org-mode-map (kbd <span style="color: #8b2252;">"C-c f 1"</span>) 'my:ox-icalendar)
         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:do-org-update-staistics-cookies</span> ()
           (interactive)
           (message <span style="color: #8b2252;">"Update statistics ..."</span>)
           (do-org-update-statistics-cookies))
         (define-key org-mode-map (kbd <span style="color: #8b2252;">"C-c f 2"</span>)
           'my:do-org-update-staistics-cookies)
         (define-key org-mode-map (kbd <span style="color: #8b2252;">"C-c m"</span>) 'org-mobile-sync)
         (define-key org-mode-map (kbd <span style="color: #8b2252;">"&lt;f5&gt;"</span>) 'org-narrow-to-subtree)
         (define-key org-mode-map (kbd <span style="color: #8b2252;">"S-&lt;f5&gt;"</span>) 'widen)))

  (global-set-key (kbd <span style="color: #8b2252;">"S-&lt;f12&gt;"</span>)
                  '(<span style="color: #a020f0;">lambda</span> () (interactive) (show-org-buffer <span style="color: #8b2252;">"work.org"</span>)))
  (global-set-key (kbd <span style="color: #8b2252;">"C-M-o"</span>)
                  '(<span style="color: #a020f0;">lambda</span> () (interactive) (show-org-buffer <span style="color: #8b2252;">"next.org"</span>)))
  (global-set-key (kbd <span style="color: #8b2252;">"C-M-c"</span>) 
                  '(<span style="color: #a020f0;">lambda</span> () (interactive) (show-org-buffer <span style="color: #8b2252;">"org-ical.org"</span>)))
  (global-set-key (kbd <span style="color: #8b2252;">"C-M-9"</span>) 
                  '(<span style="color: #a020f0;">lambda</span> () (interactive) (show-org-buffer <span style="color: #8b2252;">"buffer.org"</span>)))
  (global-set-key (kbd <span style="color: #8b2252;">"C-M-0"</span>) 
                  '(<span style="color: #a020f0;">lambda</span> () (interactive) (show-org-buffer <span style="color: #8b2252;">"today.org"</span>)))
  (global-set-key (kbd <span style="color: #8b2252;">"C-c l"</span>) 'org-store-link)
  (global-set-key (kbd <span style="color: #8b2252;">"C-c a"</span>) 'org-agenda)
  (global-set-key (kbd <span style="color: #8b2252;">"C-c r"</span>) 'org-capture))
</pre>
</div>
</div>
</div>
</div>
