init.el

(with-eval-after-load "utility"
  (set-alarms-from-file "~/Dropbox/org/today.org")
  (defun my:update-alarms-from-file ()
    (when (string= "today.org" (buffer-name))
      (set-alarms-from-file "~/Dropbox/org/today.org"))))

(when (library-p "utility")
  (add-hook 'after-save-hook 'my:update-alarms-from-file))

(when (eval-after-autoload-if-found
       'org-mode "org" "Org Mode" t nil
       '(;; (org-transpose-element) が割り当てられているので取り返す．
         (org-defkey org-mode-map "\C-\M-t" 'beginning-of-buffer)

         ;;(define-key org-mode-map (kbd "C-c 1")
         ;;  'org-export-icalendar-combine-agenda-files)
         (define-key org-mode-map (kbd "C-c f 1") 'my:ox-icalendar)
         (defun my:do-org-update-staistics-cookies ()
           (interactive)
           (message "Update statistics ...")
           (do-org-update-statistics-cookies))
         (define-key org-mode-map (kbd "C-c f 2")
           'my:do-org-update-staistics-cookies)
         (define-key org-mode-map (kbd "C-c m") 'org-mobile-sync)
         (define-key org-mode-map (kbd "<f5>") 'org-narrow-to-subtree)
         (define-key org-mode-map (kbd "S-<f5>") 'widen)))

  (global-set-key (kbd "S-<f12>")
                  '(lambda () (interactive) (show-org-buffer "work.org")))
  (global-set-key (kbd "C-M-o")
                  '(lambda () (interactive) (show-org-buffer "next.org")))
  (global-set-key (kbd "C-M-c") 
                  '(lambda () (interactive) (show-org-buffer "org-ical.org")))
  (global-set-key (kbd "C-M-9") 
                  '(lambda () (interactive) (show-org-buffer "buffer.org")))
  (global-set-key (kbd "C-M-0") 
                  '(lambda () (interactive) (show-org-buffer "today.org")))
  (global-set-key (kbd "C-c l") 'org-store-link)
  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c r") 'org-capture))

(when (eval-after-autoload-if-found
