init.html
<div id="outline-container-orgheadline167" class="outline-3">
<h3 id="orgheadline167"><span class="section-number-3">10.29</span> org-mode の latex エクスポート関数をオーバーライド</h3>
<div class="outline-text-3" id="text-10-29">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;;; </span><span style="color: #b22222;">Tex export (org-mode -&gt; tex with beamer class) ;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq org-export-latex-classes</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">'(("article"</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">"\\documentclass[11pt]{article}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage[AUTO]{inputenc}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage[T1]{fontenc}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{graphicx}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{longtable}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{float}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{wrapfig}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{soul}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{amssymb}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{hyperref}"</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\section{%s}" . "\\section*{%s}")</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\subsection{%s}" . "\\subsection*{%s}")</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\subsubsection{%s}" . "\\subsubsection*{%s}")</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\paragraph{%s}" . "\\paragraph*{%s}")</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\subparagraph{%s}" . "\\subparagraph*{%s}"))</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">("report"</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">"\\documentclass[11pt]{report}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage[AUTO]{inputenc}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage[T1]{fontenc}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{graphicx}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{longtable}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{float}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{wrapfig}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{soul}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{amssymb}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{hyperref}"</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\part{%s}" . "\\part*{%s}")</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\chapter{%s}" . "\\chapter*{%s}")</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\section{%s}" . "\\section*{%s}")</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\subsection{%s}" . "\\subsection*{%s}")</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\subsubsection{%s}" . "\\subsubsection*{%s}"))</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">("book"</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">"\\documentclass[11pt]{book}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage[AUTO]{inputenc}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage[T1]{fontenc}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{graphicx}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{longtable}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{float}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{wrapfig}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{soul}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{amssymb}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{hyperref}"</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\part{%s}" . "\\part*{%s}")</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\chapter{%s}" . "\\chapter*{%s}")</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\section{%s}" . "\\section*{%s}")</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\subsection{%s}" . "\\subsection*{%s}")</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">("\\subsubsection{%s}" . "\\subsubsection*{%s}"))</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">("beamer"</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">"\\documentclass{beamer}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage[AUTO]{inputenc}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{graphicx}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{longtable}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{float}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{wrapfig}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{amssymb}</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">\\usepackage{hyperref}"</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">org-beamer-sectioning)))</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline184" class="outline-2">
<h2 id="orgheadline184"><span class="section-number-2">11</span> フォント／配色関連</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-orgheadline169" class="outline-3">
<h3 id="orgheadline169"><span class="section-number-3">11.1</span> 正規表現を見やすくする</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-face-foreground 'font-lock-regexp-grouping-backslash <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #66CC99;">#66CC99</span><span style="color: #8b2252;">"</span>)
(set-face-foreground 'font-lock-regexp-grouping-construct <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #9966CC;">#9966CC</span><span style="color: #8b2252;">"</span>)
</pre>
</div>

<p>
Emacs Lisp での正規表現入力をサポートするツールには， <code>M-x re-builder</code> や <code>rx</code> マクロがある．<br  />
</p>

<ul class="org-ul">
<li><a href="http://www.emacswiki.org/emacs/ReBuilder">EmacsWiki: Re Builder</a><br  /></li>
<li><a href="http://emacswiki.org/emacs/rx">EmacsWiki: rx</a><br  /></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline170" class="outline-3">
<h3 id="orgheadline170"><span class="section-number-3">11.2</span> 設定ファイルを見やすくする</h3>
<div class="outline-text-3" id="text-11-2">
<p>
<code>generic-x</code> を使うと， <code>/etc/hosts</code> や <code>/etc/apache2.conf</code> に色を付けられる．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">generic-x</span> nil t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline171" class="outline-3">
<h3 id="orgheadline171"><span class="section-number-3">11.3</span> カーソル行に色をつける</h3>
<div class="outline-text-3" id="text-11-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Color of the current line</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Cite: http://murakan.cocolog-nifty.com/blog/2009/01/emacs-tips-1d45.html</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">see also http://www.emacswiki.org/cgi-bin/emacs/highlight-current-line.el</span>
(global-hl-line-mode t)
(set-face-background 'hl-line <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #DEEDFF;">#DEEDFF</span><span style="color: #8b2252;">"</span>)
</pre>
</div>
</div>
</div>
