init.org
** カーソルの色

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Cursor (see also takaxp-mac.el)
  ;;(add-to-list 'default-frame-alist '(cursor-type . (hbar . 5)))
  ;;(add-to-list 'default-frame-alist '(cursor-type . bar))
  ;;(add-hook 'window-configuration-change-hook

  (defvar my:cursor-color-ime-on "#91C3FF")
  (defvar my:cursor-color-ime-off "#AAAAAA")
  (set-cursor-color my:cursor-color-ime-on)

  (when (and (eq window-system 'ns) (>= emacs-major-version 24))
    ;; when IME is ON
    (when (fboundp 'mac-set-input-method-parameter)
      (mac-set-input-method-parameter
       "com.google.inputmethod.Japanese.base" 'title "グ"))

    (defun my:update-cursor-color ()
      (interactive)
      (if current-input-method (set-cursor-color my:cursor-color-ime-off)
        (set-cursor-color my:cursor-color-ime-on)))
    ;; (my:update-cursor-color)
    (run-with-idle-timer 10 t 'my:update-cursor-color))

  (add-hook 'input-method-activate-hook
            (lambda () (set-cursor-color my:cursor-color-ime-on)))
  (add-hook 'input-method-inactivate-hook
            (lambda () (set-cursor-color my:cursor-color-ime-off)))
#+END_SRC

** カーソルを点滅させない

#+BEGIN_SRC emacs-lisp :tangle yes
;; Disable cursor blink
(blink-cursor-mode -1)
#+END_SRC

** カーソル位置のフォントを確認

=M-x describe-char= することで，カーソル位置のフォントの情報がポップで表示される．

