init.html

<div id="outline-container-orgheadline172" class="outline-3">
<h3 id="orgheadline172"><span class="section-number-3">11.4</span> カーソルの色</h3>
<div class="outline-text-3" id="text-11-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Cursor (see also takaxp-mac.el)</span>
<span style="color: #b22222;">;;</span><span style="color: #b22222;">(add-to-list 'default-frame-alist '(cursor-type . (hbar . 5)))</span>
<span style="color: #b22222;">;;</span><span style="color: #b22222;">(add-to-list 'default-frame-alist '(cursor-type . bar))</span>
<span style="color: #b22222;">;;</span><span style="color: #b22222;">(add-hook 'window-configuration-change-hook</span>

(<span style="color: #a020f0;">if</span> (and (eq window-system 'ns) (&gt;= emacs-major-version 24))
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">when IME is ON</span>
    (<span style="color: #a020f0;">when</span> (fboundp 'mac-set-input-method-parameter)
      (mac-set-input-method-parameter
       <span style="color: #8b2252;">"com.google.inputmethod.Japanese.base"</span> 'title <span style="color: #8b2252;">"&#12464;"</span>))

  (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">update-cursor-color</span> ()
    (interactive)
    (<span style="color: #a020f0;">if</span> current-input-method (set-cursor-color <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #91C3FF;">#91C3FF</span><span style="color: #8b2252;">"</span>)
      (set-cursor-color <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #AAAAAA;">#AAAAAA</span><span style="color: #8b2252;">"</span>)))
  (update-cursor-color)
  (run-with-idle-timer 10 t 'update-cursor-color))

(set-cursor-color <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #91C3FF;">#91C3FF</span><span style="color: #8b2252;">"</span>)
(add-hook 'input-method-activate-hook
          (<span style="color: #a020f0;">lambda</span> () (set-cursor-color <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #91C3FF;">#91C3FF</span><span style="color: #8b2252;">"</span>)))
(add-hook 'input-method-inactivate-hook
          (<span style="color: #a020f0;">lambda</span> () (set-cursor-color <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #AAAAAA;">#AAAAAA</span><span style="color: #8b2252;">"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline173" class="outline-3">
<h3 id="orgheadline173"><span class="section-number-3">11.5</span> カーソルを点滅させない</h3>
<div class="outline-text-3" id="text-11-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Disable cursor blink</span>
(blink-cursor-mode -1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline174" class="outline-3">
<h3 id="orgheadline174"><span class="section-number-3">11.6</span> カーソル位置のフォントを確認</h3>
<div class="outline-text-3" id="text-11-6">
<p>
<code>M-x describe-char</code> することで，カーソル位置のフォントの情報がポップで表示される．<br  />
</p>
</div>
</div>
