init.html

<div id="outline-container-orgheadline177" class="outline-3">
<h3 id="orgheadline177"><span class="section-number-3">11.7</span> フォント設定</h3>
<div class="outline-text-3" id="text-11-7">
<p>
表のような利用環境に対して，個別に設定を施しています．WindowsとLinuxは安定版のEmacs23で，Macは開発版のCocoaEmacs23です．MacではEmacs24でもうまく表示できています．最近は，<a href="http://mix-mplus-ipa.sourceforge.jp/migu/">Migu 2M</a>を気に入って使っています．<br  />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">ASCII</td>
<td class="org-left">日本語</td>
</tr>

<tr>
<td class="org-left">Mac</td>
<td class="org-left">Monaco</td>
<td class="org-left">ヒラギノ丸ゴ</td>
</tr>

<tr>
<td class="org-left">Windows</td>
<td class="org-left">Inconsolata</td>
<td class="org-left">メイリオ</td>
</tr>

<tr>
<td class="org-left">Linux</td>
<td class="org-left">Inconsolata</td>
<td class="org-left">MigMix</td>
</tr>
</tbody>
</table>

<p>
<a href="http://d.hatena.ne.jp/setoryohei/20110117/1295336454">http://d.hatena.ne.jp/setoryohei/20110117/1295336454</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">  (<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">my:font-size</span> 12)
  (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:ja-font-setter</span> (spec)
    (set-fontset-font nil 'japanese-jisx0208 spec)
    (set-fontset-font nil 'katakana-jisx0201 spec)
    (set-fontset-font nil 'japanese-jisx0212 spec)
    (set-fontset-font nil '(#x0080 . #x024F) spec)
    (set-fontset-font nil '(#x0370 . #x03FF) spec)
    (set-fontset-font nil 'mule-unicode-0100-24ff spec))
  (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:ascii-font-setter</span> (spec)
    (set-fontset-font nil 'ascii spec))      

  (<span style="color: #a020f0;">cond</span>
   <span style="color: #b22222;">;; </span><span style="color: #b22222;">CocoaEmacs</span>
   ((eq window-system 'ns)
    (<span style="color: #a020f0;">when</span> (or (= emacs-major-version 23) (= emacs-major-version 24))
      (<span style="color: #a020f0;">let</span>
          <span style="color: #b22222;">;; </span><span style="color: #b22222;">1) Monaco, Hiragino/Migu 2M : font-size=12, -apple-hiragino=1.2</span>
          <span style="color: #b22222;">;; </span><span style="color: #b22222;">2) Inconsolata, Migu 2M     : font-size=14, </span>
          <span style="color: #b22222;">;; </span><span style="color: #b22222;">3) Inconsolata, Hiragino    : font-size=14, -apple-hiragino=1.0</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Fonts</span>

          ((font-size my:font-size)
<span style="color: #b22222;">;          </span><span style="color: #b22222;">((font-size 28) ; for mirroring presentation (1440x900)</span>
<span style="color: #b22222;">;           </span><span style="color: #b22222;">(ascii-font "Inconsolata")</span>
           (ascii-font <span style="color: #8b2252;">"Monaco"</span>)
           (ja-font <span style="color: #8b2252;">"Migu 2M"</span>))
        <span style="color: #b22222;">;; </span><span style="color: #b22222;">(ja-font "Hiragino Maru Gothic Pro")) </span>
        (my:ascii-font-setter (font-spec <span style="color: #483d8b;">:family</span> ascii-font <span style="color: #483d8b;">:size</span> font-size))
        (my:ja-font-setter (font-spec <span style="color: #483d8b;">:family</span> ja-font <span style="color: #483d8b;">:size</span> font-size)))

      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Fix ratio provided by set-face-attribute for fonts display</span>
      (setq face-font-rescale-alist
            '((<span style="color: #8b2252;">"^-apple-hiragino.*"</span> . 1.0) <span style="color: #b22222;">; </span><span style="color: #b22222;">1.2</span>
              (<span style="color: #8b2252;">".*Migu.*"</span> . 1.2)
              (<span style="color: #8b2252;">".*Inconsolata.*"</span> 1.0)
              (<span style="color: #8b2252;">".*osaka-bold.*"</span> . 1.0)     <span style="color: #b22222;">; </span><span style="color: #b22222;">1.2</span>
              (<span style="color: #8b2252;">".*osaka-medium.*"</span> . 1.0)   <span style="color: #b22222;">; </span><span style="color: #b22222;">1.0</span>
              (<span style="color: #8b2252;">".*courier-bold-.*-mac-roman"</span> . 1.0) <span style="color: #b22222;">; </span><span style="color: #b22222;">0.9</span>
              <span style="color: #b22222;">;; </span><span style="color: #b22222;">(".*monaco cy-bold-.*-mac-cyrillic" . 1.0)</span>
              <span style="color: #b22222;">;; </span><span style="color: #b22222;">(".*monaco-bold-.*-mac-roman" . 1.0) ; 0.9</span>
              (<span style="color: #8b2252;">"-cdac$"</span> . 1.0)))           <span style="color: #b22222;">; </span><span style="color: #b22222;">1.3</span>

      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Anti aliasing with Quartz 2D</span>
      (setq mac-allow-anti-aliasing t)))

   ((eq window-system 'w32) <span style="color: #b22222;">; </span><span style="color: #b22222;">windows7</span>
    (<span style="color: #a020f0;">let</span>
        ((font-size 14)
         (font-height 100)
         (ascii-font <span style="color: #8b2252;">"Inconsolata"</span>)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">(ja-font "Meiryo UI"))</span>
         (ja-font <span style="color: #8b2252;">"&#12513;&#12452;&#12522;&#12458;"</span>))
      (my:ja-font-setter
       (font-spec <span style="color: #483d8b;">:family</span> ja-font <span style="color: #483d8b;">:size</span> font-size <span style="color: #483d8b;">:height</span> font-height))
      (my:ascii-font-setter (font-spec <span style="color: #483d8b;">:family</span> ascii-font <span style="color: #483d8b;">:size</span> font-size)))
    (setq face-font-rescale-alist '((<span style="color: #8b2252;">".*Inconsolata.*"</span> . 1.0))) <span style="color: #b22222;">; </span><span style="color: #b22222;">0.9</span>
)   
   (window-system <span style="color: #b22222;">; </span><span style="color: #b22222;">for SuSE Linux 12.1</span>
    (<span style="color: #a020f0;">let</span>
        ((font-size 14)
         (font-height 100)
         (ascii-font <span style="color: #8b2252;">"Inconsolata"</span>)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">(ja-font "MigMix 1M")</span>
         (ja-font <span style="color: #8b2252;">"Migu 1M"</span>))
      (my:ja-font-setter
       (font-spec <span style="color: #483d8b;">:family</span> ja-font <span style="color: #483d8b;">:size</span> font-size <span style="color: #483d8b;">:height</span> font-height))
      (my:ascii-font-setter (font-spec <span style="color: #483d8b;">:family</span> ascii-font <span style="color: #483d8b;">:size</span> font-size)))
    (setq face-font-rescale-alist '((<span style="color: #8b2252;">".*MigMix.*"</span> . 2.0)
                                    (<span style="color: #8b2252;">".*Inconsolata.*"</span> . 1.0))) <span style="color: #b22222;">; </span><span style="color: #b22222;">0.9</span>
    ))
</pre>
</div>
</div>

<div id="outline-container-orgheadline175" class="outline-4">
<h4 id="orgheadline175"><span class="section-number-4">11.7.1</span> フォントのインストール方法</h4>
<div class="outline-text-4" id="text-11-7-1">
<p>
Linux では次のように処理するだけでよく，意外と簡単．<br  />
</p>

<ol class="org-ol">
<li>~/.fonts を作成する<br  /></li>
<li>フォントを1.のディレクトリに置く<br  /></li>
<li>fc-cache -fv を実行<br  /></li>
<li>fc-list でインストールされているかを確認．<br  /></li>
</ol>

<p>
なお，Windows では，フォントファイルを右クリックして，インストールを選択するだけでOK．<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline176" class="outline-4">
<h4 id="orgheadline176"><span class="section-number-4">11.7.2</span> フォントチェック用コード</h4>
<div class="outline-text-4" id="text-11-7-2">
<p>
サンプルの <a href="http://dl.dropbox.com/u/2440/dokuwiki/font-test.org">orgファイル</a> を作って，見た目をチェックしています．バッファ内の桁数チェックや，ASCIIが漢字の半分の幅になっているかのチェックが楽になります．<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline178" class="outline-3">
<h3 id="orgheadline178"><span class="section-number-3">11.8</span> 行間を制御する</h3>
<div class="outline-text-3" id="text-11-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-default 'line-spacing 0.2)
</pre>
</div>
</div>
</div>
