init.org
** パッチをカラフルに表示する

Built-in の [[http://www.emacswiki.org/emacs/DiffMode][diff-mode.el]] をカスタマイズします．

現在試験中．

#+BEGIN_SRC emacs-lisp :tangle no
(setq ediff-window-setup-function 'ediff-setup-windows-plain)
#+END_SRC

http://d.hatena.ne.jp/syohex/20111228/1325086893

#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-autoload-if-found
   'diff-mode "diff-mode" nil t nil   
   '((set-face-attribute 'diff-added-face nil
                         :background nil :foreground "green"
                         :weight 'normal)
     (set-face-attribute 'diff-removed-face nil
                         :background nil :foreground "firebrick1"
                         :weight 'normal)
     
     (set-face-attribute 'diff-file-header-face nil
                         :background nil :weight 'extra-bold)
     
     (set-face-attribute 'diff-hunk-header-face nil
                         :foreground "chocolate4"
                         :background "white" :weight 'extra-bold
                         :inherit nil)))
#+END_SRC

** 背景を黒系色にする

#+BEGIN_SRC emacs-lisp :tangle no
  (custom-set-faces
   '(default ((t
               (:background "black" :foreground "#55FF55")
               ))))
#+END_SRC

** 時間帯を指定して起動時にテーマを切り替える

次の例では，19時から翌日の朝5時までの間に夜用のテーマを使っています．

#+BEGIN_SRC emacs-lisp :tangle yes
(defun my:night-time-p (begin end)
  (let* ((ch (string-to-number (format-time-string "%H" (current-time))))
         (cm (string-to-number (format-time-string "%M" (current-time))))
         (ct (+ cm (* 60 ch))))
    (if (> begin end)
        (or (<= begin ct) (<= ct end))
      (and (<= begin ct) (<= ct end)))))

(defvar night-time-in 21)
(defvar night-time-out 5)

(when (my:night-time-p (* night-time-in 60) (* night-time-out 60))
  ;;(when (require 'gotham-theme nil t)
  ;;(load-theme 'gotham t)
  (when (require 'night-theme nil t)
    (load-theme 'night t)
    (setq my:cursor-color-ime-on "#8599ff")))
#+END_SRC

** [rainbow-mode.el] 配色のリアルタイム確認

M-x rainbow-mode とすると，色指定のコードの背景色を，その指定色にリアルタイム変換してくれる．

[[http://elpa.gnu.org/packages/rainbow-mode.html]]

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(rainbow-mode) "rainbow-mode")
    (add-hook 'emmet-mode-hook 'rainbow-mode)
    (add-hook 'emacs-lisp-mode-hook 'rainbow-mode)
    (add-hook 'org-mode-hook 'rainbow-mode))
#+END_SRC

*** 色一覧

=0,6,9,C,F= の組み合わせ

 #000000 #000033 #000066 #000099 #0000CC #0000FF
 #003300 #003333 #003366 #003399 #0033CC #0033FF
 #006600 #006633 #006666 #006699 #0066CC #0066FF
 #009900 #009933 #009966 #009999 #0099CC #0099FF
 #00CC00 #00CC33 #00CC66 #00CC99 #00CCCC #00CCFF
 #00FF00 #00FF33 #00FF66 #00FF99 #00FFCC #00FFFF

 #330000 #330033 #330066 #330099 #3300CC #3300FF
 #333300 #333333 #333366 #333399 #3333CC #3333FF
 #336600 #336633 #336666 #336699 #3366CC #3366FF
 #339900 #339933 #339966 #339999 #3399CC #3399FF
 #33CC00 #33CC33 #33CC66 #33CC99 #33CCCC #33CCFF
 #33FF00 #33FF33 #33FF66 #33FF99 #33FFCC #33FFFF

 #660000 #660033 #660066 #660099 #6600CC #6600FF
 #663300 #663333 #663366 #663399 #6633CC #6633FF
 #666600 #666633 #666666 #666699 #6666CC #6666FF
 #669900 #669933 #669966 #669999 #6699CC #6699FF
 #66CC00 #66CC33 #66CC66 #66CC99 #66CCCC #66CCFF
 #66FF00 #66FF33 #66FF66 #66FF99 #66FFCC #66FFFF

 #990000 #990033 #990066 #990099 #9900CC #9900FF
 #993300 #993333 #993366 #993399 #9933CC #9933FF
 #996600 #996633 #996666 #996699 #9966CC #9966FF
 #999900 #999933 #999966 #999999 #9999CC #9999FF
 #99CC00 #99CC33 #99CC66 #99CC99 #99CCCC #99CCFF
 #99FF00 #99FF33 #99FF66 #99FF99 #99FFCC #99FFFF

 #CC0000 #CC0033 #CC0066 #CC0099 #CC00CC #CC00FF
 #CC3300 #CC3333 #CC3366 #CC3399 #CC33CC #CC33FF
 #CC6600 #CC6633 #CC6666 #CC6699 #CC66CC #CC66FF
 #CC9900 #CC9933 #CC9966 #CC9999 #CC99CC #CC99FF
 #CCCC00 #CCCC33 #CCCC66 #CCCC99 #CCCCCC #CCCCFF
 #CCFF00 #CCFF33 #CCFF66 #CCFF99 #CCFFCC #CCFFFF

 #FF0000 #FF0033 #FF0066 #FF0099 #FF00CC #FF00FF
 #FF3300 #FF3333 #FF3366 #FF3399 #FF33CC #FF33FF
 #FF6600 #FF6633 #FF6666 #FF6699 #FF66CC #FF66FF
 #FF9900 #FF9933 #FF9966 #FF9999 #FF99CC #FF99FF
 #FFCC00 #FFCC33 #FFCC66 #FFCC99 #FFCCCC #FFCCFF
 #FFFF00 #FFFF33 #FFFF66 #FFFF99 #FFFFCC #FFFFFF

