init.html

<div id="outline-container-orgheadline179" class="outline-3">
<h3 id="orgheadline179"><span class="section-number-3">11.9</span> パッチをカラフルに表示する</h3>
<div class="outline-text-3" id="text-11-9">
<p>
Built-in の <a href="http://www.emacswiki.org/emacs/DiffMode">diff-mode.el</a> をカスタマイズします．<br  />
</p>

<p>
現在試験中．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ediff-window-setup-function 'ediff-setup-windows-plain)
</pre>
</div>

<p>
<a href="http://d.hatena.ne.jp/syohex/20111228/1325086893">http://d.hatena.ne.jp/syohex/20111228/1325086893</a><br  />
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 'diff-mode <span style="color: #8b2252;">"diff-mode"</span> nil t nil   
 '((set-face-attribute 'diff-added-face nil
                       <span style="color: #483d8b;">:background</span> nil <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #00ff00;">green</span><span style="color: #8b2252;">"</span>
                       <span style="color: #483d8b;">:weight</span> 'normal)
   (set-face-attribute 'diff-removed-face nil
                       <span style="color: #483d8b;">:background</span> nil <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #ff3030;">firebrick1</span><span style="color: #8b2252;">"</span>
                       <span style="color: #483d8b;">:weight</span> 'normal)

   (set-face-attribute 'diff-file-header-face nil
                       <span style="color: #483d8b;">:background</span> nil <span style="color: #483d8b;">:weight</span> 'extra-bold)

   (set-face-attribute 'diff-hunk-header-face nil
                       <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #8b4513;">chocolate4</span><span style="color: #8b2252;">"</span>
                       <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #ffffff;">white</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:weight</span> 'extra-bold
                       <span style="color: #483d8b;">:inherit</span> nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline180" class="outline-3">
<h3 id="orgheadline180"><span class="section-number-3">11.10</span> 背景を黒系色にする</h3>
<div class="outline-text-3" id="text-11-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(custom-set-faces
 '(default ((t
             (<span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #000000;">black</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #55FF55;">#55FF55</span><span style="color: #8b2252;">"</span>)
             ))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline182" class="outline-3">
<h3 id="orgheadline182"><span class="section-number-3">11.11</span> [rainbow-mode.el] 配色のリアルタイム確認</h3>
<div class="outline-text-3" id="text-11-11">
<p>
M-x rainbow-mode とすると，色指定のコードの背景色を，その指定色にリアルタイム変換してくれる．<br  />
</p>

<p>
<a href="http://elpa.gnu.org/packages/rainbow-mode.html">http://elpa.gnu.org/packages/rainbow-mode.html</a><br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(rainbow-mode) <span style="color: #8b2252;">"rainbow-mode"</span> nil t nil
       '())
  (add-hook 'emmet-mode-hook 'rainbow-mode)
  (add-hook 'emacs-lisp-mode-hook 'rainbow-mode)
  (add-hook 'org-mode-hook 'rainbow-mode)
  )
</pre>
</div>
</div>

<div id="outline-container-orgheadline181" class="outline-4">
<h4 id="orgheadline181"><span class="section-number-4">11.11.1</span> 色一覧</h4>
<div class="outline-text-4" id="text-11-11-1">
<p>
<code>0,6,9,C,F</code> の組み合わせ<br  />
</p>

<p>
#000000 #000033 #000066 #000099 #0000CC #0000FF<br  />
#003300 #003333 #003366 #003399 #0033CC #0033FF<br  />
#006600 #006633 #006666 #006699 #0066CC #0066FF<br  />
#009900 #009933 #009966 #009999 #0099CC #0099FF<br  />
#00CC00 #00CC33 #00CC66 #00CC99 #00CCCC #00CCFF<br  />
#00FF00 #00FF33 #00FF66 #00FF99 #00FFCC #00FFFF<br  />
</p>

<p>
#330000 #330033 #330066 #330099 #3300CC #3300FF<br  />
#333300 #333333 #333366 #333399 #3333CC #3333FF<br  />
#336600 #336633 #336666 #336699 #3366CC #3366FF<br  />
#339900 #339933 #339966 #339999 #3399CC #3399FF<br  />
#33CC00 #33CC33 #33CC66 #33CC99 #33CCCC #33CCFF<br  />
#33FF00 #33FF33 #33FF66 #33FF99 #33FFCC #33FFFF<br  />
</p>

<p>
#660000 #660033 #660066 #660099 #6600CC #6600FF<br  />
#663300 #663333 #663366 #663399 #6633CC #6633FF<br  />
#666600 #666633 #666666 #666699 #6666CC #6666FF<br  />
#669900 #669933 #669966 #669999 #6699CC #6699FF<br  />
#66CC00 #66CC33 #66CC66 #66CC99 #66CCCC #66CCFF<br  />
#66FF00 #66FF33 #66FF66 #66FF99 #66FFCC #66FFFF<br  />
</p>

<p>
#990000 #990033 #990066 #990099 #9900CC #9900FF<br  />
#993300 #993333 #993366 #993399 #9933CC #9933FF<br  />
#996600 #996633 #996666 #996699 #9966CC #9966FF<br  />
#999900 #999933 #999966 #999999 #9999CC #9999FF<br  />
#99CC00 #99CC33 #99CC66 #99CC99 #99CCCC #99CCFF<br  />
#99FF00 #99FF33 #99FF66 #99FF99 #99FFCC #99FFFF<br  />
</p>

<p>
#CC0000 #CC0033 #CC0066 #CC0099 #CC00CC #CC00FF<br  />
#CC3300 #CC3333 #CC3366 #CC3399 #CC33CC #CC33FF<br  />
#CC6600 #CC6633 #CC6666 #CC6699 #CC66CC #CC66FF<br  />
#CC9900 #CC9933 #CC9966 #CC9999 #CC99CC #CC99FF<br  />
#CCCC00 #CCCC33 #CCCC66 #CCCC99 #CCCCCC #CCCCFF<br  />
#CCFF00 #CCFF33 #CCFF66 #CCFF99 #CCFFCC #CCFFFF<br  />
</p>

<p>
#FF0000 #FF0033 #FF0066 #FF0099 #FF00CC #FF00FF<br  />
#FF3300 #FF3333 #FF3366 #FF3399 #FF33CC #FF33FF<br  />
#FF6600 #FF6633 #FF6666 #FF6699 #FF66CC #FF66FF<br  />
#FF9900 #FF9933 #FF9966 #FF9999 #FF99CC #FF99FF<br  />
#FFCC00 #FFCC33 #FFCC66 #FFCC99 #FFCCCC #FFCCFF<br  />
#FFFF00 #FFFF33 #FFFF66 #FFFF99 #FFFFCC #FFFFFF<br  />
</p>
</div>
</div>
</div>
