init.org
** [volatile-highlights] コピペした領域を強調 

コピペ領域をその直後のみハイライトします．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(volatile-highlights-mode) "volatile-highlights" nil t nil
         '((set-face-attribute
            'vhl/default-face nil :foreground "#FF3333" :background "#FFCDCD")
           (volatile-highlights-mode t)

           ;; ふわっとエフェクトの追加（ペースト時の色 => カーソル色 => 本来色）
           (defun my:vhl-change-color ()
             (let
                 ((next 0.2)
                  (reset 0.5)
                  (colors '("#F8D3D7" "#F2DAE1" "#EBE0EB" "#E5E7F5" "#DEEDFF")))
               (dolist (color colors)
                 (run-at-time next nil
                              'set-face-attribute
                              'vhl/default-face
                              nil :foreground "#FF3333" :background color)
                 (setq next (+ 0.05 next)))
               (run-at-time reset nil 'vhl/clear-all))
             (set-face-attribute 'vhl/default-face
                                 nil :foreground "#FF3333"
                                 :background "#FFCDCD"))

           (defun my:yank (&optional ARG)
             (interactive)
             (yank ARG)
             (my:vhl-change-color))
           (global-set-key (kbd "M-v") 'my:yank)
           (global-set-key (kbd "C-y") 'my:yank)

           (with-eval-after-load "org"
             (define-key org-mode-map (kbd "C-y")
               '(lambda () (interactive)
                  (org-yank)
                  (my:vhl-change-color))))))

    (add-hook 'org-mode-hook 'volatile-highlights-mode)
    (add-hook 'emacs-lisp-mode-hook 'volatile-highlights-mode)
    (add-hook 'emmet-mode-hook 'rainbow-mode))
#+END_SRC

* フレーム／ウィンドウ制御
** 起動時の設定

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; To avoid an error setting up the frame width (only for Emacs23)
                                          ;(set-frame-width (selected-frame) 81)
                                          ;(set-frame-width (selected-frame) 80)

  ;; Default window position to show a Emacs frame
  ;; Dynabook UX: top=0, left=0, width=80, height=32
  (cond
   ((eq window-system 'ns) ; for Macintosh
    (setq initial-frame-alist
          (append
           '((top . 22)  ; Y-pos from (0,0) the height of menu bar is 22pix.
             (left . 0)  ; X-pos from (0,0) ; 420 is the center for MBP
             ;; 26 is the setting for Butler's Docklet
             ;; 837 is the setting for right side for MBP
             (width . 80) ; Width  : character count
             (alpha . (100 90))
             (cursor-height . 16)
             (vertical-scroll-bars . nil)
             ) initial-frame-alist)))

   ((eq window-system 'x) ; for Linux
    (setq initial-frame-alist
          (append
           '((vertical-scroll-bars . nil)
             (top . 0)
             (left . 0)
             (width . 80)
             (height . 38)
             ) initial-frame-alist)))

   (t                     ; for Windows
    (setq initial-frame-alist
          (append
           '((vertical-scroll-bars . nil)
             (top . 0)
             (left . 0)
             (width . 80)
             (height . 26)
             ) initial-frame-alist))))

  ;; Apply the initial setting to default
  (setq default-frame-alist initial-frame-alist)
#+END_SRC

** [elscreen.el] Emacs バッファをタブ化

#+BEGIN_SRC emacs-lisp :tangle no
;;; ElScreen (require apel) ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Note: change a string in the elscreen.el from "mac" to "ns"
;; 2011-10-26: e2wm's perspective (two) mode is more useful for me.
(load "elscreen" "ElScreen" t)
#+END_SRC

