init.html

<div id="outline-container-orgheadline183" class="outline-3">
<h3 id="orgheadline183"><span class="section-number-3">11.12</span> [volatile-highlights] コピペした領域を強調</h3>
<div class="outline-text-3" id="text-11-12">
<p>
コピペ領域をその直後のみハイライトします．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(volatile-highlights-mode) <span style="color: #8b2252;">"volatile-highlights"</span> nil t nil
       '((set-face-attribute
          'vhl/default-face nil <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF3333;">#FF3333</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFCDCD;">#FFCDCD</span><span style="color: #8b2252;">"</span>)
         (volatile-highlights-mode t)

         <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12405;&#12431;&#12387;&#12392;&#12456;&#12501;&#12455;&#12463;&#12488;&#12398;&#36861;&#21152;&#65288;&#12506;&#12540;&#12473;&#12488;&#26178;&#12398;&#33394; =&gt; &#12459;&#12540;&#12477;&#12523;&#33394; =&gt; &#26412;&#26469;&#33394;&#65289;</span>
         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:vhl-change-color</span> ()
           (<span style="color: #a020f0;">let</span>
               ((next 0.3)
                (reset 0.8)
                (colors '(<span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #F8D3D7;">#F8D3D7</span><span style="color: #8b2252;">"</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #F2DAE1;">#F2DAE1</span><span style="color: #8b2252;">"</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #EBE0EB;">#EBE0EB</span><span style="color: #8b2252;">"</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #E5E7F5;">#E5E7F5</span><span style="color: #8b2252;">"</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #DEEDFF;">#DEEDFF</span><span style="color: #8b2252;">"</span>)))
             (<span style="color: #a020f0;">dolist</span> (color colors)
               (run-at-time next nil
                            'set-face-attribute
                            'vhl/default-face
                            nil <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF3333;">#FF3333</span><span style="color: #8b2252;">"</span> <span style="color: #483d8b;">:background</span> color)
               (setq next (+ 0.1 next)))
             (run-at-time reset nil 'vhl/clear-all))
           (set-face-attribute 'vhl/default-face
                               nil <span style="color: #483d8b;">:foreground</span> <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #FF3333;">#FF3333</span><span style="color: #8b2252;">"</span>
                               <span style="color: #483d8b;">:background</span> <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #FFCDCD;">#FFCDCD</span><span style="color: #8b2252;">"</span>))

         (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:yank</span> (<span style="color: #228b22;">&amp;optional</span> ARG)
           (interactive)
           (yank ARG)
           (my:vhl-change-color))
         (global-set-key (kbd <span style="color: #8b2252;">"M-v"</span>) 'my:yank)
         (global-set-key (kbd <span style="color: #8b2252;">"C-y"</span>) 'my:yank)

         (<span style="color: #a020f0;">with-eval-after-load</span> <span style="color: #8b2252;">"org"</span>
           (define-key org-mode-map (kbd <span style="color: #8b2252;">"C-y"</span>)
             '(<span style="color: #a020f0;">lambda</span> () (interactive)
                (org-yank)
                (my:vhl-change-color))))))

  (add-hook 'org-mode-hook 'volatile-highlights-mode)
  (add-hook 'emacs-lisp-mode-hook 'volatile-highlights-mode)
  (add-hook 'emmet-mode-hook 'rainbow-mode))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline190" class="outline-2">
<h2 id="orgheadline190"><span class="section-number-2">12</span> フレーム／ウィンドウ制御</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-orgheadline185" class="outline-3">
<h3 id="orgheadline185"><span class="section-number-3">12.1</span> 起動時の設定</h3>
<div class="outline-text-3" id="text-12-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">To avoid an error setting up the frame width (only for Emacs23)</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">(set-frame-width (selected-frame) 81)</span>
                                        <span style="color: #b22222;">;</span><span style="color: #b22222;">(set-frame-width (selected-frame) 80)</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Default window position to show a Emacs frame</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Dynabook UX: top=0, left=0, width=80, height=32</span>
(<span style="color: #a020f0;">cond</span>
 ((eq window-system 'ns) <span style="color: #b22222;">; </span><span style="color: #b22222;">for Macintosh</span>
  (setq initial-frame-alist
        (append
         '((top . 22)  <span style="color: #b22222;">; </span><span style="color: #b22222;">Y-pos from (0,0) the height of menu bar is 22pix.</span>
           (left . 0)  <span style="color: #b22222;">; </span><span style="color: #b22222;">X-pos from (0,0) ; 420 is the center for MBP</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">26 is the setting for Butler's Docklet</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">837 is the setting for right side for MBP</span>
           (width . 80) <span style="color: #b22222;">; </span><span style="color: #b22222;">Width  : character count</span>
           <span style="color: #b22222;">;;             </span><span style="color: #b22222;">(height . 24); Height : character count</span>
           (alpha . (100 90))
           (cursor-height . 16)
           (vertical-scroll-bars . nil)
           ) initial-frame-alist)))

 ((eq window-system 'x) <span style="color: #b22222;">; </span><span style="color: #b22222;">for Linux</span>
  (setq initial-frame-alist
        (append
         '((vertical-scroll-bars . nil)
           (top . 0)
           (left . 0)
           (width . 80)
           (height . 38)
           ) initial-frame-alist)))

 (t                     <span style="color: #b22222;">; </span><span style="color: #b22222;">for Windows</span>
  (setq initial-frame-alist
        (append
         '((vertical-scroll-bars . nil)
           (top . 0)
           (left . 0)
           (width . 80)
           (height . 26)
           ) initial-frame-alist))))

  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Apply the initial setting to default</span>
  (setq default-frame-alist initial-frame-alist)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline186" class="outline-3">
<h3 id="orgheadline186"><span class="section-number-3">12.2</span> [elscreen.el] Emacs バッファをタブ化</h3>
<div class="outline-text-3" id="text-12-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #b22222;">;;; </span><span style="color: #b22222;">ElScreen (require apel) ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Note: change a string in the elscreen.el from "mac" to "ns"</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">2011-10-26: e2wm's perspective (two) mode is more useful for me.</span>
(load <span style="color: #8b2252;">"elscreen"</span> <span style="color: #8b2252;">"ElScreen"</span> t)
</pre>
</div>
</div>
</div>
