init.html

<div id="outline-container-orgheadline187" class="outline-3">
<h3 id="orgheadline187"><span class="section-number-3">12.3</span> [e2wm.el] 二画面表示</h3>
<div class="outline-text-3" id="text-12-3">
<ol class="org-ol">
<li><a href="http://github.com/kiwanami/emacs-window-manager/raw/master/e2wm.el">http://github.com/kiwanami/emacs-window-manager/raw/master/e2wm.el</a><br  /></li>
<li><a href="http://github.com/kiwanami/emacs-window-layout/raw/master/window-layout.el">http://github.com/kiwanami/emacs-window-layout/raw/master/window-layout.el</a><br  /></li>
</ol>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found 
 'e2wm:dp-two <span style="color: #8b2252;">"e2wm"</span> nil t nil
 '((setq e2wm:c-two-recipe
         '(- (<span style="color: #483d8b;">:lower-size</span> 10)
             (| left right)
             sub))
   (setq e2wm:c-two-winfo
         '((<span style="color: #483d8b;">:name</span> left )
           (<span style="color: #483d8b;">:name</span> right )
           (<span style="color: #483d8b;">:name</span> sub <span style="color: #483d8b;">:default-hide</span> t)))

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#39640;&#12373;&#12434;&#30011;&#38754;&#12398;&#26368;&#22823;&#12395;&#30703;&#27491;</span>
   (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">frame-ctr</span> nil t)
     (setq frame-height-tall (max-frame-height))
     (setq frame-height-small frame-height-tall))

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">left, prev</span>
   (setq e2wm:c-two-right-default 'left)

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">To avoid rebooting issue when using desktop.el and recentf.el</span>
   (add-hook 'kill-emacs-hook 'e2wm:stop-management)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline188" class="outline-3">
<h3 id="orgheadline188"><span class="section-number-3">12.4</span> [frame-ctr.el] キーボードでフレームの場所を移す</h3>
<div class="outline-text-3" id="text-12-4">
<p>
拙作の <a href="https://github.com/takaxp/frame-ctr">frame-ctr.el</a>を使います．e2wm.el と frame-cmds.el に依存しています．<br  />
</p>

<p>
frame-ctr.el は，frame-cmds, frame-fns と e2wm.el を利用したアドホックなフレーム管理ツールです．<br  />
</p>

<ol class="org-ol">
<li><a href="http://www.emacswiki.org/emacs/download/frame-cmds.el">http://www.emacswiki.org/emacs/download/frame-cmds.el</a><br  /></li>
<li><a href="http://www.emacswiki.org/emacs/download/frame-fns.el">http://www.emacswiki.org/emacs/download/frame-fns.el</a><br  /></li>
</ol>


<p>
ビルトインに <code>face-remap</code> があり，アスキーフォントは <code>C-x C--</code> と <code>C-x C-=</code> で拡大縮小を制御できます．以下のキーバインドは，face-remap.el が提供する text-scale-adjust のキーバインドを上書きします．text-scale-adjust をそのまま使うと，日本語フォントが制御されないので，オーバーライドしてしまってもOKだと思います．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(move-frame-with-user-specify
         move-frame-to-center move-frame-to-edge-top move-frame-right
         move-frame-left move-frame-to-edge-bottom frame-ctr-open-height-ring
         fit-frame-to-fullscreen set-font-size-input max-frame-height
         reset-font-size increase-font-size decrease-font-size set-font-size)
       <span style="color: #8b2252;">"frame-ctr"</span> nil t nil 
       '((make-frame-height-ring)
         (<span style="color: #a020f0;">cond</span>
          ((eq (x-display-pixel-width) 1920) (setq fullscreen-fontsize 38))
          ((eq (x-display-pixel-width) 1440) (setq fullscreen-fontsize 28))
          ((eq (x-display-pixel-width) 1366) (setq fullscreen-fontsize 19))
          ((eq (x-display-pixel-width) 800) (setq fullscreen-fontsize 14))
          (t (setq fullscreen-fontsize 12)))

         <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12522;&#12531;&#12464;&#12398;&#29366;&#24907;&#12434;&#26368;&#26032;&#12395;&#26356;&#26032;&#65288;max-frame-height &#12364;&#22793;&#12431;&#12427;&#12383;&#12417;&#65289;</span>
         (add-hook 'frame-ctr-after-fullscreen-hook
                   'make-frame-height-ring)))

  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Move the frame to somewhere (default: 0,0)</span>
  (global-set-key (kbd <span style="color: #8b2252;">"M-0"</span>) 'move-frame-with-user-specify)
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Move the frame to left side of the current position (require 'frame-cmds)</span>
  (global-set-key (kbd <span style="color: #8b2252;">"M-1"</span>) '(<span style="color: #a020f0;">lambda</span> () (interactive) (move-frame-left 40)))
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Move the frame to the center of the window display (require 'frame-ctr)</span>
  (global-set-key (kbd <span style="color: #8b2252;">"M-2"</span>) 'move-frame-to-center)
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Move the frame to right side of the current position(require 'frame-cmds)</span>
  (global-set-key (kbd <span style="color: #8b2252;">"M-3"</span>) '(<span style="color: #a020f0;">lambda</span> () (interactive)(move-frame-right 40)))
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Move the current frame to the top of the window display</span>
  (global-set-key (kbd <span style="color: #8b2252;">"&lt;f1&gt;"</span>) 'move-frame-to-edge-top)
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Move the current frame to the bottom of the window display</span>
  (global-set-key (kbd <span style="color: #8b2252;">"S-&lt;f1&gt;"</span>) 'move-frame-to-edge-bottom)
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Cycle heights</span>
  (global-set-key (kbd <span style="color: #8b2252;">"&lt;f2&gt;"</span>) 'frame-ctr-open-height-ring)

  (global-set-key (kbd <span style="color: #8b2252;">"C-x C-9"</span>) 'fit-frame-to-fullscreen)
  (global-set-key (kbd <span style="color: #8b2252;">"C-x C-0"</span>) 'reset-font-size)
  (global-set-key (kbd <span style="color: #8b2252;">"C-="</span>) 'increase-font-size)
  (global-set-key (kbd <span style="color: #8b2252;">"C--"</span>) 'decrease-font-size))

(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(change-frame-width-single
         change-frame-width-double change-frame-double-window
         change-frame-single-window) <span style="color: #8b2252;">"frame-ctr-e2wm"</span> nil t nil
         '())

  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Set the frame width single size</span>
  <span style="color: #b22222;">;;  </span><span style="color: #b22222;">C-u C-x - =&gt; e2wm OFF, single size width and double height, move center</span>
  (global-set-key (kbd <span style="color: #8b2252;">"C-x -"</span>) 'change-frame-single-window)
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Set the frame width double size</span>
  <span style="color: #b22222;">;;  </span><span style="color: #b22222;">C-u C-x = =&gt; e2wm ON, double size width and height, move to the center</span>
  (global-set-key (kbd <span style="color: #8b2252;">"C-x ="</span>) 'change-frame-double-window)
  (global-set-key (kbd <span style="color: #8b2252;">"C-c f s"</span>) 'change-frame-width-single)
  (global-set-key (kbd <span style="color: #8b2252;">"C-c f d"</span>) 'change-frame-width-double))
</pre>
</div>
</div>
</div>
