init.el
 'e2wm:dp-two "e2wm" nil t nil
 '((setq e2wm:c-two-recipe
         '(- (:lower-size 10)
             (| left right)
             sub))
   (setq e2wm:c-two-winfo
         '((:name left )
           (:name right )
           (:name sub :default-hide t)))

   ;; 高さを画面の最大に矯正
   (when (require 'frame-ctr nil t)
     (setq frame-height-tall (max-frame-height))
     (setq frame-height-small frame-height-tall))

   ;; left, prev
   (setq e2wm:c-two-right-default 'left)

   ;; To avoid rebooting issue when using desktop.el and recentf.el
   (add-hook 'kill-emacs-hook 'e2wm:stop-management)))

(defvar frame-ctr-autoloads
  '(move-frame-with-user-specify
    move-frame-to-center move-frame-to-edge-top move-frame-right
    move-frame-left move-frame-to-edge-bottom frame-ctr-open-height-ring
    fit-frame-to-fullscreen set-font-size-input max-frame-height
    reset-font-size increase-font-size decrease-font-size set-font-size))

(when (eval-after-autoload-if-found
       frame-ctr-autoloads "frame-ctr" nil t nil 
       '((make-frame-height-ring)
         (cond
          ((eq (display-pixel-width) 1920) (setq fullscreen-fontsize 38))
          ((eq (display-pixel-width) 1440) (setq fullscreen-fontsize 28))
          ((eq (display-pixel-width) 1366) (setq fullscreen-fontsize 19))
          ((eq (display-pixel-width) 800) (setq fullscreen-fontsize 14))
          (t (setq fullscreen-fontsize 12)))

         ;; リングの状態を最新に更新（max-frame-height が変わるため）
         (add-hook 'frame-ctr-after-fullscreen-hook
                   'make-frame-height-ring)))

  ;; Move the frame to somewhere (default: 0,0)
  (global-set-key (kbd "M-0") 'move-frame-with-user-specify)
  ;; Move the frame to left side of the current position (require 'frame-cmds)
  (global-set-key (kbd "M-1") '(lambda () (interactive) (move-frame-left 40)))
  ;; Move the frame to the center of the window display (require 'frame-ctr)
  (global-set-key (kbd "M-2") 'move-frame-to-center)
  ;; Move the frame to right side of the current position(require 'frame-cmds)
  (global-set-key (kbd "M-3") '(lambda () (interactive)(move-frame-right 40)))
  ;; Move the current frame to the top of the window display
  (global-set-key (kbd "<f1>") 'move-frame-to-edge-top)
  ;; Move the current frame to the bottom of the window display
  (global-set-key (kbd "S-<f1>") 'move-frame-to-edge-bottom)
  ;; Cycle heights
  (global-set-key (kbd "<f2>") 'frame-ctr-open-height-ring)

  (global-set-key (kbd "C-x C-9") 'fit-frame-to-fullscreen)
  (global-set-key (kbd "C-x C-0") 'reset-font-size)
  (global-set-key (kbd "C-=") 'increase-font-size)
  (global-set-key (kbd "C--") 'decrease-font-size))

;; setting for e2wm
(when (eval-after-autoload-if-found
       '(change-frame-width-single
         change-frame-width-double change-frame-double-window
         change-frame-single-window) "frame-ctr-e2wm")

  ;; Set the frame width single size
  ;;  C-u C-x - => e2wm OFF, single size width and double height, move center
  (global-set-key (kbd "C-x -") 'change-frame-single-window)
  ;; Set the frame width double size
  ;;  C-u C-x = => e2wm ON, double size width and height, move to the center
  (global-set-key (kbd "C-x =") 'change-frame-double-window)
  (global-set-key (kbd "C-c f s") 'change-frame-width-single)
  (global-set-key (kbd "C-c f d") 'change-frame-width-double))

(when (eval-after-autoload-if-found
