init.org
** [popwin.el] ポップアップウィンドウの制御

https://github.com/m2ym/popwin-el/

popwin:display-buffer を autoload してもうまくいかない．

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eval-after-autoload-if-found
         '(popwin-mode) "popwin" nil t nil
         '(;; for emacs 24.1
           ;; (setq special-display-function 'popwin:special-display-popup-window)
           ;; (setq display-buffer-function 'popwin:display-buffer)
           ;; for emacs 24.3
           ;; (setq special-display-alist 'popwin:special-display-popup-window)
           ;; (setq display-buffer-alist 'popwin:display-buffer)
           ;; (push '("*sdic*" :position top) popwin:special-display-config)

           (setq popwin:special-display-config
                 (append
                  '(("CAPTURE-next.org" :height 10 :position bottom :noselect t)
                    ("CAPTURE-org-ical.org" :height 10 :position bottom :noselect t)
                    ("*Help*"          :height 20 :position bottom)
                    ("dict-app-result" :height 20 :position bottom)
                    ("*osx-dictionary*" :height 20 :position bottom)
                    ("*wclock*"        :height 10 :position bottom)
                    ("*Org Agenda*"    :height 10 :position bottom)
                    ("*Org Select*"  :height 10 :position bottom)
                    ("*Occur*"       :height 10 :position bottom)
  ;;;            (undo-tree-visualizer-buffer-name :height 10 :position top)
  ;;;            (undo-tree-diff-buffer-name :height 20 :position bottom)
                    ("*eshell*"      :height 10 :position bottom))
                  popwin:special-display-config))))
    (popwin-mode 1))
#+END_SRC 

* ユーティリティ関数
