init.html

<div id="outline-container-orgheadline189" class="outline-3">
<h3 id="orgheadline189"><span class="section-number-3">12.5</span> [popwin.el] ポップアップウィンドウの制御</h3>
<div class="outline-text-3" id="text-12-5">
<p>
<a href="https://github.com/m2ym/popwin-el/">https://github.com/m2ym/popwin-el/</a><br  />
</p>

<p>
popwin:display-buffer を autoload してもうまくいかない．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(popwin-mode) <span style="color: #8b2252;">"popwin"</span> nil t nil
       '(<span style="color: #b22222;">;; </span><span style="color: #b22222;">for emacs 24.1</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq special-display-function 'popwin:special-display-popup-window)</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq display-buffer-function 'popwin:display-buffer)</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">for emacs 24.3</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq special-display-alist 'popwin:special-display-popup-window)</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq display-buffer-alist 'popwin:display-buffer)</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">(push '("*sdic*" :position top) popwin:special-display-config)</span>

         (setq popwin:special-display-config
               (append
                '((<span style="color: #8b2252;">"CAPTURE-next.org"</span> <span style="color: #483d8b;">:height</span> 10 <span style="color: #483d8b;">:position</span> bottom <span style="color: #483d8b;">:noselect</span> t)
                  (<span style="color: #8b2252;">"CAPTURE-org-ical.org"</span> <span style="color: #483d8b;">:height</span> 10 <span style="color: #483d8b;">:position</span> bottom <span style="color: #483d8b;">:noselect</span> t)
                  (<span style="color: #8b2252;">"*Help*"</span>          <span style="color: #483d8b;">:height</span> 20 <span style="color: #483d8b;">:position</span> bottom)
                  (<span style="color: #8b2252;">"dict-app-result"</span> <span style="color: #483d8b;">:height</span> 20 <span style="color: #483d8b;">:position</span> bottom)
                  (<span style="color: #8b2252;">"*wclock*"</span>        <span style="color: #483d8b;">:height</span> 10 <span style="color: #483d8b;">:position</span> bottom)
                  (<span style="color: #8b2252;">"*Org Agenda*"</span>    <span style="color: #483d8b;">:height</span> 10 <span style="color: #483d8b;">:position</span> bottom)
                  (<span style="color: #8b2252;">"*Org Select*"</span>  <span style="color: #483d8b;">:height</span> 10 <span style="color: #483d8b;">:position</span> bottom)
                  (<span style="color: #8b2252;">"*Occur*"</span>       <span style="color: #483d8b;">:height</span> 10 <span style="color: #483d8b;">:position</span> bottom)
<span style="color: #b22222;">;;;            </span><span style="color: #b22222;">(undo-tree-visualizer-buffer-name :height 10 :position top)</span>
<span style="color: #b22222;">;;;            </span><span style="color: #b22222;">(undo-tree-diff-buffer-name :height 20 :position bottom)</span>
                  (<span style="color: #8b2252;">"*eshell*"</span>      <span style="color: #483d8b;">:height</span> 10 <span style="color: #483d8b;">:position</span> bottom))
                popwin:special-display-config))))
  (popwin-mode 1))
</pre>
</div>
</div>
</div>
</div>
