init.org
** [pomodoro.el] ポモドーロの実践

[[https://twitter.com/syohex][@syohex]] さん謹製の [[https://github.com/syohex/emacs-utils/blob/master/pomodoro.el][pomodoro.el]] に少しカスタマイズしたおれおれ [[https://github.com/takaxp/emacs-utils/blob/master/pomodoro.el][pomodoro.el]] を使っています．以下のように設定すると，ポモドーロの残り時間は表示せず，アイコンだけをモードラインに表示できます．残り時間は =M-x pomodoro:mode-line-time-display-toggle= すれば，いつでも表示できます．

=pomodoro:finish-work-hook= ， =pomodoro:finish-rest-hook= ， =pomodoro:long-rest-hook= にそれぞれ結びつけてあるのは，[[http://www.mactechlab.jp/products-report/16673.html][Macのスピーチ機能]]です．この例では，Kyoko さんが指示を出してくれます．

=M-x pomodoro:start= すると，ポモドーロが始まり，8時間後に =pomodoro:stop= が呼ばれてポモドーロが終了します．[[http://www.pomodorotechnique.com/][pomodoro]] は機械的に仕事をしたい人にピッタリです．人によっては [[http://ja.wikipedia.org/wiki/Getting_Things_Done][GTD]] よりも取っ付きやすいと思います．

#+BEGIN_SRC emacs-lisp :tangle no
  (eval-after-autoload-if-found
   '(pomodoro:start) "pomodoro" nil t nil
   '(;; 作業時間終了後に開くファイルを指定しない
     (setq pomodoro:file nil)

     ;; ●だけで表現する（残り時間表示なし）
     (setq pomodoro:mode-line-time-display nil)

     ;; ●の置き換え
     (setq pomodoro:mode-line-work-sign "●")
     (setq pomodoro:mode-line-rest-sign pomodoro:mode-line-work-sign)
     (setq pomodoro:mode-line-long-rest-sign pomodoro:mode-line-work-sign)

     ;; 長い休憩に入るまでにポモドーロする回数
     (setq pomodoro:iteration-for-long-rest 2)

     ;; 作業時間関連
     (setq pomodoro:work-time 120     ; 作業時間
           pomodoro:rest-time 20      ; 休憩時間
           pomodoro:long-rest-time 60 ; 長い休憩時間
           pomodoro:max-iteration 16) ; ポモドーロする回数

     ;; タイマーの表示をノーマルフェイスにする
     (set-face-bold-p 'pomodoro:timer-face nil)

     ;; 作業中（赤），休憩中（青），長い休憩中（緑）にする
     (set-face-foreground 'pomodoro:work-face "#F53838")
     (set-face-foreground 'pomodoro:rest-face "#3869FA")
     (set-face-foreground 'pomodoro:long-rest-face "#00B800")

     (defvar my:pomodoro-speak nil)
     (defun my:pomodoro-speak-toggle ()
       (interactive)
       (setq my:pomodoro-speak (not my:pomodoro-speak)))

     ;; Mac ユーザ向け．Kyokoさんに指示してもらう
     (defvar pomodoro:with-speak nil)
     (when pomodoro:with-speak
       (add-hook 'pomodoro:finish-work-hook
                 (lambda ()
                   (let ((script
                          (concat "say -v Kyoko "
                                  (number-to-string (floor pomodoro:rest-time))
                                  "分間，休憩しろ")))
                     (if my:pomodoro-speak
                         (shell-command-to-string script)
                       (message "%s" script)))))

       (add-hook 'pomodoro:finish-rest-hook
                 (lambda ()
                   (let ((script
                          (concat "say -v Kyoko "
                                  (number-to-string (floor pomodoro:work-time))
                                  "分間，作業しろ")))
                     (if my:pomodoro-speak
                         (shell-command-to-string script)
                       (message "%s" script)))))

       (add-hook 'pomodoro:long-rest-hook
                 (lambda ()
                   (let ((script
                          (concat "say -v Kyoko これから"
                                  (number-to-string
                                   (floor pomodoro:long-rest-time))
                                  "分間の休憩です")))
                     (if my:pomodoro-speak
                         (shell-command-to-string script)
                       (message "%s" script))))))

     (defun my:pomodoro-notify ()
       (interactive)
       (shell-command-to-string
        (concat "terminal-notifier -title \"Pomodoro\" -message \""
                "DONE! This time slot has been finished!\"")))
     (add-hook 'pomodoro:finish-work-hook 'my:pomodoro-notify)
     ))
#+END_SRC

** [utility.el] 自作してテスト中の便利関数群

関数定義を[[http://pastelwill.jp/wiki/doku.php?id=emacs:utility.el][別ファイル]]に分離して，Emacs起動の高速化を図っています．各関数を autoload の管理下において，必要なときにロードするように設定しています．

#+BEGIN_SRC emacs-lisp :tangle yes
  (defvar utility-autoloads
    '(takaxp:date
      takaxp:window-resizer takaxp:open-file-ring my:update-alarms-from-file
      my:desktop-notify my:daylight-theme my:night-theme 
      eval-org-buffer kyoko-mad-mode-toggle
      org2dokuwiki-cp-kill-ring open-current-directory set-alarms-from-file
      reload-ical-export show-org-buffer get-random-string init-auto-install
      add-itemize-head insert-formatted-current-date
      insert-formatted-current-time insert-formatted-signature
      export-timeline-business export-timeline-private 
      browse-url-chrome count-words-buffer do-test-applescript
      delete-backup-files recursive-delete-backup-files describe-timer))

  (when (eval-after-autoload-if-found utility-autoloads "utility")
    (global-set-key (kbd "<f12>") 'takaxp:open-file-ring)
    (global-set-key (kbd "C-c t") 'takaxp:date)
    (global-set-key (kbd "C-c f 4") 'takaxp:window-resizer))
#+END_SRC

* お試し中
