init.html

<div id="outline-container-orgheadline193" class="outline-2">
<h2 id="orgheadline193"><span class="section-number-2">13</span> ユーティリティ関数</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-orgheadline191" class="outline-3">
<h3 id="orgheadline191"><span class="section-number-3">13.1</span> [pomodoro.el] ポモドーロの実践</h3>
<div class="outline-text-3" id="text-13-1">
<p>
<a href="https://twitter.com/syohex">@syohex</a> さん謹製の <a href="https://github.com/syohex/emacs-utils/blob/master/pomodoro.el">pomodoro.el</a> に少しカスタマイズしたおれおれ <a href="https://github.com/takaxp/emacs-utils/blob/master/pomodoro.el">pomodoro.el</a> を使っています．以下のように設定すると，ポモドーロの残り時間は表示せず，アイコンだけをモードラインに表示できます．残り時間は <code>M-x pomodoro:mode-line-time-display-toggle</code> すれば，いつでも表示できます．<br  />
</p>

<p>
<code>pomodoro:finish-work-hook</code> ， <code>pomodoro:finish-rest-hook</code> ， <code>pomodoro:long-rest-hook</code> にそれぞれ結びつけてあるのは，<a href="http://www.mactechlab.jp/products-report/16673.html">Macのスピーチ機能</a>です．この例では，Kyoko さんが指示を出してくれます．<br  />
</p>

<p>
<code>M-x pomodoro:start</code> すると，ポモドーロが始まり，8時間後に <code>pomodoro:stop</code> が呼ばれてポモドーロが終了します．<a href="http://www.pomodorotechnique.com/">pomodoro</a> は機械的に仕事をしたい人にピッタリです．人によっては <a href="http://ja.wikipedia.org/wiki/Getting_Things_Done">GTD</a> よりも取っ付きやすいと思います．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-autoload-if-found
 '(pomodoro:start) <span style="color: #8b2252;">"pomodoro"</span> nil t nil
 '(<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#20316;&#26989;&#26178;&#38291;&#32066;&#20102;&#24460;&#12395;&#38283;&#12367;&#12501;&#12449;&#12452;&#12523;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;</span>
   (setq pomodoro:file nil)

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#9679;&#12384;&#12369;&#12391;&#34920;&#29694;&#12377;&#12427;&#65288;&#27531;&#12426;&#26178;&#38291;&#34920;&#31034;&#12394;&#12375;&#65289;</span>
   (setq pomodoro:mode-line-time-display nil)

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#9679;&#12398;&#32622;&#12365;&#25563;&#12360;</span>
   (setq pomodoro:mode-line-work-sign <span style="color: #8b2252;">"&#9679;"</span>)
   (setq pomodoro:mode-line-rest-sign pomodoro:mode-line-work-sign)
   (setq pomodoro:mode-line-long-rest-sign pomodoro:mode-line-work-sign)

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#38263;&#12356;&#20241;&#25001;&#12395;&#20837;&#12427;&#12414;&#12391;&#12395;&#12509;&#12514;&#12489;&#12540;&#12525;&#12377;&#12427;&#22238;&#25968;</span>
   (setq pomodoro:iteration-for-long-rest 2)

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#20316;&#26989;&#26178;&#38291;&#38306;&#36899;</span>
   (setq pomodoro:work-time 120     <span style="color: #b22222;">; </span><span style="color: #b22222;">&#20316;&#26989;&#26178;&#38291;</span>
         pomodoro:rest-time 20      <span style="color: #b22222;">; </span><span style="color: #b22222;">&#20241;&#25001;&#26178;&#38291;</span>
         pomodoro:long-rest-time 60 <span style="color: #b22222;">; </span><span style="color: #b22222;">&#38263;&#12356;&#20241;&#25001;&#26178;&#38291;</span>
         pomodoro:max-iteration 16) <span style="color: #b22222;">; </span><span style="color: #b22222;">&#12509;&#12514;&#12489;&#12540;&#12525;&#12377;&#12427;&#22238;&#25968;</span>

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#12479;&#12452;&#12510;&#12540;&#12398;&#34920;&#31034;&#12434;&#12494;&#12540;&#12510;&#12523;&#12501;&#12455;&#12452;&#12473;&#12395;&#12377;&#12427;</span>
   (set-face-bold-p 'pomodoro:timer-face nil)

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">&#20316;&#26989;&#20013;&#65288;&#36196;&#65289;&#65292;&#20241;&#25001;&#20013;&#65288;&#38738;&#65289;&#65292;&#38263;&#12356;&#20241;&#25001;&#20013;&#65288;&#32209;&#65289;&#12395;&#12377;&#12427;</span>
   (set-face-foreground 'pomodoro:work-face <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #F53838;">#F53838</span><span style="color: #8b2252;">"</span>)
   (set-face-foreground 'pomodoro:rest-face <span style="color: #8b2252;">"</span><span style="color: #ffffff; background-color: #3869FA;">#3869FA</span><span style="color: #8b2252;">"</span>)
   (set-face-foreground 'pomodoro:long-rest-face <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #00B800;">#00B800</span><span style="color: #8b2252;">"</span>)

   (<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">my:pomodoro-speak</span> nil)
   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:pomodoro-speak-toggle</span> ()
     (interactive)
     (setq my:pomodoro-speak (not my:pomodoro-speak)))

   <span style="color: #b22222;">;; </span><span style="color: #b22222;">Mac &#12518;&#12540;&#12470;&#21521;&#12369;&#65294;Kyoko&#12373;&#12435;&#12395;&#25351;&#31034;&#12375;&#12390;&#12418;&#12425;&#12358;</span>
   (<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">pomodoro:with-speak</span> nil)
   (<span style="color: #a020f0;">when</span> pomodoro:with-speak
     (add-hook 'pomodoro:finish-work-hook
               (<span style="color: #a020f0;">lambda</span> ()
                 (<span style="color: #a020f0;">let</span> ((script
                        (concat <span style="color: #8b2252;">"say -v Kyoko "</span>
                                (number-to-string (floor pomodoro:rest-time))
                                <span style="color: #8b2252;">"&#20998;&#38291;&#65292;&#20241;&#25001;&#12375;&#12429;"</span>)))
                   (<span style="color: #a020f0;">if</span> my:pomodoro-speak
                       (shell-command-to-string script)
                     (message <span style="color: #8b2252;">"%s"</span> script)))))

     (add-hook 'pomodoro:finish-rest-hook
               (<span style="color: #a020f0;">lambda</span> ()
                 (<span style="color: #a020f0;">let</span> ((script
                        (concat <span style="color: #8b2252;">"say -v Kyoko "</span>
                                (number-to-string (floor pomodoro:work-time))
                                <span style="color: #8b2252;">"&#20998;&#38291;&#65292;&#20316;&#26989;&#12375;&#12429;"</span>)))
                   (<span style="color: #a020f0;">if</span> my:pomodoro-speak
                       (shell-command-to-string script)
                     (message <span style="color: #8b2252;">"%s"</span> script)))))

     (add-hook 'pomodoro:long-rest-hook
               (<span style="color: #a020f0;">lambda</span> ()
                 (<span style="color: #a020f0;">let</span> ((script
                        (concat <span style="color: #8b2252;">"say -v Kyoko &#12371;&#12428;&#12363;&#12425;"</span>
                                (number-to-string
                                 (floor pomodoro:long-rest-time))
                                <span style="color: #8b2252;">"&#20998;&#38291;&#12398;&#20241;&#25001;&#12391;&#12377;"</span>)))
                   (<span style="color: #a020f0;">if</span> my:pomodoro-speak
                       (shell-command-to-string script)
                     (message <span style="color: #8b2252;">"%s"</span> script))))))

   (<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">my:pomodoro-notify</span> ()
     (shell-command-to-string
      (concat <span style="color: #8b2252;">"terminal-notifier -title \"Pomodoro\" -message \""</span>
              <span style="color: #8b2252;">"DONE! This time slot has been finished!\""</span>)))
   (add-hook 'pomodoro:finish-work-hook 'my:pomodoro-notify)
   ))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline192" class="outline-3">
<h3 id="orgheadline192"><span class="section-number-3">13.2</span> [utility.el] 自作してテスト中の便利関数群</h3>
<div class="outline-text-3" id="text-13-2">
<p>
関数定義を<a href="http://pastelwill.jp/wiki/doku.php?id=emacs:utility.el">別ファイル</a>に分離して，Emacs起動の高速化を図っています．各関数を autoload の管理下において，必要なときにロードするように設定しています．<br  />
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">when</span> (eval-after-autoload-if-found
       '(takaxp:date takaxp:window-resizer eval-org-buffer
                     kyoko-mad-mode-toggle org2dokuwiki-cp-kill-ring
                     open-current-directory set-alarms-from-file
                     takaxp:open-file-ring reload-ical-export
                     show-org-buffer get-random-string init-auto-install
                     add-itemize-head insert-formatted-current-date
                     insert-formatted-current-time insert-formatted-signature
                     export-timeline-business export-timeline-private 
                     browse-url-chrome count-words-buffer do-test-applescript
                     delete-backup-files recursive-delete-backup-files
                     describe-timer)
       <span style="color: #8b2252;">"utility"</span> nil t)
  <span style="color: #b22222;">;;         </span><span style="color: #b22222;">'((message "Loading utility.el ... [done]")))</span>

  (global-set-key (kbd <span style="color: #8b2252;">"&lt;f12&gt;"</span>) 'takaxp:open-file-ring)
  (global-set-key (kbd <span style="color: #8b2252;">"C-c t"</span>) 'takaxp:date)
  (global-set-key (kbd <span style="color: #8b2252;">"C-c f 4"</span>) 'takaxp:window-resizer))
</pre>
</div>
</div>
</div>
</div>
