init.el

(defvar utility-autoloads
  '(takaxp:date
    takaxp:window-resizer takaxp:open-file-ring my:update-alarms-from-file
    my:desktop-notify my:daylight-theme my:night-theme 
    eval-org-buffer kyoko-mad-mode-toggle
    org2dokuwiki-cp-kill-ring open-current-directory set-alarms-from-file
    reload-ical-export show-org-buffer get-random-string init-auto-install
    add-itemize-head insert-formatted-current-date
    insert-formatted-current-time insert-formatted-signature
    export-timeline-business export-timeline-private 
    browse-url-chrome count-words-buffer do-test-applescript
    delete-backup-files recursive-delete-backup-files describe-timer))

(when (eval-after-autoload-if-found utility-autoloads "utility")
  (global-set-key (kbd "<f12>") 'takaxp:open-file-ring)
  (global-set-key (kbd "C-c t") 'takaxp:date)
  (global-set-key (kbd "C-c f 4") 'takaxp:window-resizer))

(provide 'init)
