init.org
** yascroll

  - http://d.hatena.ne.jp/m2ym/20110401/1301617991
  - 2015-03-15: smooth-scroll との組み合わせで重いため試用停止中

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package yascroll
    :disabled t
    :init
    (global-yascroll-bar-mode 1)
    (setq yascroll:delay-to-hide 1)
    (setq yascroll:disabled-modes '(org))
    (set-face-foreground 'yascroll:thumb-fringe "#b2cefb")
    (set-face-background 'yascroll:thumb-fringe "#b2cefb")
    )
#+END_SRC

* COMMENT provide

#+BEGIN_SRC emacs-lisp :tangle yes :exports no
  (provide 'init)
#+END_SRC
