init.html

<div id="outline-container-orgheadline195" class="outline-2">
<h2 id="orgheadline195"><span class="section-number-2">14</span> お試し中</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-orgheadline194" class="outline-3">
<h3 id="orgheadline194"><span class="section-number-3">14.1</span> yascroll</h3>
<div class="outline-text-3" id="text-14-1">
<ul class="org-ul">
<li><a href="http://d.hatena.ne.jp/m2ym/20110401/1301617991">http://d.hatena.ne.jp/m2ym/20110401/1301617991</a><br  /></li>
<li>2015-03-15: smooth-scroll との組み合わせで重いため試用停止中<br  /></li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package yascroll
  <span style="color: #483d8b;">:disabled</span> t
  <span style="color: #483d8b;">:init</span>
  (global-yascroll-bar-mode 1)
  (setq yascroll:delay-to-hide 1)
  (setq yascroll:disabled-modes '(org))
  (set-face-foreground 'yascroll:thumb-fringe <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #b2cefb;">#b2cefb</span><span style="color: #8b2252;">"</span>)
  (set-face-background 'yascroll:thumb-fringe <span style="color: #8b2252;">"</span><span style="color: #000000; background-color: #b2cefb;">#b2cefb</span><span style="color: #8b2252;">"</span>)
  )
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline196" class="outline-2">
<h2 id="orgheadline196"><span class="section-number-2">15</span> provide</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">provide</span> '<span style="color: #008b8b;">init</span>)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Takaaki Ishikawa</p>
<p class="date">Created: 2015-06-05 Fri 00:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
